[{"loc":"195-196","authors":["Stephen Hawking"],"date":"2019-02-25T21:50:52.000Z","content":"Edwin Hubble made the landmark observation that wherever you look, distant galaxies are moving rapidly away from us. In other words, the universe is expanding."},{"loc":"273-274","authors":["Stephen Hawking"],"date":"2019-02-25T22:07:20.000Z","content":"Humanity’s deepest desire for knowledge is justification enough for our continuing quest."},{"loc":"332-333","authors":["Stephen Hawking"],"date":"2019-02-25T22:22:48.000Z","content":"The fact that light travels at a finite, but very high, speed was first discovered in 1676 by the Danish astronomer Ole Christensen Roemer."},{"loc":"426-442","authors":["Stephen Hawking"],"date":"2019-02-26T21:01:29.000Z","content":"As we have seen, Maxwell’s equations predicted that the speed of light should be the same whatever the speed of the source, and this has been confirmed by accurate measurements. It follows from this that if a pulse of light is emitted at a particular time at a particular point in space, then as time goes on it will spread out as a sphere of light whose size and position are independent of the speed of the source. After one millionth of a second the light will have spread out to form a sphere with a radius of 300 meters; after two millionths of a second, the radius will be 600 meters; and so on. It will be like the ripples that spread out on the surface of a pond when a stone is thrown in. The ripples spread out as a circle that gets bigger as time goes on. If one stacks snapshots of the ripples at different times one above the other, the expanding circle of ripples will mark out a cone whose tip is at the place and time at which the stone hit the water (Fig. 2.3). Similarly, the light spreading out from an event forms a (three-dimensional) cone in (the four-dimensional) space-time. This cone is called the future light cone of the event. In the same way we can draw another cone, called the past light cone, which is the set of events from which a pulse of light is able to reach the given event (Fig. 2.4)."},{"loc":"453-453","authors":["Stephen Hawking"],"date":"2019-02-26T21:10:08.000Z","content":"…when we look at the universe, we are seeing it as it was in the past."},{"loc":"463-464","authors":["Stephen Hawking"],"date":"2019-02-26T21:13:43.000Z","content":"…gravitational effects should travel with infinite velocity, instead of at or below the speed of light, as the special theory of relativity required."},{"loc":"472-473","authors":["Stephen Hawking"],"date":"2019-02-26T21:17:19.000Z","content":"A geodesic is the shortest (or longest) path between two nearby points."},{"loc":"473-474","authors":["Stephen Hawking"],"date":"2019-02-26T21:17:26.000Z","content":"A geodesic on the earth is called a great circle, and is the shortest route between two points"},{"loc":"475-477","authors":["Stephen Hawking"],"date":"2019-02-26T21:18:11.000Z","content":"In general relativity, bodies always follow straight lines in four-dimensional space-time, but they nevertheless appear to us to move along curved paths in our three-dimensional space."},{"loc":"512-515","authors":["Stephen Hawking"],"date":"2019-02-26T21:29:33.000Z","content":"Consider a pair of twins. Suppose that one twin goes to live on the top of a mountain while the other stays at sea level. The first twin would age faster than the second. Thus, if they met again, one would be older than the other. In this case, the difference in ages would be very small, but it would be much larger if one of the twins went for a long trip in a spaceship at nearly the speed of light. When he returned, he would be much younger than the one who stayed on earth. This is known as the twins paradox."},{"loc":"516-517","authors":["Stephen Hawking"],"date":"2019-02-26T21:31:02.000Z","content":"In the theory of relativity there is no unique absolute time, but instead each individual has his own personal measure of time that depends on where he is and how he is moving."},{"loc":"522-523","authors":["Stephen Hawking"],"date":"2019-02-26T21:32:19.000Z","content":"Space and time not only affect but also are affected by everything that happens in the universe."},{"loc":"589-591","authors":["Stephen Hawking"],"date":"2019-02-26T21:45:05.000Z","content":"…even the size of a galaxy’s red shift is not random, but is directly proportional to the galaxy’s distance from us. Or, in other words, the farther a galaxy is, the faster it is moving away! And that meant that the universe could not be static, as everyone previously had thought, but is in fact expanding; the distance between the different galaxies is growing all the time."},{"loc":"696-703","authors":["Stephen Hawking"],"date":"2019-02-26T22:03:24.000Z","content":"All of the Friedmann solutions have the feature that at some time in the past (between ten and twenty thousand million years ago) the distance between neighboring galaxies must have been zero. At that time, which we call the big bang, the density of the universe and the curvature of space-time would have been infinite. Because mathematics cannot really handle infinite numbers, this means that the general theory of relativity (on which Friedmann’s solutions are based) predicts that there is a point in the universe where the theory itself breaks down. Such a point is an example of what mathematicians call a singularity. In fact, all our theories of science are formulated on the assumption that space-time is smooth and nearly flat, so they break down at the big bang singularity, where the curvature of space-time is infinite. This means that even if there were events before the big bang, one could not use them to determine what would happen afterward, because predictability would break down at the big bang."},{"loc":"742-747","authors":["Stephen Hawking"],"date":"2019-02-26T22:13:36.000Z","content":"Does general relativity predict that our universe should have had a big bang, a beginning of time? The answer to this came out of a completely different approach introduced by a British mathematician and physicist, Roger Penrose, in 1965. Using the way light cones behave in general relativity, together with the fact that gravity is always attractive, he showed that a star collapsing under its own gravity is trapped in a region whose surface eventually shrinks to zero size. And, since the surface of the region shrinks to zero, so too must its volume. All the matter in the star will be compressed into a region of zero volume, so the density of matter and the curvature of space-time become infinite. In other words, one has a singularity contained within a region of space-time known as a black hole."},{"loc":"934-935","authors":["Stephen Hawking"],"date":"2019-03-01T21:53:36.000Z","content":"There are a number of different varieties of quarks: there are six “flavors,” which we call up, down, strange, charmed, bottom, and top."}]