[{"loc":"75-78","authors":["George Orwell"],"date":"2020-04-24T18:05:19.000Z","content":"Man is the only creature that consumes without producing. He does not give milk, he does not lay eggs, he is too weak to pull the plough, he cannot run fast enough to catch rabbits. Yet he is lord of all the animals. He sets them to work, he gives back to them the bare minimum that will prevent them from starving, and the rest he keeps for himself. Our labour tills the soil, our dung fertilises it, and yet there is not one of us that owns more than his bare skin."},{"loc":"94-97","authors":["George Orwell"],"date":"2020-04-24T18:08:44.000Z","content":"“And remember, comrades, your resolution must never falter. No argument must lead you astray. Never listen when they tell you that Man and the animals have a common interest, that the prosperity of the one is the prosperity of the others. It is all lies. Man serves the interests of no creature except himself. And among us animals let there be perfect unity, perfect comradeship in the struggle. All men are enemies. All animals are comrades.”"},{"loc":"105-108","authors":["George Orwell"],"date":"2020-04-24T18:11:11.000Z","content":"…remember also that in fighting against Man, we must not come to resemble him. Even when you have conquered him, do not adopt his vices. No animal must ever live in a house, or sleep in a bed, or wear clothes, or drink alcohol, or smoke tobacco, or touch money, or engage in trade. All the habits of Man are evil. And, above all, no animal must ever tyrannise over his own kind. Weak or strong, clever or simple, we are all brothers. No animal must ever kill any other animal. All animals are equal."},{"loc":"141-143","authors":["George Orwell"],"date":"2020-04-24T18:15:40.000Z","content":"They did not know when the Rebellion predicted by Major would take place, they had no reason for thinking that it would be within their own lifetime, but they saw clearly that it was their duty to prepare for it."},{"loc":"501-505","authors":["George Orwell"],"date":"2020-04-25T17:34:26.000Z","content":"…animal here appreciates the sacrifice that Comrade Napoleon has made in taking this extra labour upon himself. Do not imagine, comrades, that leadership is a pleasure! On the contrary, it is a deep and heavy responsibility. No one believes more firmly than Comrade Napoleon that all animals are equal. He would be only too happy to let you make your decisions for yourselves. But sometimes you might make the wrong decisions, comrades, and then where should we be? Suppose you had decided to follow Snowball, with his moonshine of windmills — Snowball, who, as we now know, was no better than a criminal?”"},{"loc":"567-569","authors":["George Orwell"],"date":"2020-04-25T17:42:48.000Z","content":"From now onwards Animal Farm would engage in trade with the neighbouring farms: not, of course, for any commercial purpose, but simply in order to obtain certain materials which were urgently necessary."},{"loc":"580-580","authors":["George Orwell"],"date":"2020-04-25T17:44:12.000Z","content":"“Long live Animal Farm!”"},{"loc":"583-584","authors":["George Orwell"],"date":"2020-04-25T17:44:49.000Z","content":"“Are you certain that this is not something that you have dreamed, comrades? Have you any record of such a resolution? Is it written down anywhere?”"},{"loc":"645-645","authors":["George Orwell"],"date":"2020-04-25T17:52:40.000Z","content":"Forward, comrades! Long live the windmill! Long live Animal Farm!”"},{"loc":"727-730","authors":["George Orwell"],"date":"2020-04-25T18:03:14.000Z","content":"“Our Leader, Comrade Napoleon,” announced Squealer, speaking very slowly and firmly, “has stated categorically — categorically, comrade — that Snowball was Jones’s agent from the very beginning — yes, and from long before the Rebellion was ever thought of.” “Ah, that is different!” said Boxer. “If Comrade Napoleon says it, it must be right.”"},{"loc":"788-789","authors":["George Orwell"],"date":"2020-04-25T18:10:34.000Z","content":"“‘Beasts of England’ was the song of the Rebellion. But the Rebellion is now completed. The execution of the traitors this afternoon was the final act. The enemy both external and internal has been defeated."},{"loc":"789-791","authors":["George Orwell"],"date":"2020-04-25T18:10:43.000Z","content":"In ‘Beasts of England’ we expressed our longing for a better society in days to come. But that society has now been established. Clearly this song has no longer any purpose."},{"loc":"807-810","authors":["George Orwell"],"date":"2020-04-25T18:13:02.000Z","content":"Sunday mornings Squealer, holding down a long strip of paper with his trotter, would read out to them lists of figures proving that the production of every class of foodstuff had increased by two hundred per cent, three hundred per cent, or five hundred per cent, as the case might be. The animals saw no reason to disbelieve him, especially as they could no longer remember very clearly what conditions had been like before the Rebellion. All the same, there were days when they felt that they would sooner have had less figures and more food."},{"loc":"811-812","authors":["George Orwell"],"date":"2020-04-25T18:13:17.000Z","content":"Napoleon himself was not seen in public as often as once in a fortnight. When he did appear, he was attended not only by his retinue of dogs but by a black cockerel who marched in front of him and acted as a kind of trumpeter..."},{"loc":"815-815","authors":["George Orwell"],"date":"2020-04-25T18:13:59.000Z","content":"It was also announced that the gun would be fired every year on Napoleon’s birthday, as well as on the other two anniversaries."},{"loc":"816-818","authors":["George Orwell"],"date":"2020-04-25T18:14:10.000Z","content":"Napoleon was now never spoken of simply as “Napoleon.” He was always referred to in formal style as “our Leader, Comrade Napoleon,” and this pigs liked to invent for him such titles as Father of All Animals, Terror of Mankind, Protector of the Sheep-fold, Ducklings’ Friend, and the like."},{"loc":"820-822","authors":["George Orwell"],"date":"2020-04-25T18:15:17.000Z","content":"You would often hear one hen remark to another, “Under the guidance of our Leader, Comrade Napoleon, I have laid five eggs in six days”; or two cows, enjoying a drink at the pool, would exclaim, “Thanks to the leadership of Comrade Napoleon, how excellent this water tastes!”"},{"loc":"1186-1186","authors":["George Orwell"],"date":"2020-04-25T21:36:51.000Z","content":"ALL ANIMALS ARE EQUAL BUT SOME ANIMALS ARE MORE EQUAL THAN OTHERS"},{"loc":"1219-1219","authors":["George Orwell"],"date":"2020-04-25T21:40:50.000Z","content":"“If you have your lower animals to contend with,” he said, “we have our lower classes!”"}]