[{"loc":"136-139","authors":["James Clear"],"date":"2020-06-01T18:03:40.000Z","content":"We all face challenges in life. This injury was one of mine, and the experience taught me a critical lesson: changes that seem small and unimportant at first will compound into remarkable results if you’re willing to stick with them for years. We all deal with setbacks but in the long run, the quality of our lives often depends on the quality of our habits. With the same habits, you’ll end up with the same results. But with better habits, anything is possible."},{"loc":"221-222","authors":["James Clear"],"date":"2020-06-01T18:30:15.000Z","content":"Why do small improvements accumulate into such remarkable results, and how can you replicate this approach in your own life?"},{"loc":"223-225","authors":["James Clear"],"date":"2020-06-01T18:31:45.000Z","content":"Too often, we convince ourselves that massive success requires massive action. Whether it is losing weight, building a business, writing a book, winning a championship, or achieving any other goal, we put pressure on ourselves to make some earth-shattering improvement that everyone will talk about."},{"loc":"269-271","authors":["James Clear"],"date":"2020-06-01T18:39:17.000Z","content":"Productivity compounds. Accomplishing one extra task is a small feat on any given day, but it counts for a lot over an entire career. The effect of automating an old task or mastering a new skill can be even greater. The more tasks you can handle without thinking, the more your brain is free to focus on other areas."},{"loc":"271-274","authors":["James Clear"],"date":"2020-06-01T18:39:57.000Z","content":"Knowledge compounds. Learning one new idea won’t make you a genius, but a commitment to lifelong learning can be transformative. Furthermore, each book you read not only teaches you something new but also opens up different ways of thinking about old ideas. As Warren Buffett says, “That’s how knowledge works. It builds up, like compound interest.”"},{"loc":"280-280","authors":["James Clear"],"date":"2020-06-01T18:41:44.000Z","content":"…little stresses compound into serious health issues."},{"loc":"304-306","authors":["James Clear"],"date":"2020-06-01T18:45:39.000Z","content":"Complaining about not achieving success despite working hard is like complaining about an ice cube not melting when you heated it from twenty-five to thirty-one degrees. Your work was not wasted; it is just being stored. All the action happens at thirty-two degrees."},{"loc":"312-314","authors":["James Clear"],"date":"2020-06-01T18:47:38.000Z","content":"“When nothing seems to help, I go and look at a stonecutter hammering away at his rock, perhaps a hundred times without as much as a crack showing in it. Yet at the hundred and first blow it will split in two, and I know it was not that last blow that did it—but all that had gone before.”"},{"loc":"331-332","authors":["James Clear"],"date":"2020-06-01T18:50:28.000Z","content":"What’s the difference between systems and goals? It’s a distinction I first learned from Scott Adams, the cartoonist behind the Dilbert comic. Goals are about the results you want to achieve. Systems are about the processes that lead to those results."},{"loc":"344-346","authors":["James Clear"],"date":"2020-06-01T18:56:24.000Z","content":"Goals are good for setting a direction, but systems are best for making progress. A handful of problems arise when you spend too much time thinking about your goals and not enough time designing your systems."},{"loc":"353-353","authors":["James Clear"],"date":"2020-06-01T18:58:13.000Z","content":"Achieving a goal is only a momentary change."},{"loc":"357-360","authors":["James Clear"],"date":"2020-06-01T18:59:03.000Z","content":"Achieving a goal only changes your life for the moment. That’s the counterintuitive thing about improvement. We think we need to change our results, but the results are not the problem. What we really need to change are the systems that cause those results. When you solve problems at the results level, you only solve them temporarily. In order to improve for good, you need to solve problems at the systems level. Fix the inputs and the outputs will fix themselves."},{"loc":"362-362","authors":["James Clear"],"date":"2020-06-01T19:00:41.000Z","content":"The problem with a goals-first mentality is that you’re continually putting happiness off until the next milestone."},{"loc":"365-366","authors":["James Clear"],"date":"2020-06-01T19:01:33.000Z","content":"…goals create an “either-or” conflict: either you achieve your goal and are successful or you fail and you are a disappointment."},{"loc":"368-370","authors":["James Clear"],"date":"2020-06-01T19:06:23.000Z","content":"When you fall in love with the process rather than the product, you don’t have to wait to give yourself permission to be happy. You can be satisfied anytime your system is running. And a system can be successful in many different forms, not just the one you first envision."},{"loc":"372-374","authors":["James Clear"],"date":"2020-06-01T19:06:49.000Z","content":"When all of your hard work is focused on a particular goal, what is left to push you forward after you achieve it? This is why many people find themselves reverting to their old habits after accomplishing a goal."},{"loc":"374-376","authors":["James Clear"],"date":"2020-06-01T19:07:08.000Z","content":"The purpose of setting goals is to win the game. The purpose of building systems is to continue playing the game. True long-term thinking is goal-less thinking. It’s not about any single accomplishment. It is about the cycle of endless refinement and continuous improvement. Ultimately, it is your commitment to the process that will determine your progress."},{"loc":"420-422","authors":["James Clear"],"date":"2020-06-01T21:09:53.000Z","content":"Many people begin the process of changing their habits by focusing on what they want to achieve. This leads us to outcome-based habits. The alternative is to build identity-based habits. With this approach, we start by focusing on who we wish to become."},{"loc":"432-435","authors":["James Clear"],"date":"2020-06-01T21:13:44.000Z","content":"Most people don’t even consider identity change when they set out to improve. They just think, “I want to be skinny (outcome) and if I stick to this diet, then I’ll be skinny (process).” They set goals and determine the actions they should take to achieve those goals without considering the beliefs that drive their actions. They never shift the way they look at themselves, and they don’t realize that their old identity can sabotage their new plans for change."},{"loc":"440-442","authors":["James Clear"],"date":"2020-06-01T21:16:19.000Z","content":"Behavior that is incongruent with the self will not last. You may want more money, but if your identity is someone who consumes rather than creates, then you’ll continue to be pulled toward spending rather than earning."},{"loc":"452-454","authors":["James Clear"],"date":"2020-06-01T21:19:27.000Z","content":"The ultimate form of intrinsic motivation is when a habit becomes part of your identity. It’s one thing to say I’m the type of person who wants this. It’s something very different to say I’m the type of person who is this."},{"loc":"454-455","authors":["James Clear"],"date":"2020-06-01T21:20:13.000Z","content":"The more pride you have in a particular aspect of your identity, the more motivated you will be to maintain the habits associated with it."},{"loc":"461-464","authors":["James Clear"],"date":"2020-06-01T21:27:48.000Z","content":"The goal is not to read a book, the goal is to become a reader. The goal is not to run a marathon, the goal is to become a runner. The goal is not to learn an instrument, the goal is to become a musician."},{"loc":"487-489","authors":["James Clear"],"date":"2020-06-01T21:38:52.000Z","content":"Over the long run, however, the real reason you fail to stick with habits is that your self-image gets in the way. This is why you can’t get too attached to one version of your identity. Progress requires unlearning. Becoming the best version of yourself requires you to continuously edit your beliefs, and to upgrade and expand your identity."},{"loc":"492-493","authors":["James Clear"],"date":"2020-06-02T10:20:26.000Z","content":"Your identity emerges out of your habits. You are not born with preset beliefs. Every belief, including those about yourself, is learned and conditioned through experience."},{"loc":"496-497","authors":["James Clear"],"date":"2020-06-02T10:21:04.000Z","content":"The more you repeat a behavior, the more you reinforce the identity associated with that behavior."},{"loc":"501-501","authors":["James Clear"],"date":"2020-06-02T10:22:09.000Z","content":"The more evidence you have for a belief, the more strongly you will believe it."},{"loc":"508-509","authors":["James Clear"],"date":"2020-06-02T10:24:36.000Z","content":"The effect of one-off experiences tends to fade away while the effect of habits gets reinforced with time, which means your habits contribute most of the evidence that shapes your identity."},{"loc":"518-519","authors":["James Clear"],"date":"2020-06-02T10:27:42.000Z","content":"The most practical way to change who you are is to change what you do."},{"loc":"528-530","authors":["James Clear"],"date":"2020-06-02T10:29:01.000Z","content":"New identities require new evidence. If you keep casting the same votes you’ve always cast, you’re going to get the same results you’ve always had. If nothing changes, nothing is going to change."},{"loc":"532-532","authors":["James Clear"],"date":"2020-06-02T10:29:33.000Z","content":"…decide who you want to be."},{"loc":"536-538","authors":["James Clear"],"date":"2020-06-02T10:30:10.000Z","content":"Ask yourself, “Who is the type of person that could get the outcome I want?” Who is the type of person that could lose forty pounds? Who is the type of person that could learn a new language? Who is the type of person that could run a successful start-up?"},{"loc":"538-540","authors":["James Clear"],"date":"2020-06-02T10:30:25.000Z","content":"For example, “Who is the type of person who could write a book?” It’s probably someone who is consistent and reliable. Now your focus shifts from writing a book (outcome-based) to being the type of person who is consistent and reliable (identity-based)."},{"loc":"553-555","authors":["James Clear"],"date":"2020-06-02T10:32:43.000Z","content":"But the true question is: “Are you becoming the type of person you want to become?” The first step is not what or how, but who. You need to know who you want to be. Otherwise, your quest for change is like a boat without a rudder."},{"loc":"558-561","authors":["James Clear"],"date":"2020-06-02T10:34:04.000Z","content":"Building better habits isn’t about littering your day with life hacks. It’s not about flossing one tooth each night or taking a cold shower each morning or wearing the same outfit each day. It’s not about achieving external measures of success like earning more money, losing weight, or reducing stress. Habits can help you achieve all of these things, but fundamentally they are not about having something. They are about becoming someone."},{"loc":"567-568","authors":["James Clear"],"date":"2020-06-02T10:35:38.000Z","content":"Becoming the best version of yourself requires you to continuously edit your beliefs, and to upgrade and expand your identity."},{"loc":"588-589","authors":["James Clear"],"date":"2020-06-02T18:44:10.000Z","content":"“behaviors followed by satisfying consequences tend to be repeated and those that produce unpleasant consequences are less likely to be repeated.”"},{"loc":"612-612","authors":["James Clear"],"date":"2020-06-02T18:50:36.000Z","content":"The primary reason the brain remembers the past is to better predict what will work in the future."},{"loc":"613-616","authors":["James Clear"],"date":"2020-06-02T18:52:34.000Z","content":"Habit formation is incredibly useful because the conscious mind is the bottleneck of the brain. It can only pay attention to one problem at a time. As a result, your brain is always working to preserve your conscious attention for whatever task is most essential. Whenever possible, the conscious mind likes to pawn off tasks to the nonconscious mind to do automatically. This is precisely what happens when a habit is formed. Habits reduce cognitive load and free up mental capacity, so you can allocate your attention to other tasks."},{"loc":"626-627","authors":["James Clear"],"date":"2020-06-02T18:57:16.000Z","content":"Building habits in the present allows you to do more of what you want in the future."},{"loc":"633-633","authors":["James Clear"],"date":"2020-06-02T18:58:25.000Z","content":"First, there is the cue. The cue triggers your brain to initiate a behavior. It is a bit of information that predicts a reward."},{"loc":"645-646","authors":["James Clear"],"date":"2020-06-02T19:02:15.000Z","content":"Cues are meaningless until they are interpreted. The thoughts, feelings, and emotions of the observer are what transform a cue into a craving."},{"loc":"646-649","authors":["James Clear"],"date":"2020-06-02T19:04:57.000Z","content":"The third step is the response. The response is the actual habit you perform, which can take the form of a thought or an action. Whether a response occurs depends on how motivated you are and how much friction is associated with the behavior. If a particular action requires more physical or mental effort than you are willing to expend, then you won’t do it. Your response also depends on your ability. It sounds simple, but a habit can occur only if you are capable of doing it."},{"loc":"651-653","authors":["James Clear"],"date":"2020-06-02T19:08:10.000Z","content":"Finally, the response delivers a reward. Rewards are the end goal of every habit. The cue is about noticing the reward. The craving is about wanting the reward. The response is about obtaining the reward. We chase rewards because they serve two purposes: (1) they satisfy us and (2) they teach us."},{"loc":"674-676","authors":["James Clear"],"date":"2020-06-02T19:13:22.000Z","content":"We can split these four steps into two phases: the problem phase and the solution phase. The problem phase includes the cue and the craving, and it is when you realize that something needs to change. The solution phase includes the response and the reward, and it is when you take action and achieve the change you desire."},{"loc":"735-739","authors":["James Clear"],"date":"2020-06-02T19:21:42.000Z","content":"The 1st law (Cue): Make it obvious. The 2nd law (Craving): Make it attractive. The 3rd law (Response): Make it easy. The 4th law (Reward): Make it satisfying."},{"loc":"792-793","authors":["James Clear"],"date":"2020-06-02T19:29:23.000Z","content":"We underestimate how much our brains and bodies can do without thinking."},{"loc":"798-800","authors":["James Clear"],"date":"2020-06-02T19:30:39.000Z","content":"This is one of the most surprising insights about our habits: you don’t need to be aware of the cue for a habit to begin. You can notice an opportunity and take action without dedicating conscious attention to it. This is what makes habits useful."},{"loc":"801-803","authors":["James Clear"],"date":"2020-06-02T21:13:32.000Z","content":"Unless someone points it out, you may not notice that you cover your mouth with your hand whenever you laugh, that you apologize before asking a question, or that you have a habit of finishing other people’s sentences."},{"loc":"803-804","authors":["James Clear"],"date":"2020-06-02T21:14:12.000Z","content":"And the more you repeat these patterns, the less likely you become to question what you’re doing and why you’re doing it."},{"loc":"810-813","authors":["James Clear"],"date":"2020-06-02T21:15:28.000Z","content":"Over time, the cues that spark our habits become so common that they are essentially invisible: the treats on the kitchen counter, the remote control next to the couch, the phone in our pocket. Our responses to these cues are so deeply encoded that it may feel like the urge to act comes from nowhere. For this reason, we must begin the process of behavior change with awareness."},{"loc":"815-816","authors":["James Clear"],"date":"2020-06-02T21:22:24.000Z","content":"“Until you make the unconscious conscious, it will direct your life and you will call it fate.”"},{"loc":"830-833","authors":["James Clear"],"date":"2020-06-02T21:27:19.000Z","content":"The more automatic a behavior becomes, the less likely we are to consciously think about it. And when we’ve done something a thousand times before, we begin to overlook things. We assume that the next time will be just like the last. We’re so used to doing what we’ve always done that we don’t stop to question whether it’s the right thing to do at all. Many of our failures in performance are largely attributable to a lack of self-awareness."},{"loc":"833-836","authors":["James Clear"],"date":"2020-06-02T21:30:25.000Z","content":"One of our greatest challenges in changing habits is maintaining awareness of what we are actually doing. This helps explain why the consequences of bad habits can sneak up on us. We need a “point-and-call” system for our personal lives. That’s the origin of the Habits Scorecard, which is a simple exercise you can use to become more aware of your behavior."},{"loc":"865-868","authors":["James Clear"],"date":"2020-06-02T21:41:18.000Z","content":"If you’re still having trouble determining how to rate a particular habit, here is a question I like to use: “Does this behavior help me become the type of person I wish to be? Does this habit cast a vote for or against my desired identity?” Habits that reinforce your desired identity are usually good. Habits that conflict with your desired identity are usually bad."},{"loc":"873-874","authors":["James Clear"],"date":"2020-06-02T21:45:10.000Z","content":"The first step to changing bad habits is to be on the lookout for them. If you feel like you need extra help, then you can try Pointing-and-Calling in your own life. Say out loud the action that you are thinking of taking and what the outcome will be."},{"loc":"876-879","authors":["James Clear"],"date":"2020-06-02T21:47:14.000Z","content":"Hearing your bad habits spoken aloud makes the consequences seem more real. It adds weight to the action rather than letting yourself mindlessly slip into an old routine. This approach is useful even if you’re simply trying to remember a task on your to-do list. Just saying out loud, “Tomorrow, I need to go to the post office after lunch,” increases the odds that you’ll actually do it. You’re getting yourself to acknowledge the need for action—and that can make all the difference."},{"loc":"902-903","authors":["James Clear"],"date":"2020-06-02T21:54:17.000Z","content":"The sentence they filled out is what researchers refer to as an implementation intention, which is a plan you make beforehand about when and where to act. That is, how you intend to implement a particular habit."},{"loc":"906-907","authors":["James Clear"],"date":"2020-06-02T21:56:06.000Z","content":"Broadly speaking, the format for creating an implementation intention is: “When situation X arises, I will perform response Y.”"},{"loc":"914-915","authors":["James Clear"],"date":"2020-06-02T21:57:50.000Z","content":"…people who make a specific plan for when and where they will perform a new habit are more likely to follow through. Too many people try to change their habits without these basic details figured"},{"loc":"915-918","authors":["James Clear"],"date":"2020-06-02T21:59:39.000Z","content":"We tell ourselves, “I’m going to eat healthier” or “I’m going to write more,” but we never say when and where these habits are going to happen. We leave it up to chance and hope that we will “just remember to do it” or feel motivated at the right time. An implementation intention sweeps away foggy notions like “I want to work out more” or “I want to be more productive” or “I should vote” and transforms them into a concrete plan of action."},{"loc":"920-922","authors":["James Clear"],"date":"2020-06-03T18:06:34.000Z","content":"Once an implementation intention has been set, you don’t have to wait for inspiration to strike. Do I write a chapter today or not? Do I meditate this morning or at lunch? When the moment of action occurs, there is no need to make a decision. Simply follow your predetermined plan."},{"loc":"935-936","authors":["James Clear"],"date":"2020-06-03T18:15:51.000Z","content":"The goal is to make the time and location so obvious that, with enough repetition, you get an urge to do the right thing at the right time, even if you can’t say why."},{"loc":"950-952","authors":["James Clear"],"date":"2020-06-03T18:17:53.000Z","content":"Diderot’s behavior is not uncommon. In fact, the tendency for one purchase to lead to another one has a name: the Diderot Effect. The Diderot Effect states that obtaining a new possession often creates a spiral of consumption that leads to additional purchases."},{"loc":"958-960","authors":["James Clear"],"date":"2020-06-03T18:21:26.000Z","content":"When it comes to building new habits, you can use the connectedness of behavior to your advantage. One of the best ways to build a new habit is to identify a current habit you already do each day and then stack your new behavior on top. This is called habit stacking."},{"loc":"922-924","authors":["James Clear"],"date":"2020-06-03T18:22:40.000Z","content":"The simple way to apply this strategy to your habits is to fill out this sentence: I will [BEHAVIOR] at [TIME] in [LOCATION]."},{"loc":"963-964","authors":["James Clear"],"date":"2020-06-03T18:22:49.000Z","content":"The habit stacking formula is: “After [CURRENT HABIT], I will [NEW HABIT].”"},{"loc":"989-991","authors":["James Clear"],"date":"2020-06-03T18:27:32.000Z","content":"Overall, habit stacking allows you to create a set of simple rules that guide your future behavior. It’s like you always have a game plan for which action should come next. Once you get comfortable with this approach, you can develop general habit stacks to guide you whenever the situation is appropriate:"},{"loc":"997-997","authors":["James Clear"],"date":"2020-06-03T18:29:00.000Z","content":"Minimalism. When I buy a new item, I will give something away. (“One in, one out.”)"},{"loc":"1000-1003","authors":["James Clear"],"date":"2020-06-03T18:29:59.000Z","content":"No matter how you use this strategy, the secret to creating a successful habit stack is selecting the right cue to kick things off. Unlike an implementation intention, which specifically states the time and location for a given behavior, habit stacking implicitly has the time and location built into it. When and where you choose to insert a habit into your daily routine can make a big difference."},{"loc":"1007-1007","authors":["James Clear"],"date":"2020-06-03T18:32:00.000Z","content":"One way to find the right trigger for your habit stack is by brainstorming a list of your current habits."},{"loc":"1026-1030","authors":["James Clear"],"date":"2020-06-03T18:34:03.000Z","content":"Habit stacking works best when the cue is highly specific and immediately actionable. Many people select cues that are too vague. I made this mistake myself. When I wanted to start a push-up habit, my habit stack was “When I take a break for lunch, I will do ten push-ups.” At first glance, this sounded reasonable. But soon, I realized the trigger was unclear. Would I do my push-ups before I ate lunch? After I ate lunch? Where would I do them? After a few inconsistent days, I changed my habit stack to: “When I close my laptop for lunch, I will do ten push-ups next to my desk.” Ambiguity gone."},{"loc":"1030-1033","authors":["James Clear"],"date":"2020-06-03T18:36:10.000Z","content":"Habits like “read more” or “eat better” are worthy causes, but these goals do not provide instruction on how and when to act. Be specific and clear: After I close the door. After I brush my teeth. After I sit down at the table. The specificity is important. The more tightly bound your new habit is to a specific cue, the better the odds are that you will notice when the time comes to act."},{"loc":"1033-1035","authors":["James Clear"],"date":"2020-06-03T18:36:49.000Z","content":"Strategies like implementation intentions and habit stacking are among the most practical ways to create obvious cues for your habits and design a clear plan for when and where to take action."},{"loc":"1085-1088","authors":["James Clear"],"date":"2020-06-03T18:46:55.000Z","content":"Given that we are more dependent on vision than on any other sense, it should come as no surprise that visual cues are the greatest catalyst of our behavior. For this reason, a small change in what you see can lead to a big shift in what you do. As a result, you can imagine how important it is to live and work in environments that are filled with productive cues and devoid of unproductive ones."},{"loc":"1095-1096","authors":["James Clear"],"date":"2020-06-03T18:48:28.000Z","content":"Every habit is initiated by a cue, and we are more likely to notice cues that stand out."},{"loc":"1118-1119","authors":["James Clear"],"date":"2020-06-03T18:53:45.000Z","content":"By sprinkling triggers throughout your surroundings, you increase the odds that you’ll think about your habit throughout the day. Make sure the best choice is the most obvious one. Making a better decision is easy and natural when the cues for good habits are right in front of you."},{"loc":"1124-1125","authors":["James Clear"],"date":"2020-06-03T19:01:07.000Z","content":"The cues that trigger a habit can start out very specific, but over time your habits become associated not with a single trigger but with the entire context surrounding the behavior."},{"loc":"1129-1132","authors":["James Clear"],"date":"2020-06-03T19:04:40.000Z","content":"Our behavior is not defined by the objects in the environment but by our relationship to them. In fact, this is a useful way to think about the influence of the environment on your behavior. Stop thinking about your environment as filled with objects. Start thinking about it as filled with relationships. Think in terms of how you interact with the spaces around you."},{"loc":"1138-1141","authors":["James Clear"],"date":"2020-06-03T19:08:38.000Z","content":"The power of context also reveals an important strategy: habits can be easier to change in a new environment. It helps to escape the subtle triggers and cues that nudge you toward your current habits. Go to a new place—a different coffee shop, a bench in the park, a corner of your room you seldom use—and create a new routine there."},{"loc":"1141-1141","authors":["James Clear"],"date":"2020-06-03T19:10:34.000Z","content":"It is easier to associate a new habit with a new context than to build a new habit in the face of competing cues."},{"loc":"1148-1150","authors":["James Clear"],"date":"2020-06-03T19:12:41.000Z","content":"When you can’t manage to get to an entirely new environment, redefine or rearrange your current one. Create a separate space for work, study, exercise, entertainment, and cooking. The mantra I find useful is “One space, one use.”"},{"loc":"1156-1160","authors":["James Clear"],"date":"2020-06-03T19:15:04.000Z","content":"Whenever possible, avoid mixing the context of one habit with another. When you start mixing contexts, you’ll start mixing habits—and the easier ones will usually win out. This is one reason why the versatility of modern technology is both a strength and a weakness. You can use your phone for all sorts of tasks, which makes it a powerful device. But when you can use your phone to do nearly anything, it becomes hard to associate it with one task. You want to be productive, but you’re also conditioned to browse social media, check email, and play video games whenever you open your phone. It’s a mishmash of cues."},{"loc":"1162-1164","authors":["James Clear"],"date":"2020-06-03T19:16:33.000Z","content":"If your space is limited, divide your room into activity zones: a chair for reading, a desk for writing, a table for eating. You can do the same with your digital spaces. I know a writer who uses his computer only for writing, his tablet only for reading, and his phone only for social media and texting. Every habit should have a home."},{"loc":"1167-1167","authors":["James Clear"],"date":"2020-06-03T19:18:45.000Z","content":"If you want behaviors that are stable and predictable, you need an environment that is stable and predictable."},{"loc":"1200-1201","authors":["James Clear"],"date":"2020-06-03T21:35:03.000Z","content":"Instead, “disciplined” people are better at structuring their lives in a way that does not require heroic willpower and self-control. In other words, they spend less time in tempting situations."},{"loc":"1201-1204","authors":["James Clear"],"date":"2020-06-03T21:35:51.000Z","content":"The people with the best self-control are typically the ones who need to use it the least. It’s easier to practice self-restraint when you don’t have to use it very often. So, yes, perseverance, grit, and willpower are essential to success, but the way to improve these qualities is not by wishing you were a more disciplined person, but by creating a more disciplined environment. This"},{"loc":"1209-1213","authors":["James Clear"],"date":"2020-06-03T21:39:54.000Z","content":"Once a habit has been encoded, the urge to act follows whenever the environmental cues reappear. This is one reason behavior change techniques can backfire. Shaming obese people with weight-loss presentations can make them feel stressed, and as a result many people return to their favorite coping strategy: overeating. Showing pictures of blackened lungs to smokers leads to higher levels of anxiety, which drives many people to reach for a cigarette. If you’re not careful about cues, you can cause the very behavior you want to stop."},{"loc":"1217-1218","authors":["James Clear"],"date":"2020-06-03T21:40:45.000Z","content":"Researchers refer to this phenomenon as “cue-induced wanting”: an external trigger causes a compulsive craving to repeat a bad habit. Once you notice something, you begin to want it. This process is happening all the time—often without us realizing it."},{"loc":"1221-1226","authors":["James Clear"],"date":"2020-06-03T21:43:27.000Z","content":"Here’s the punch line: You can break a habit, but you’re unlikely to forget it. Once the mental grooves of habit have been carved into your brain, they are nearly impossible to remove entirely—even if they go unused for quite a while. And that means that simply resisting temptation is an ineffective strategy. It is hard to maintain a Zen attitude in a life filled with interruptions. It takes too much energy. In the short-run, you can choose to overpower temptation. In the long-run, we become a product of the environment that we live in. To put it bluntly, I have never seen someone consistently stick to positive habits in a negative environment. A more reliable approach is to cut bad habits off at the source. One of the most practical ways to eliminate a bad habit is to reduce exposure to the cue that causes it."},{"loc":"1231-1232","authors":["James Clear"],"date":"2020-06-03T21:44:01.000Z","content":"If you’re spending too much money on electronics, quit reading reviews of the latest tech gear."},{"loc":"1235-1239","authors":["James Clear"],"date":"2020-06-03T21:45:25.000Z","content":"Self-control is a short-term strategy, not a long-term one. You may be able to resist temptation once or twice, but it’s unlikely you can muster the willpower to override your desires every time. Instead of summoning a new dose of willpower whenever you want to do the right thing, your energy would be better spent optimizing your environment. This is the secret to self-control. Make the cues of your good habits obvious and the cues of your bad habits invisible."},{"loc":"1242-1243","authors":["James Clear"],"date":"2020-06-03T21:46:08.000Z","content":"People with high self-control tend to spend less time in tempting situations. It’s easier to avoid temptation than resist it."},{"loc":"1347-1348","authors":["James Clear"],"date":"2020-06-03T22:02:34.000Z","content":"When it comes to habits, the key takeaway is this: dopamine is released not only when you experience pleasure, but also when you anticipate it."},{"loc":"1350-1351","authors":["James Clear"],"date":"2020-06-03T22:02:58.000Z","content":"Whenever you predict that an opportunity will be rewarding, your levels of dopamine spike in anticipation. And whenever dopamine rises, so does your motivation to act."},{"loc":"1379-1380","authors":["James Clear"],"date":"2020-06-03T22:08:08.000Z","content":"Temptation bundling works by linking an action you want to do with an action you need to"},{"loc":"1392-1392","authors":["James Clear"],"date":"2020-06-03T22:10:11.000Z","content":"You’re more likely to find a behavior attractive if you get to do one of your favorite things at the same time."},{"loc":"1395-1398","authors":["James Clear"],"date":"2020-06-03T22:11:15.000Z","content":"Temptation bundling is one way to apply a psychology theory known as Premack’s Principle. Named after the work of professor David Premack, the principle states that “more probable behaviors will reinforce less probable behaviors.” In other words, even if you don’t really want to process overdue work emails, you’ll become conditioned to do it if it means you get to do something you really want to do along the way."},{"loc":"1475-1476","authors":["James Clear"],"date":"2020-06-04T18:42:03.000Z","content":"As a general rule, the closer we are to someone, the more likely we are to imitate some of their habits."},{"loc":"1483-1485","authors":["James Clear"],"date":"2020-06-04T18:43:25.000Z","content":"One of the most effective things you can do to build better habits is to join a culture where your desired behavior is the normal behavior. New habits seem achievable when you see others doing them every day."},{"loc":"1487-1489","authors":["James Clear"],"date":"2020-06-04T18:44:21.000Z","content":"To make your habits even more attractive, you can take this strategy one step further. Join a culture where (1) your desired behavior is the normal behavior and (2) you already have something in common with the group."},{"loc":"1519-1521","authors":["James Clear"],"date":"2020-06-04T18:53:19.000Z","content":"Whenever we are unsure how to act, we look to the group to guide our behavior. We are constantly scanning our environment and wondering, “What is everyone else doing?” We check reviews on Amazon or Yelp or TripAdvisor because we want to imitate the “best” buying, eating, and travel habits. It’s usually a smart strategy. There is evidence in numbers."},{"loc":"1525-1527","authors":["James Clear"],"date":"2020-06-04T18:53:53.000Z","content":"Humans are similar. There is tremendous internal pressure to comply with the norms of the group. The reward of being accepted is often greater than the reward of winning an argument, looking smart, or finding truth. Most days, we’d rather be wrong with the crowd than be right by ourselves."},{"loc":"1529-1530","authors":["James Clear"],"date":"2020-06-04T18:56:09.000Z","content":"When changing your habits means challenging the tribe, change is unattractive. When changing your habits means fitting in with the tribe, change is very attractive."},{"loc":"1536-1541","authors":["James Clear"],"date":"2020-06-04T19:01:20.000Z","content":"Once we fit in, we start looking for ways to stand out. This is one reason we care so much about the habits of highly effective people. We try to copy the behavior of successful people because we desire success ourselves. Many of our daily habits are imitations of people we admire. You replicate the marketing strategies of the most successful firms in your industry. You make a recipe from your favorite baker. You borrow the storytelling strategies of your favorite writer. You mimic the communication style of your boss. We imitate people we envy. High-status people enjoy the approval, respect, and praise of others. And that means if a behavior can get us approval, respect, and praise, we find it attractive."},{"loc":"1605-1607","authors":["James Clear"],"date":"2020-06-04T19:22:48.000Z","content":"Your current habits are not necessarily the best way to solve the problems you face; they are just the methods you learned to use. Once you associate a solution with the problem you need to solve, you keep coming back to it."},{"loc":"1616-1620","authors":["James Clear"],"date":"2020-06-04T19:27:01.000Z","content":"Our behavior is heavily dependent on these predictions. Put another way, our behavior is heavily dependent on how we interpret the events that happen to us, not necessarily the objective reality of the events themselves. Two people can look at the same cigarette, and one feels the urge to smoke while the other is repulsed by the smell. The same cue can spark a good habit or a bad habit depending on your prediction. The cause of your habits is actually the prediction that precedes them."},{"loc":"1625-1627","authors":["James Clear"],"date":"2020-06-04T19:28:48.000Z","content":"A craving is the sense that something is missing. It is the desire to change your internal state. When the temperature falls, there is a gap between what your body is currently sensing and what it wants to be sensing. This gap between your current state and your desired state provides a reason to act."},{"loc":"1640-1641","authors":["James Clear"],"date":"2020-06-04T19:42:15.000Z","content":"Now, imagine changing just one word: You don’t “have” to. You “get” to."},{"loc":"1644-1645","authors":["James Clear"],"date":"2020-06-04T19:42:31.000Z","content":"You have to do those things, and you also get to do them. We can find evidence for whatever mind-set we choose."},{"loc":"1648-1649","authors":["James Clear"],"date":"2020-06-04T19:43:08.000Z","content":"Reframing your habits to highlight their benefits rather than their drawbacks is a fast and lightweight way to reprogram your mind and make a habit seem more attractive."},{"loc":"1650-1651","authors":["James Clear"],"date":"2020-06-04T19:43:40.000Z","content":"Instead of telling yourself “I need to go run in the morning,” say “It’s time to build endurance and get fast.”"},{"loc":"1652-1653","authors":["James Clear"],"date":"2020-06-04T19:44:00.000Z","content":"…living below your current means increases your future means. The money you save this month increases your purchasing power next month."},{"loc":"1654-1656","authors":["James Clear"],"date":"2020-06-04T19:45:16.000Z","content":"Anyone who has tried meditation for more than three seconds knows how frustrating it can be when the next distraction inevitably pops into your mind. You can transform frustration into delight when you realize that each interruption gives you a chance to practice returning to your breath. Distraction is a good thing because you need distractions to practice meditation."},{"loc":"1661-1662","authors":["James Clear"],"date":"2020-06-04T19:46:47.000Z","content":"If you want to take it a step further, you can create a motivation ritual. You simply practice associating your habits with something you enjoy, then you can use that cue whenever you need a bit of motivation."},{"loc":"1677-1678","authors":["James Clear"],"date":"2020-06-04T19:51:20.000Z","content":"Once a habit has been built, the cue can prompt a craving, even if it has little to do with the original situation."},{"loc":"1727-1729","authors":["James Clear"],"date":"2020-06-07T19:08:50.000Z","content":"It is easy to get bogged down trying to find the optimal plan for change: the fastest way to lose weight, the best program to build muscle, the perfect idea for a side hustle. We are so focused on figuring out the best approach that we never get around to taking action. As Voltaire once wrote, “The best is the enemy of the good.”"},{"loc":"1732-1734","authors":["James Clear"],"date":"2020-06-07T19:10:08.000Z","content":"Action, on the other hand, is the type of behavior that will deliver an outcome. If I outline twenty ideas for articles I want to write, that’s motion. If I actually sit down and write an article, that’s action. If I search for a better diet plan and read a few books on the topic, that’s motion. If I actually eat a healthy meal, that’s action."},{"loc":"1740-1742","authors":["James Clear"],"date":"2020-06-07T19:14:06.000Z","content":"It’s easy to be in motion and convince yourself that you’re still making progress. You think, “I’ve got conversations going with four potential clients right now. This is good. We’re moving in the right direction.” Or, “I brainstormed some ideas for that book I want to write. This is coming together.”"},{"loc":"1742-1744","authors":["James Clear"],"date":"2020-06-07T19:14:29.000Z","content":"Motion makes you feel like you’re getting things done. But really, you’re just preparing to get something done. When preparation becomes a form of procrastination, you need to change something. You don’t want to merely be planning. You want to be practicing."},{"loc":"1744-1746","authors":["James Clear"],"date":"2020-06-07T19:16:26.000Z","content":"If you want to master a habit, the key is to start with repetition, not perfection. You don’t need to map out every feature of a new habit. You just need to practice it. This is the first takeaway of the 3rd Law: you just need to get your reps in."},{"loc":"1751-1751","authors":["James Clear"],"date":"2020-06-07T19:18:47.000Z","content":"Hebb’s Law: “Neurons that fire together wire together.”"},{"loc":"1776-1776","authors":["James Clear"],"date":"2020-06-07T19:21:57.000Z","content":"…habits form based on frequency, not time."},{"loc":"1821-1822","authors":["James Clear"],"date":"2020-06-07T19:28:41.000Z","content":"But the truth is, our real motivation is to be lazy and to do what is convenient. And despite what the latest productivity best seller will tell you, this is a smart strategy, not a dumb one."},{"loc":"1825-1826","authors":["James Clear"],"date":"2020-06-07T19:30:16.000Z","content":"Out of all the possible actions we could take, the one that is realized is the one that delivers the most value for the least effort. We are motivated to do what is easy."},{"loc":"1827-1830","authors":["James Clear"],"date":"2020-06-07T19:30:54.000Z","content":"If your goal is to do a hundred push-ups per day, that’s a lot of energy! In the beginning, when you’re motivated and excited, you can muster the strength to get started. But after a few days, such a massive effort feels exhausting. Meanwhile, sticking to the habit of doing one push-up per day requires almost no energy to get started. And the less energy a habit requires, the more likely it is to occur."},{"loc":"1839-1842","authors":["James Clear"],"date":"2020-06-07T19:34:02.000Z","content":"Certainly, you are capable of doing very hard things. The problem is that some days you feel like doing the hard work and some days you feel like giving in. On the tough days, it’s crucial to have as many things working in your favor as possible so that you can overcome the challenges life naturally throws your way. The less friction you face, the easier it is for your stronger self to emerge. The idea behind make it easy is not to only do easy things. The idea is to make it as easy as possible in the moment to"},{"loc":"1849-1850","authors":["James Clear"],"date":"2020-06-07T19:39:47.000Z","content":"One of the most effective ways to reduce the friction associated with your habits is to practice environment design. In Chapter 6, we discussed environment design as a method for making cues more obvious, but you can also optimize your environment to make actions easier."},{"loc":"1865-1867","authors":["James Clear"],"date":"2020-06-07T21:18:12.000Z","content":"…when we remove the points of friction that sap our time and energy, we can achieve more with less effort. (This is one reason tidying up can feel so good: we are simultaneously moving forward and lightening the cognitive load our environment places on us.)"},{"loc":"1880-1882","authors":["James Clear"],"date":"2020-06-07T21:30:01.000Z","content":"The central idea is to create an environment where doing the right thing is as easy as possible. Much of the battle of building better habits comes down to finding ways to reduce the friction associated with our good habits and increase the friction associated with our bad ones."},{"loc":"1903-1905","authors":["James Clear"],"date":"2020-06-07T21:37:07.000Z","content":"…prime the environment to make bad behaviors difficult. If you find yourself watching too much television, for example, then unplug it after each use. Only plug it back in if you can say out loud the name of the show you want to watch. This setup creates just enough friction to prevent mindless viewing."},{"loc":"1908-1911","authors":["James Clear"],"date":"2020-06-07T21:40:39.000Z","content":"Whenever possible, I leave my phone in a different room until lunch. When it’s right next to me, I’ll check it all morning for no reason at all. But when it is in another room, I rarely think about it. And the friction is high enough that I won’t go get it without a reason. As a result, I get three to four hours each morning when I can work without interruption."},{"loc":"1940-1941","authors":["James Clear"],"date":"2020-06-07T21:47:39.000Z","content":"Habits are automatic choices that influence the conscious decisions that follow. Yes, a habit can be completed in just a few seconds, but it can also shape the actions that you take for minutes or hours afterward."},{"loc":"1949-1952","authors":["James Clear"],"date":"2020-06-07T21:52:08.000Z","content":"Every day, there are a handful of moments that deliver an outsized impact. I refer to these little choices as decisive moments. The moment you decide between ordering takeout or cooking dinner. The moment you choose between driving your car or riding your bike. The moment you decide between starting your homework or grabbing the video game controller. These choices are a fork in the road."},{"loc":"1925-1925","authors":["James Clear"],"date":"2020-06-07T21:53:22.000Z","content":"When friction is high, habits are difficult."},{"loc":"1954-1956","authors":["James Clear"],"date":"2020-06-07T21:54:25.000Z","content":"The difference between a good day and a bad day is often a few productive and healthy choices made at decisive moments. Each one is like a fork in the road, and these choices stack up throughout the day and can ultimately lead to very different outcomes."},{"loc":"1963-1966","authors":["James Clear"],"date":"2020-06-07T22:00:25.000Z","content":"Even when you know you should start small, it’s easy to start too big. When you dream about making a change, excitement inevitably takes over and you end up trying to do too much too soon. The most effective way I know to counteract this tendency is to use the Two-Minute Rule, which states, “When you start a new habit, it should take less than two minutes to do.”"},{"loc":"1974-1975","authors":["James Clear"],"date":"2020-06-07T22:02:25.000Z","content":"A new habit should not feel like a challenge. The actions that follow can be challenging, but the first two minutes should be easy. What you want is a “gateway habit” that naturally leads you down a more productive path."},{"loc":"1997-2000","authors":["James Clear"],"date":"2020-06-07T22:05:14.000Z","content":"…the point is not to do one thing. The point is to master the habit of showing up. The truth is, a habit must be established before it can be improved. If you can’t learn the basic skill of showing up, then you have little hope of mastering the finer details. Instead of trying to engineer a perfect habit from the start, do the easy thing on a more consistent basis. You have to standardize before you can optimize."},{"loc":"2002-2006","authors":["James Clear"],"date":"2020-06-07T22:10:21.000Z","content":"The more you ritualize the beginning of a process, the more likely it becomes that you can slip into the state of deep focus that is required to do great things. By doing the same warm-up before every workout, you make it easier to get into a state of peak performance. By following the same creative ritual, you make it easier to get into the hard work of creating. By developing a consistent power-down habit, you make it easier to get to bed at a reasonable time each night. You may not be able to automate the whole process, but you can make the first action mindless. Make it easy to start and the rest will follow."},{"loc":"2019-2019","authors":["James Clear"],"date":"2020-06-07T22:13:13.000Z","content":"“The best way is to always stop when you are going good”"},{"loc":"2023-2025","authors":["James Clear"],"date":"2020-06-07T22:14:39.000Z","content":"We rarely think about change this way because everyone is consumed by the end goal. But one push-up is better than not exercising. One minute of guitar practice is better than none at all. One minute of reading is better than never picking up a book. It’s better to do less than you hoped than to do nothing at all."},{"loc":"2056-2057","authors":["James Clear"],"date":"2020-06-07T22:17:27.000Z","content":"Many habits occur at decisive moments—choices that are like a fork in the road—and either send you in the direction of a productive day or an unproductive one."},{"loc":"2060-2061","authors":["James Clear"],"date":"2020-06-07T22:17:55.000Z","content":"Standardize before you optimize. You can’t improve a habit that doesn’t exist."},{"loc":"2073-2074","authors":["James Clear"],"date":"2020-06-08T21:23:37.000Z","content":"A commitment device is a choice you make in the present that controls your actions in the future. It is a way to lock in future behavior, bind you to good habits, and restrict you from bad ones."},{"loc":"2081-2082","authors":["James Clear"],"date":"2020-06-08T21:27:41.000Z","content":"Commitment devices are useful because they enable you to take advantage of good intentions before you can fall victim to temptation."},{"loc":"2087-2088","authors":["James Clear"],"date":"2020-06-08T21:29:28.000Z","content":"Commitment devices increase the odds that you’ll do the right thing in the future by making bad habits difficult in the present."},{"loc":"2084-2085","authors":["James Clear"],"date":"2020-06-08T21:29:34.000Z","content":"The key is to change the task such that it requires more work to get out of the good habit than to get started on it."},{"loc":"2102-2103","authors":["James Clear"],"date":"2020-06-08T21:32:17.000Z","content":"The best way to break a bad habit is to make it impractical to do. Increase the friction until you don’t even have the option to act."},{"loc":"2150-2151","authors":["James Clear"],"date":"2020-06-08T21:38:48.000Z","content":"The downside of automation is that we can find ourselves jumping from easy task to easy task without making time for more difficult, but ultimately more rewarding, work."},{"loc":"2153-2155","authors":["James Clear"],"date":"2020-06-08T21:41:00.000Z","content":"The constant tug of “just one more minute” can prevent me from doing anything of consequence. (I’m not the only one. The average person spends over two hours per day on social media. What could you do with an extra six hundred hours per year?)"},{"loc":"2162-2165","authors":["James Clear"],"date":"2020-06-08T21:42:33.000Z","content":"When working in your favor, automation can make your good habits inevitable and your bad habits impossible. It is the ultimate way to lock in future behavior rather than relying on willpower in the moment. By utilizing commitment devices, strategic onetime decisions, and technology, you can create an environment of inevitability—a space where good habits are not just an outcome you hope for but an outcome that is virtually guaranteed."},{"loc":"2240-2240","authors":["James Clear"],"date":"2020-06-08T21:53:05.000Z","content":"We are more likely to repeat a behavior when the experience is satisfying."},{"loc":"2255-2255","authors":["James Clear"],"date":"2020-06-08T21:55:31.000Z","content":"Cardinal Rule of Behavior Change: What is rewarded is repeated. What is punished is avoided."},{"loc":"2277-2281","authors":["James Clear"],"date":"2020-06-08T21:58:49.000Z","content":"…after thousands of generations in an immediate-return environment, our brains evolved to prefer quick payoffs to long-term ones. Behavioral economists refer to this tendency as time inconsistency. That is, the way your brain evaluates rewards is inconsistent across time. You value the present more than the future. Usually, this tendency serves us well. A reward that is certain right now is typically worth more than one that is merely possible in the future. But occasionally, our bias toward instant gratification causes problems."},{"loc":"2286-2291","authors":["James Clear"],"date":"2020-06-09T19:11:29.000Z","content":"Every habit produces multiple outcomes across time. Unfortunately, these outcomes are often misaligned. With our bad habits, the immediate outcome usually feels good, but the ultimate outcome feels bad. With good habits, it is the reverse: the immediate outcome is unenjoyable, but the ultimate outcome feels good. The French economist Frédéric Bastiat explained the problem clearly when he wrote, “It almost always happens that when the immediate consequence is favorable, the later consequences are disastrous, and vice versa.... Often, the sweeter the first fruit of a habit, the more bitter are its later fruits.”"},{"loc":"2296-2297","authors":["James Clear"],"date":"2020-06-09T19:14:18.000Z","content":"As a general rule, the more immediate pleasure you get from an action, the more strongly you should question whether it aligns with your long-term goals."},{"loc":"2312-2313","authors":["James Clear"],"date":"2020-06-09T19:18:51.000Z","content":"The vital thing in getting a habit to stick is to feel successful—even if it’s in a small way. The feeling of success is a signal that your habit paid off and that the work was worth the effort."},{"loc":"2319-2320","authors":["James Clear"],"date":"2020-06-09T19:21:26.000Z","content":"The ending of any experience is vital because we tend to remember it more than other phases. You want the ending of your habit to be satisfying. The best approach is to use reinforcement, which refers to the process of using an immediate reward to increase the rate of a behavior."},{"loc":"2322-2329","authors":["James Clear"],"date":"2020-06-09T19:24:34.000Z","content":"Immediate reinforcement can be especially helpful when dealing with habits of avoidance, which are behaviors you want to stop doing. It can be challenging to stick with habits like “no frivolous purchases” or “no alcohol this month” because nothing happens when you skip happy hour drinks or don’t buy that pair of shoes. It can be hard to feel satisfied when there is no action in the first place. All you’re doing is resisting temptation, and there isn’t much satisfying about that. One solution is to turn the situation on its head. You want to make avoidance visible. Open a savings account and label it for something you want—maybe “Leather Jacket.” Whenever you pass on a purchase, put the same amount of money in the account. Skip your morning latte? Transfer $5. Pass on another month of Netflix? Move $10 over. It’s like creating a loyalty program for yourself. The immediate reward of seeing yourself save money toward the leather jacket feels a lot better than being deprived. You are making it satisfying to do nothing."},{"loc":"2332-2334","authors":["James Clear"],"date":"2020-06-09T19:26:41.000Z","content":"It is worth noting that it is important to select short-term rewards that reinforce your identity rather than ones that conflict with it. Buying a new jacket is fine if you’re trying to lose weight or read more books, but it doesn’t work if you’re trying to budget and save money."},{"loc":"2349-2350","authors":["James Clear"],"date":"2020-06-09T19:29:23.000Z","content":"The Cardinal Rule of Behavior Change: What is immediately rewarded is repeated. What is immediately punished is avoided."},{"loc":"2352-2354","authors":["James Clear"],"date":"2020-06-09T19:29:39.000Z","content":"The first three laws of behavior change—make it obvious, make it attractive, and make it easy—increase the odds that a behavior will be performed this time. The fourth law of behavior change—make it satisfying—increases the odds that a behavior will be repeated next time."},{"loc":"2389-2392","authors":["James Clear"],"date":"2020-06-10T19:20:18.000Z","content":"Most of us have a distorted view of our own behavior. We think we act better than we do. Measurement offers one way to overcome our blindness to our own behavior and notice what’s really going on each day. One glance at the paper clips in the container and you immediately know how much work you have (or haven’t) been putting in. When the evidence is right in front of you, you’re less likely to lie to yourself."},{"loc":"2395-2397","authors":["James Clear"],"date":"2020-06-10T19:28:14.000Z","content":"When you’re feeling down, it’s easy to forget about all the progress you have already made. Habit tracking provides visual proof of your hard work—a subtle reminder of how far you’ve come. Plus, the empty square you see each morning can motivate you to get started because you don’t want to lose your progress by breaking the streak."},{"loc":"2413-2414","authors":["James Clear"],"date":"2020-06-10T19:35:04.000Z","content":"Tracking isn’t for everyone, and there is no need to measure your entire life. But nearly anyone can benefit from it in some form—even if it’s only temporary."},{"loc":"2418-2419","authors":["James Clear"],"date":"2020-06-10T19:37:50.000Z","content":"…manual tracking should be limited to your most important habits. It is better to consistently track one habit than to sporadically track ten."},{"loc":"2415-2415","authors":["James Clear"],"date":"2020-06-10T19:37:56.000Z","content":"…whenever possible, measurement should be automated."},{"loc":"2431-2433","authors":["James Clear"],"date":"2020-06-10T21:54:23.000Z","content":"No matter how consistent you are with your habits, it is inevitable that life will interrupt you at some point. Perfection is not possible. Before long, an emergency will pop up—you get sick or you have to travel for work or your family needs a little more of your time. Whenever this happens to me, I try to remind myself of a simple rule: never miss twice."},{"loc":"2436-2439","authors":["James Clear"],"date":"2020-06-10T21:55:47.000Z","content":"The first mistake is never the one that ruins you. It is the spiral of repeated mistakes that follows. Missing once is an accident. Missing twice is the start of a new habit. This is a distinguishing feature between winners and losers. Anyone can have a bad performance, a bad workout, or a bad day at work. But when successful people fail, they rebound quickly. The breaking of a habit doesn’t matter if the reclaiming of it is fast."},{"loc":"2442-2445","authors":["James Clear"],"date":"2020-06-10T22:09:17.000Z","content":"You don’t realize how valuable it is to just show up on your bad (or busy) days. Lost days hurt you more than successful days help you. If you start with $100, then a 50 percent gain will take you to $150. But you only need a 33 percent loss to take you back to $100. In other words, avoiding a 33 percent loss is just as valuable as achieving a 50 percent gain. As Charlie Munger says, “The first rule of compounding: Never interrupt it unnecessarily.”"},{"loc":"2445-2447","authors":["James Clear"],"date":"2020-06-10T22:09:44.000Z","content":"Sluggish days and bad workouts maintain the compound gains you accrued from previous good days. Simply doing something—ten squats, five sprints, a push-up, anything really—is huge. Don’t put up a zero. Don’t let losses eat into your compounding."},{"loc":"2448-2450","authors":["James Clear"],"date":"2020-06-10T22:10:51.000Z","content":"It’s easy to train when you feel good, but it’s crucial to show up when you don’t feel like it—even if you do less than you hope. Going to the gym for five minutes may not improve your performance, but it reaffirms your identity."},{"loc":"2462-2464","authors":["James Clear"],"date":"2020-06-10T22:14:40.000Z","content":"We focus on working long hours instead of getting meaningful work done. We care more about getting ten thousand steps than we do about being healthy. We teach for standardized tests instead of emphasizing learning, curiosity, and critical thinking. In short, we optimize for what we measure. When we choose the wrong measurement, we get the wrong behavior."},{"loc":"2465-2467","authors":["James Clear"],"date":"2020-06-10T22:16:38.000Z","content":"Named after the economist Charles Goodhart, the principle states, “When a measure becomes a target, it ceases to be a good measure.” Measurement is only useful when it guides you and adds context to a larger picture, not when it consumes you. Each number is simply one piece of feedback in the overall system."},{"loc":"2469-2470","authors":["James Clear"],"date":"2020-06-10T22:18:56.000Z","content":"…just because you can measure something doesn’t mean it’s the most important thing. And just because you can’t measure something doesn’t mean it’s not important at all."},{"loc":"2475-2476","authors":["James Clear"],"date":"2020-06-10T22:20:05.000Z","content":"If you’re not feeling motivated by the number on the scale, perhaps it’s time to focus on a different measurement—one that gives you more signals of progress."},{"loc":"2503-2504","authors":["James Clear"],"date":"2020-06-10T22:23:15.000Z","content":"Pain is an effective teacher. If a failure is painful, it gets fixed. If a failure is relatively painless, it gets ignored. The more immediate and more costly a mistake is, the faster you will learn from it."},{"loc":"2507-2508","authors":["James Clear"],"date":"2020-06-10T22:23:50.000Z","content":"The more immediate the pain, the less likely the behavior. If you want to prevent bad habits and eliminate unhealthy behaviors, then adding an instant cost to the action is a great way to reduce their odds."},{"loc":"2513-2516","authors":["James Clear"],"date":"2020-06-10T22:25:56.000Z","content":"If you’re going to rely on punishment to change behavior, then the strength of the punishment must match the relative strength of the behavior it is trying to correct. To be productive, the cost of procrastination must be greater than the cost of action. To be healthy, the cost of laziness must be greater than the cost of exercise. Getting fined for smoking in a restaurant or failing to recycle adds consequence to an action. Behavior only shifts if the punishment is painful enough and reliably enforced."},{"loc":"2516-2518","authors":["James Clear"],"date":"2020-06-10T22:26:47.000Z","content":"In general, the more local, tangible, concrete, and immediate the consequence, the more likely it is to influence individual behavior. The more global, intangible, vague, and delayed the consequence, the less likely it is to influence individual behavior."},{"loc":"2529-2531","authors":["James Clear"],"date":"2020-06-10T22:28:32.000Z","content":"A habit contract is a verbal or written agreement in which you state your commitment to a particular habit and the punishment that will occur if you don’t follow through. Then you find one or two people to act as your accountability partners and sign off on the contract with you."},{"loc":"2633-2635","authors":["James Clear"],"date":"2020-06-11T18:59:01.000Z","content":"The secret to maximizing your odds of success is to choose the right field of competition. This is just as true with habit change as it is with sports and business. Habits are easier to perform, and more satisfying to stick with, when they align with your natural inclinations and abilities."},{"loc":"2642-2643","authors":["James Clear"],"date":"2020-06-11T19:01:07.000Z","content":"Our environment determines the suitability of our genes and the utility of our natural talents. When our environment changes, so do the qualities that determine success."},{"loc":"2647-2648","authors":["James Clear"],"date":"2020-06-11T19:06:21.000Z","content":"…genes do not determine your destiny. They determine your areas of opportunity. As physician Gabor Mate notes, “Genes can predispose, but they don’t predetermine.”"},{"loc":"2685-2686","authors":["James Clear"],"date":"2020-06-11T19:13:28.000Z","content":"You don’t have to build the habits everyone tells you to build. Choose the habit that best suits you, not the one that is most popular."},{"loc":"2690-2691","authors":["James Clear"],"date":"2020-06-11T19:15:00.000Z","content":"In theory, you can enjoy almost anything. In practice, you are more likely to enjoy the things that come easily to you."},{"loc":"2697-2698","authors":["James Clear"],"date":"2020-06-11T19:20:07.000Z","content":"In the long-run, if you continue to advance and improve, any area can become challenging."},{"loc":"2710-2712","authors":["James Clear"],"date":"2020-06-11T19:21:13.000Z","content":"If you have a lot of time—like someone at the beginning of their career—it makes more sense to explore because once you find the right thing, you still have a good amount of time to exploit it. If you’re pressed for time—say, as you come up on the deadline for a project—you should implement the best solution you’ve found so far and get some results."},{"loc":"2714-2714","authors":["James Clear"],"date":"2020-06-11T19:23:42.000Z","content":"What feels like fun to me, but work to others?"},{"loc":"2714-2717","authors":["James Clear"],"date":"2020-06-11T19:23:47.000Z","content":"The mark of whether you are made for a task is not whether you love it but whether you can handle the pain of the task easier than most people. When are you enjoying yourself while other people are complaining? The work that hurts you less than it hurts others is the work you were made to do. What makes me lose track of time?"},{"loc":"2719-2720","authors":["James Clear"],"date":"2020-06-11T19:23:53.000Z","content":"Where do I get greater returns than the average person?"},{"loc":"2723-2723","authors":["James Clear"],"date":"2020-06-11T19:23:59.000Z","content":"What comes naturally to me?"},{"loc":"2730-2730","authors":["James Clear"],"date":"2020-06-11T19:25:13.000Z","content":"If you can’t find a game where the odds are stacked in your favor, create one."},{"loc":"2734-2737","authors":["James Clear"],"date":"2020-06-11T19:26:01.000Z","content":"When you can’t win by being better, you can win by being different. By combining your skills, you reduce the level of competition, which makes it easier to stand out. You can shortcut the need for a genetic advantage (or for years of practice) by rewriting the rules. A good player works hard to win the game everyone else is playing. A great player creates a new game that favors their strengths and avoids their weaknesses."},{"loc":"2741-2742","authors":["James Clear"],"date":"2020-06-11T19:27:57.000Z","content":"Specialization is a powerful way to overcome the “accident” of bad genetics. The more you master a specific skill, the harder it becomes for others to compete with you."},{"loc":"2745-2747","authors":["James Clear"],"date":"2020-06-11T19:28:38.000Z","content":"Boiling water will soften a potato but harden an egg. You can’t control whether you’re a potato or an egg, but you can decide to play a game where it’s better to be hard or soft. If you can find a more favorable environment, you can transform the situation from one where the odds are against you to one where they are in your favor."},{"loc":"2751-2753","authors":["James Clear"],"date":"2020-06-11T19:29:36.000Z","content":"The fact that you have a natural limit to any specific ability has nothing to do with whether you are reaching the ceiling of your capabilities. People get so caught up in the fact that they have limits that they rarely exert the effort required to get close to them."},{"loc":"2755-2756","authors":["James Clear"],"date":"2020-06-11T19:30:32.000Z","content":"Until you work as hard as those you admire, don’t explain away their success as luck."},{"loc":"2790-2791","authors":["James Clear"],"date":"2020-06-11T19:35:15.000Z","content":"…the way to maintain motivation and achieve peak levels of desire is to work on tasks of “just manageable difficulty.”"},{"loc":"2791-2792","authors":["James Clear"],"date":"2020-06-11T19:36:23.000Z","content":"The human brain loves a challenge, but only if it is within an optimal zone of difficulty."},{"loc":"2797-2798","authors":["James Clear"],"date":"2020-06-11T19:36:55.000Z","content":"The Goldilocks Rule states that humans experience peak motivation when working on tasks that are right on the edge of their current abilities. Not too hard. Not too easy. Just right."},{"loc":"2804-2805","authors":["James Clear"],"date":"2020-06-11T19:43:33.000Z","content":"When you’re starting a new habit, it’s important to keep the behavior as easy as possible so you can stick with it even when conditions aren’t perfect."},{"loc":"2806-2808","authors":["James Clear"],"date":"2020-06-11T19:44:06.000Z","content":"Once a habit has been established, however, it’s important to continue to advance in small ways. These little improvements and new challenges keep you engaged. And if you hit the Goldilocks Zone just right, you can achieve a flow state."},{"loc":"2812-2815","authors":["James Clear"],"date":"2020-06-11T19:47:48.000Z","content":"Improvement requires a delicate balance. You need to regularly search for challenges that push you to your edge while continuing to make enough progress to stay motivated. Behaviors need to remain novel in order for them to stay attractive and satisfying. Without variety, we get bored. And boredom is perhaps the greatest villain on the quest for self-improvement."},{"loc":"2825-2829","authors":["James Clear"],"date":"2020-06-11T19:50:19.000Z","content":"Mastery requires practice. But the more you practice something, the more boring and routine it becomes. Once the beginner gains have been made and we learn what to expect, our interest starts to fade. Sometimes it happens even faster than that. All you have to do is hit the gym a few days in a row or publish a couple of blog posts on time and letting one day slip doesn’t feel like much. Things are going well. It’s easy to rationalize taking a day off because you’re in a good place."},{"loc":"2832-2833","authors":["James Clear"],"date":"2020-06-11T19:53:03.000Z","content":"Machiavelli noted, “Men desire novelty to such an extent that those who are doing well wish for a change as much as those who are doing badly.”"},{"loc":"2841-2844","authors":["James Clear"],"date":"2020-06-11T19:54:55.000Z","content":"The sweet spot of desire occurs at a 50/50 split between success and failure. Half of the time you get what you want. Half of the time you don’t. You need just enough “winning” to experience satisfaction and just enough “wanting” to experience desire. This is one of the benefits of following the Goldilocks Rule. If you’re already interested in a habit, working on challenges of just manageable difficulty is a good way to keep things interesting."},{"loc":"2847-2848","authors":["James Clear"],"date":"2020-06-11T19:58:30.000Z","content":"Variable rewards or not, no habit will stay interesting forever. At some point, everyone faces the same challenge on the journey of self-improvement: you have to fall in love with boredom."},{"loc":"2848-2850","authors":["James Clear"],"date":"2020-06-11T19:58:36.000Z","content":"We all have goals that we would like to achieve and dreams that we would like to fulfill, but it doesn’t matter what you are trying to become better at, if you only do the work when it’s convenient or exciting, then you’ll never be consistent enough to achieve remarkable results."},{"loc":"2853-2854","authors":["James Clear"],"date":"2020-06-11T19:59:56.000Z","content":"…stepping up when it’s annoying or painful or draining to do so, that’s what makes the difference between a professional and an amateur."},{"loc":"2854-2855","authors":["James Clear"],"date":"2020-06-11T20:00:39.000Z","content":"Professionals stick to the schedule; amateurs let life get in the way. Professionals know what is important to them and work toward it with purpose; amateurs get pulled off course by the urgencies of life."},{"loc":"2857-2859","authors":["James Clear"],"date":"2020-06-11T20:01:59.000Z","content":"…you don’t want to be a fair-weather athlete or a fair-weather writer or a fair-weather anything. When a habit is truly important to you, you have to be willing to stick to it in any mood. Professionals take action even when the mood isn’t right. They might not enjoy it, but they find a way to put the reps in."},{"loc":"2862-2863","authors":["James Clear"],"date":"2020-06-11T20:02:53.000Z","content":"The only way to become excellent is to be endlessly fascinated by doing the same thing over and over. You have to fall in love with boredom."},{"loc":"2868-2868","authors":["James Clear"],"date":"2020-06-11T20:04:02.000Z","content":"Anyone can work hard when they feel motivated. It’s the ability to keep going when work isn’t exciting that makes the difference."},{"loc":"2879-2882","authors":["James Clear"],"date":"2020-06-11T21:52:34.000Z","content":"The upside of habits is that we can do things without thinking. The downside of habits is that you get used to doing things a certain way and stop paying attention to little errors. You assume you’re getting better because you’re gaining experience. In reality, you are merely reinforcing your current habits—not improving them. In fact, some research has shown that once a skill has been mastered there is usually a slight decline in performance over time."},{"loc":"2886-2888","authors":["James Clear"],"date":"2020-06-11T21:53:27.000Z","content":"Habits are necessary, but not sufficient for mastery. What you need is a combination of automatic habits and deliberate practice. Habits + Deliberate Practice = Mastery"},{"loc":"2900-2902","authors":["James Clear"],"date":"2020-06-11T21:56:37.000Z","content":"Although habits are powerful, what you need is a way to remain conscious of your performance over time, so you can continue to refine and improve. It is precisely at the moment when you begin to feel like you have mastered a skill—right when things are starting to feel automatic and you are becoming comfortable—that you must avoid slipping into the trap of complacency."},{"loc":"2934-2936","authors":["James Clear"],"date":"2020-06-11T22:03:18.000Z","content":"“Sustaining an effort is the most important thing for any enterprise. The way to be successful is to learn how to do things right, then do them the same way every time.”"},{"loc":"2937-2940","authors":["James Clear"],"date":"2020-06-11T22:06:20.000Z","content":"Reflection and review enables the long-term improvement of all habits because it makes you aware of your mistakes and helps you consider possible paths for improvement. Without reflection, we can make excuses, create rationalizations, and lie to ourselves. We have no process for determining whether we are performing better or worse compared to yesterday."},{"loc":"2968-2974","authors":["James Clear"],"date":"2020-06-11T22:12:57.000Z","content":"Reflection can also bring a sense of perspective. Daily habits are powerful because of how they compound, but worrying too much about every daily choice is like looking at yourself in the mirror from an inch away. You can see every imperfection and lose sight of the bigger picture. There is too much feedback. Conversely, never reviewing your habits is like never looking in the mirror. You aren’t aware of easily fixable flaws—a spot on your shirt, a bit of food in your teeth. There is too little feedback. Periodic reflection and review is like viewing yourself in the mirror from a conversational distance. You can see the important changes you should make without losing sight of the bigger picture. You want to view the entire mountain range, not obsess over each peak and valley."},{"loc":"2979-2980","authors":["James Clear"],"date":"2020-06-11T22:14:36.000Z","content":"The more sacred an idea is to us—that is, the more deeply it is tied to our identity—the more strongly we will defend it against criticism. You"},{"loc":"2983-2985","authors":["James Clear"],"date":"2020-06-11T22:16:10.000Z","content":"…avoid making any single aspect of your identity an overwhelming portion of who you are. In the words of investor Paul Graham, “keep your identity small.” The more you let a single belief define you, the less capable you are of adapting when life challenges you."},{"loc":"2988-2989","authors":["James Clear"],"date":"2020-06-11T22:17:09.000Z","content":"When you spend your whole life defining yourself in one way and that disappears, who are you now?"},{"loc":"2989","authors":["James Clear"],"date":"2020-06-11T22:17:55.000Z","content":"A thought to ponder seriously"},{"loc":"3007-3009","authors":["James Clear"],"date":"2020-06-11T22:20:16.000Z","content":"Habits deliver numerous benefits, but the downside is that they can lock us into our previous patterns of thinking and acting—even when the world is shifting around us. Everything is impermanent. Life is constantly changing, so you need to periodically check in to see if your old habits and beliefs are still serving you."},{"loc":"3009-3009","authors":["James Clear"],"date":"2020-06-11T22:20:47.000Z","content":"A lack of self-awareness is poison. Reflection and review is the antidote."},{"loc":"3075-3077","authors":["James Clear"],"date":"2020-06-11T22:25:46.000Z","content":"Awareness comes before desire. A craving is created when you assign meaning to a cue. Your brain constructs an emotion or feeling to describe your current situation, and that means a craving can only occur after you have noticed an opportunity."},{"loc":"3090-3093","authors":["James Clear"],"date":"2020-06-11T22:29:03.000Z","content":"With a big enough why you can overcome any how. Friedrich Nietzsche, the German philosopher and poet, famously wrote, “He who has a why to live for can bear almost any how.” This phrase harbors an important truth about human behavior. If your motivation and desire are great enough (that is, why are you are acting), you’ll take action even when it is quite difficult. Great craving can power great action—even when friction is high."},{"loc":"3093-3096","authors":["James Clear"],"date":"2020-06-11T22:30:08.000Z","content":"Being curious is better than being smart. Being motivated and curious counts for more than being smart because it leads to action. Being smart will never deliver results on its own because it doesn’t get you to act. It is desire, not intelligence, that prompts behavior. As Naval Ravikant says, “The trick to doing anything is first cultivating a desire for it.”"},{"loc":"3110-3112","authors":["James Clear"],"date":"2020-06-11T22:33:10.000Z","content":"Suffering drives progress. The source of all suffering is the desire for a change in state. This is also the source of all progress. The desire to change your state is what powers you to take action."},{"loc":"3113-3115","authors":["James Clear"],"date":"2020-06-11T22:33:52.000Z","content":"Your actions reveal how badly you want something. If you keep saying something is a priority but you never act on it, then you don’t really want it. It’s time to have an honest conversation with yourself. Your actions reveal your true motivations."},{"loc":"3115-3116","authors":["James Clear"],"date":"2020-06-11T22:34:09.000Z","content":"Reward is on the other side of sacrifice. Response (sacrifice of energy) always precedes reward (the collection of resources)."},{"loc":"3117-3120","authors":["James Clear"],"date":"2020-06-11T22:34:46.000Z","content":"Self-control is difficult because it is not satisfying. A reward is an outcome that satisfies your craving. This makes self-control ineffective because inhibiting our desires does not usually resolve them. Resisting temptation does not satisfy your craving; it just ignores it. It creates space for the craving to pass. Self-control requires you to release a desire rather than satisfy it."},{"loc":"3124-3128","authors":["James Clear"],"date":"2020-06-11T22:36:14.000Z","content":"An average experience preceded by low expectations is a delight. When liking and wanting are approximately the same, you feel satisfied. Satisfaction = Liking – Wanting. This is the wisdom behind Seneca’s famous quote, “Being poor is not having too little, it is wanting more.” If your wants outpace your likes, you’ll always be unsatisfied. You’re perpetually putting more weight on the problem than the solution."},{"loc":"3134-3135","authors":["James Clear"],"date":"2020-06-11T22:37:28.000Z","content":"Failing to attain something you want hurts more than failing to attain something you didn’t think much about in the first place. This is why people say, “I don’t want to get my hopes up.”"},{"loc":"3145-3148","authors":["James Clear"],"date":"2020-06-11T22:40:51.000Z","content":"New plans offer hope because we don’t have any experiences to ground our expectations. New strategies seem more appealing than old ones because they can have unbounded hope. As Aristotle noted, “Youth is easily deceived because it is quick to hope.” Perhaps this can be revised to “Youth is easily deceived because it only hopes.” There is no experience to root the expectation in. In the beginning, hope is all you have."},{"loc":"3141-3144","authors":["James Clear"],"date":"2020-06-11T22:41:12.000Z","content":"Hope declines with experience and is replaced by acceptance. The first time an opportunity arises, there is hope of what could be. Your expectation (cravings) is based solely on promise. The second time around, your expectation is grounded in reality. You begin to understand how the process works and your hope is gradually traded for a more accurate prediction and acceptance of the likely outcome."}]