[{"loc":"349-350","authors":["Simon Singh"],"date":"2019-05-01T22:45:33.000Z","content":"…mathematicians are still unable to prove that no slightly excessive numbers exist."},{"loc":"936-936","authors":["Simon Singh"],"date":"2019-05-02T16:35:23.000Z","content":"Friendly numbers are pairs of numbers such that each number is the sum of the divisors of the other number."},{"loc":"1037-1038","authors":["Simon Singh"],"date":"2019-05-02T16:59:38.000Z","content":"Unsubstantiated ideas are infinitely less valuable and are referred to as conjectures. Any logic which relies on a conjecture is itself a conjecture."},{"loc":"1847-1848","authors":["Simon Singh"],"date":"2019-05-02T22:33:43.000Z","content":"In mathematics a property which always holds true no matter what is done to the object is called an invariant."},{"loc":"1950-1951","authors":["Simon Singh"],"date":"2019-05-02T22:50:05.000Z","content":"‘Logic is the hygiene the mathematician practises to keep his ideas healthy and strong.’"},{"loc":"1995-2001","authors":["Simon Singh"],"date":"2019-05-02T22:57:06.000Z","content":"Russell’s paradox is often explained using the tale of the meticulous librarian. One day, while wandering between the shelves, the librarian discovers a collection of catalogues. There are separate catalogues for novels, reference, poetry, and so on. The librarian notices that some of the catalogues list themselves, while others do not. In order to simplify the system the librarian makes two more catalogues, one of which lists all the catalogues which do list themselves and, more interestingly, one which lists all the catalogues which do not list themselves. Upon completing the task the librarian has a problem: should the catalogue which lists all the catalogues which do not list themselves, be listed in itself? If it is listed, then by definition it should not be listed. However, if it is not listed, then by definition it should be listed. The librarian is in a no-win situation."},{"loc":"2085-2086","authors":["Simon Singh"],"date":"2019-05-02T23:09:59.000Z","content":"…there existed statements in mathematics which are true but which could never be proven to be true, so-called undecidable statements. This was the death-blow for the Hilbert programme."}]