[{"loc":"209-210","authors":["Manoj Arora"],"date":"2018-12-16T23:30:17.000Z","content":"The fact that money does not buy happiness is a very true statement, but money does enable you to create more happiness in life if you know how to make good use of it."},{"loc":"211-212","authors":["Manoj Arora"],"date":"2018-12-16T23:30:32.000Z","content":"“It’s not the knife which kills; it’s the intention of the person holding the knife that kills.”"},{"loc":"214-214","authors":["Manoj Arora"],"date":"2018-12-16T23:30:53.000Z","content":"…money can do wonders if you know how to take care of your money and if you have the right intent."},{"loc":"227-228","authors":["Manoj Arora"],"date":"2018-12-16T23:33:36.000Z","content":"As time passed by and I kept rising in my career, I knew that something else was growing with the same momentum, if not quicker, and that was the fear of falling down. Just like a pack of cards."},{"loc":"270-272","authors":["Manoj Arora"],"date":"2018-12-16T23:39:23.000Z","content":"Never give up on your true dreams in life, thinking they are difficult; or that no one has ever succeeded in them earlier; or how will you achieve them; or what will people say if you fail, or how they will react if you actually do live your dream. They will all watch you in awe, appreciate you and ultimately take inspiration from you."},{"loc":"274-276","authors":["Manoj Arora"],"date":"2018-12-16T23:40:16.000Z","content":"Dream… Dream… and Dream… Dream creates thoughts, Thoughts create your actions And actions create your destiny! - Dr. Abdul Kalam"},{"loc":"348-349","authors":["Manoj Arora"],"date":"2018-12-16T23:49:54.000Z","content":"You are well paid and have a good lifestyle. But can you afford to stop working? If your answer is ‘No’, then you are barely financially stable and far from being financially independent or financially free."},{"loc":"371-373","authors":["Manoj Arora"],"date":"2018-12-16T23:53:05.000Z","content":"Money should not decide what you should be doing in life. You should master money and be able to script your own story of life. Believe me it is possible."},{"loc":"388-389","authors":["Manoj Arora"],"date":"2018-12-16T23:55:07.000Z","content":"There are two kinds of money problems in this world… one-you have a lot of money and the other — you have no money. You choose which problem you want!!"},{"loc":"390-391","authors":["Manoj Arora"],"date":"2018-12-16T23:55:16.000Z","content":"Wealth is the slave of a wise man and the master of a fool!!"},{"loc":"403-403","authors":["Manoj Arora"],"date":"2018-12-16T23:58:11.000Z","content":"…it is not the inherited money that counts; it is the effort and discipline that you put in during your lifetime that makes you rich."},{"loc":"407-408","authors":["Manoj Arora"],"date":"2018-12-16T23:58:40.000Z","content":"…financial independence is more important than displaying high social status"},{"loc":"410-411","authors":["Manoj Arora"],"date":"2018-12-16T23:58:57.000Z","content":"They did not fail “because of…” but succeeded “in spite of…“."},{"loc":"437-438","authors":["Manoj Arora"],"date":"2018-12-17T12:01:58.000Z","content":"“Money is not the root of evils”. It is the “love for money” that is the root of all evils."},{"loc":"452-453","authors":["Manoj Arora"],"date":"2018-12-17T12:04:32.000Z","content":"You need money to use it the way that it is intended to be used."},{"loc":"465-466","authors":["Manoj Arora"],"date":"2018-12-17T12:06:20.000Z","content":"Inflation is when you pay 15$ for the 10$ haircut you used to get for 5$ when you had hair."},{"loc":"488-489","authors":["Manoj Arora"],"date":"2018-12-17T12:09:21.000Z","content":"If you do not invest and fortify your portfolio against inflation, you will surely outlive your money."},{"loc":"498-500","authors":["Manoj Arora"],"date":"2018-12-17T12:10:13.000Z","content":"Learn the basics of investing Execute these basics Stick to the basics, continue sticking – for weeks, months, years and even decades, if needed."},{"loc":"503-504","authors":["Manoj Arora"],"date":"2018-12-17T12:11:41.000Z","content":"Investing is a life long commitment. It is not a game. It is about the things that matter most to you. I had to learn it from scratch for the sake of my freedom."},{"loc":"507-508","authors":["Manoj Arora"],"date":"2018-12-17T21:52:33.000Z","content":"The rich invest their money and spend what is left; the poor spend their money and invest what is left."},{"loc":"576-577","authors":["Manoj Arora"],"date":"2018-12-17T22:19:16.000Z","content":"When there is a trust deficit on the bank, you will see people going back to “actual commodities” like gold and silver rather than these currency notes and other form of receipts."},{"loc":"586-589","authors":["Manoj Arora"],"date":"2018-12-17T22:21:08.000Z","content":"…in any country, the central bank could issue more and more currency notes and start earning from the interest received from those currency notes even if there was no backing for those receipts or currency notes by equivalent commodities. Therefore, the biggest change here was that while the commodities were limited, there was virtually no limit to the number and amount of receipts that could be issued."},{"loc":"590-593","authors":["Manoj Arora"],"date":"2018-12-17T22:21:46.000Z","content":"Inflation arose with the increase in costs. Inflation started going up for the first time as notes were being printed without any commodity backup. For 1000/- worth of commodities with the bank, the bank started issuing receipts (and hence started earning interest) for say, 2000/- (a fractional reserve of 2:1)."},{"loc":"601-602","authors":["Manoj Arora"],"date":"2018-12-17T22:23:24.000Z","content":"Fiat money is money which is not backed even by a fractional commodity. It is just issued on the government’s faith and trust backing. It is more authoritative rather than being logical."},{"loc":"614-615","authors":["Manoj Arora"],"date":"2018-12-17T22:25:10.000Z","content":"One of the most critical aspects to be measured on the investments you make is the Return On Investments (ROI)."},{"loc":"620-620","authors":["Manoj Arora"],"date":"2018-12-17T22:26:07.000Z","content":"…absolute returns are “absolute” by definition. This means that these returns are calculated without taking any time period into account."},{"loc":"633-634","authors":["Manoj Arora"],"date":"2018-12-17T22:27:51.000Z","content":"The time period for returns is a very important factor because the money that may have eroded because of inflation depends on the time period."},{"loc":"653-654","authors":["Manoj Arora"],"date":"2018-12-17T22:30:01.000Z","content":"…the formula for Simple Annual ROI works only if you have invested once at the beginning of a multi-year tenure and get the returns also once at the end of the tenure."},{"loc":"659-660","authors":["Manoj Arora"],"date":"2018-12-17T22:31:00.000Z","content":"This method of calculation where the interest earned is re-invested for the future tenure and contributes to the overall returns is called as Compounded Annual Growth Rate (CAGR)."},{"loc":"670-671","authors":["Manoj Arora"],"date":"2018-12-17T22:33:08.000Z","content":"CAGR= [ (Current market Value) / (Cost of Investment) ](1/n) – 1 Where ‘n’ is the number of years for which the amount was invested."},{"loc":"682-683","authors":["Manoj Arora"],"date":"2018-12-17T22:34:09.000Z","content":"The interest pay out option essentially means that the annual return is paid out to you separately and the money does not grow in a compounded manner."},{"loc":"698-701","authors":["Manoj Arora"],"date":"2018-12-17T22:41:52.000Z","content":"The Internal Rate of Return (IRR) is a rate of return used to measure and compare the profitability of investments. It is also called the Discounted Cash Flow Rate of Return (DCFROR) or simply the Rate of Return (ROR). In the context of savings and loans, the IRR is also called the effective interest rate. The term “internal” refers to the fact that its calculation does not incorporate environmental factors (e.g.,the interest rate or inflation) but incorporates the time factor of multiple investments."},{"loc":"767-769","authors":["Manoj Arora"],"date":"2018-12-17T23:09:21.000Z","content":"The Cost inflation index by itself does not convey anything – but the increase in the number from one year to another is representative of the change in prices (and therefore, inflation) between these years."},{"loc":"792-795","authors":["Manoj Arora"],"date":"2018-12-17T23:13:22.000Z","content":"…taxes are a financial charge or other levy imposed upon a taxpayer (an individual or legal entity) by a state such that failure to pay is punishable by law. A tax is not a voluntary payment or donation, but an enforced contribution imposed by the government whether under the name of income, toll, tribute, duty, custom, excise, subsidy, aid, supply, or any other name. Taxes consist of direct tax or indirect tax, and may be paid in money or as its labour equivalent."},{"loc":"829-831","authors":["Manoj Arora"],"date":"2018-12-17T23:20:18.000Z","content":"Income Tax is deducted before you are paid your income. This is popularly known as Tax Deduction at Source (TDS) i.e. tax is deducted at source of money generation."},{"loc":"836-836","authors":["Manoj Arora"],"date":"2018-12-17T23:21:16.000Z","content":"…a capital gain is an income derived from the sale of any investment or capital asset."},{"loc":"839-840","authors":["Manoj Arora"],"date":"2018-12-17T23:22:38.000Z","content":"The capital gains tax is different from almost all other forms of taxation in that it is a voluntary tax, in one way. Since the tax is paid only when an asset is sold, taxpayers can legally avoid payment by holding on to their assets — a phenomenon known as the “lock-in effect.”"},{"loc":"870-872","authors":["Manoj Arora"],"date":"2018-12-17T23:28:22.000Z","content":"…a short-term capital loss arising from sale of shares can be offset against a short-term capital gain from the sale of other shares, as long as both the sales occur in the same financial year."},{"loc":"872-874","authors":["Manoj Arora"],"date":"2018-12-17T23:28:57.000Z","content":"…if shares or equity MFs are held for more than 12 months before selling, the gain arising is classified as Long-Term Capital Gain. In the case of long-term capital gain arising out of the sale of shares or equity mutual funds, there is 0% capital gains tax. The main reason for zero tax is the concept of double taxation."},{"loc":"934-936","authors":["Manoj Arora"],"date":"2018-12-18T21:13:40.000Z","content":"As and when the equity price has reduced by more than 15% of the current average purchase cost, I would invest more to bring the average cost further down. Now, remember, that this is good to follow when other indicators to buy the stock still favor a purchase of the said stock."},{"loc":"984-985","authors":["Manoj Arora"],"date":"2018-12-18T21:20:06.000Z","content":"An asset class is defined as a group of assets or securities that exhibit similar characteristics, behave similarly in the marketplace, and are subject to the same laws and regulations."},{"loc":"1002-1004","authors":["Manoj Arora"],"date":"2018-12-18T21:23:08.000Z","content":"How you divide your investments between stocks (shares) and bonds, equity and debt, and low rate of return vs high rate of return – is the single most important concept for building a secure retirement plan."},{"loc":"1005-1007","authors":["Manoj Arora"],"date":"2018-12-18T21:23:31.000Z","content":"Portfolio asset allocation (also called asset allocation) is an investment planning technique that allows you to get the right balance between risk and return by investing through a variety of investment tools that you will study in the next chapter."},{"loc":"1009-1011","authors":["Manoj Arora"],"date":"2018-12-18T21:24:15.000Z","content":"Asset allocation is a method of investment planning that aims to maximize the returns for any given level of risk, or reduce the risk for any given level of return, by allocating capital to different types of assets in suitable proportions."},{"loc":"1031-1031","authors":["Manoj Arora"],"date":"2018-12-18T21:26:41.000Z","content":"“Complexity is the bane of an investor”"},{"loc":"1140-1144","authors":["Manoj Arora"],"date":"2018-12-18T21:40:52.000Z","content":"The base lending rate is the rate at which banks borrow money from the Reserve Bank of India or other similar central banks in their respective countries. During a strong economic period, the RBI increases the base lending rate to calm down the economy a bit. A higher base lending rate would mean that the banks cannot loan out money at lower rates and that lowers the economy further (as there are less borrowers of money from the bank at higher rates). This technique is often used to bring down spiralling inflation rates."},{"loc":"1144-1145","authors":["Manoj Arora"],"date":"2018-12-18T21:41:02.000Z","content":"A higher base lending rate also means that the bank can pass on the benefits to you as a retail investor as well. Therefore, this base lending rate is directly proportional to the interest rate you will get from a fixed deposit."},{"loc":"1188-1188","authors":["Manoj Arora"],"date":"2018-12-18T21:47:28.000Z","content":"Laddering is a process by which an annual stream of FDs is created for a long period."},{"loc":"1219-1220","authors":["Manoj Arora"],"date":"2018-12-18T21:52:07.000Z","content":"An extremely important fact is that the interest earned through PPF savings is not taxable. All these factors coupled together make it the safest and the most efficient savings option to start investing in."},{"loc":"1253-1254","authors":["Manoj Arora"],"date":"2018-12-18T21:55:06.000Z","content":"PPF investments are Exempt Exempt Exempt (EEE) – the money you invest, the interest earned, and the final withdrawable amount – are all tax exempt."},{"loc":"1276-1276","authors":["Manoj Arora"],"date":"2018-12-18T21:57:25.000Z","content":"In fact, the EPF can single-handedly account for the debt portion allocation of your financial portfolio."},{"loc":"1283-1285","authors":["Manoj Arora"],"date":"2018-12-18T21:58:23.000Z","content":"The withdrawals from the EPF within five years of joining a job are taxable. The tax will be minimal if the person is jobless and has no significant income from other sources but you will not completely escape the tax net. When you withdraw your EPF, you forego the power of compounding."},{"loc":"1327-1328","authors":["Manoj Arora"],"date":"2018-12-18T22:02:21.000Z","content":"This voluntary increase in your EPF investment is usually dealt as a separate investment tool, which is aptly named as Voluntary Provident Fund (VPF)."},{"loc":"1336-1337","authors":["Manoj Arora"],"date":"2018-12-18T22:03:20.000Z","content":"An added advantage of investing through VPF is that the interest rate is equal to the interest rate of a PF and the withdrawal is tax free. The money invested in a VPF is also subject to tax relief under Section 80C, as in the case of 12% EPF money."},{"loc":"1339-1340","authors":["Manoj Arora"],"date":"2018-12-18T22:04:44.000Z","content":"The maximum contribution you can make towards EPF+VPF together is 100% of your basic salary and Dearness Allowance (DA)."},{"loc":"1337-1339","authors":["Manoj Arora"],"date":"2018-12-18T22:04:49.000Z","content":"The interest rate that you receive for the VPF amount is the same as what you get from the government for the EPF amount (normally 8%). The withdrawal on retirement is also tax-free."},{"loc":"1346-1347","authors":["Manoj Arora"],"date":"2018-12-18T22:05:39.000Z","content":"In case you make a premature withdrawal from your PF account, (which holds both your EPF and VPF contributions) you will have to pay taxes on this withdrawal amount."},{"loc":"1364-1366","authors":["Manoj Arora"],"date":"2018-12-18T22:07:36.000Z","content":"For a long term investment (10+ years), nothing can beat the returns of equity investments. Equity Investments are not “that” risky, especially in the long run. It tends to offer an extremely efficient risk-reward ratio."},{"loc":"1468-1470","authors":["Manoj Arora"],"date":"2018-12-18T22:17:39.000Z","content":"Compounding is one concept which doesn’t hit you unless your time is right. But once it does, it changes your outlook towards life and towards money…forever."},{"loc":"1498-1499","authors":["Manoj Arora"],"date":"2018-12-18T22:20:23.000Z","content":"Gold should be an important part of a diversified investment portfolio because its price increases in response to events that cause the value of paper investments, such as stocks and bonds, to decline."},{"loc":"1522-1523","authors":["Manoj Arora"],"date":"2018-12-18T22:22:49.000Z","content":"Gold Exchange Traded Funds (ETFs) are intended to offer investors a means of participating in the gold bullion market without the necessity of taking physical delivery of gold."},{"loc":"1524-1526","authors":["Manoj Arora"],"date":"2018-12-18T22:23:24.000Z","content":"Gold ETFs are designed to provide returns that closely correspond to the returns provided by physical gold. Each ETF unit is approximately equal to the price of 1 gm of gold (or may be 10 grams of gold in some ETFs)."},{"loc":"1566-1567","authors":["Manoj Arora"],"date":"2018-12-18T22:28:28.000Z","content":"“Most people get interested in stocks when everyone else is. The time to get interested is when no one else is. You can’t buy what is popular and do well.”"},{"loc":"1570-1570","authors":["Manoj Arora"],"date":"2018-12-19T21:30:55.000Z","content":"“knowledge removes fear”."},{"loc":"1609-1610","authors":["Manoj Arora"],"date":"2018-12-19T21:41:08.000Z","content":"When the price of the stock becomes too high, the company will occasionally decide to split the price of the stock to encourage trading liquidity."},{"loc":"1615-1616","authors":["Manoj Arora"],"date":"2018-12-19T21:42:47.000Z","content":"The P/E ratio or the Price vs Earning ratio is essentially the ratio of the price per share vs the earning per share of the company."},{"loc":"1616-1617","authors":["Manoj Arora"],"date":"2018-12-19T21:44:22.000Z","content":"Generally, the higher the P/E ratio, the more expensive is the stock."},{"loc":"1617-1618","authors":["Manoj Arora"],"date":"2018-12-19T21:44:37.000Z","content":"Expensive stock means that the price is already high and we should be careful when investing in such a stock."},{"loc":"1618-1622","authors":["Manoj Arora"],"date":"2018-12-19T21:45:07.000Z","content":"P/E ratios are useful for comparison of companies in the same industry. If the average P/E ratio of most of the companies in a particular industry is around 18 and the company you are interested in investing in has a P/E ratio of around 21, it essentially means that the said stock is expensive and the market is expecting the company to have significantly higher earnings and has already built in the expectations in the stock price. This does not mean that the said stock is a bad investment; it only tells that you can go ahead and invest but you are paying a premium price to do so."},{"loc":"1622-1623","authors":["Manoj Arora"],"date":"2018-12-19T21:45:48.000Z","content":"A P/E ratio of 21 essentially means that the price per share is 21 times the earnings per share."},{"loc":"1626-1627","authors":["Manoj Arora"],"date":"2018-12-19T21:46:53.000Z","content":"If you have planned well and want more assured returns, invest for dividends rather than to increase the stock value of the company."},{"loc":"1627-1628","authors":["Manoj Arora"],"date":"2018-12-19T21:47:44.000Z","content":"Dividends are the returns you get as a share holder of the company in which you are a partial owner. Dividends are paid out of earnings, unless the company ploughs all the earnings back into the company to fuel future growth."},{"loc":"1629-1640","authors":["Manoj Arora"],"date":"2018-12-19T21:48:28.000Z","content":"The amount of dividend paid out by the company is best measured by the dividend payout ratio, which is defined as the ratio of dividend distributed by the company to the Total Profit earned after Tax (PAT). If a company has a dividend payout ratio of over 50% it means that the company is distributing 50% of the earnings back to its shareholders and may be investing the remaining 50% to fuel future growth. Such companies with a dividend payout ratio of 50% or more are said to be distributing the dividend ‘generously’. However, there is an alternative way of measuring how much dividend you get on a stock — called the dividend yield. This is the amount of dividend you get per stock divided by the price you pay to buy the stock. Note that dividend yield changes as the price of the stock changes. The dividend yield of a stock can be high, either because the company has a high dividend payout ratio, or simply because its stock price is very low. In any case, if what matters to you is the dividend you get for your money invested, you should look only at the dividend yield. In exceptional cases when the dividend yield is low because of the poor earnings of the company (due to some known environmental factors) but the dividend payout ratio is still high, it essentially means that the company is still distributing a good percentage of its earnings."},{"loc":"1641-1641","authors":["Manoj Arora"],"date":"2018-12-19T21:51:39.000Z","content":"Dividends are tax-free income for the shareholders."},{"loc":"1641-1643","authors":["Manoj Arora"],"date":"2018-12-19T21:52:05.000Z","content":"In fact, a dividend yield of 6.5% is equivalent to 10% interest earned through a fixed deposit or any other debt based investment, over a period of one year, which is taxable income."},{"loc":"1907-1907","authors":["Manoj Arora"],"date":"2018-12-20T22:22:47.000Z","content":"Fearless, massive growth happens when your wealth is protected."},{"loc":"2040-2040","authors":["Manoj Arora"],"date":"2018-12-20T22:34:34.000Z","content":"Riches begin with a state of mind and with definiteness of purpose."},{"loc":"2081-2085","authors":["Manoj Arora"],"date":"2018-12-22T23:17:37.000Z","content":"Steve Jobs said: “It is important to have passion and love for what you are doing. You must know what is driving you to your goal. There is a simple but logical reason to know this, and the reason is that whatever you are trying to achieve is not simple or easy. There will be times when the going will get tough. There will be times when you would feel like quitting. At that time, no technique or knowledge would work. The only element that can take you through that tough time is your love and passion for the work that you are doing, your reason or the drive behind your goal. If the reason is not strong enough, you will give up in those tough times.”"},{"loc":"2116-2118","authors":["Manoj Arora"],"date":"2018-12-22T23:24:01.000Z","content":"“When I was 5 years old, my mother always told me that happiness was the key to life. When I went to school, they asked what I wanted to be when I grew up. I wrote down “Happy”. They told me that I didn’t understand the assignment. I told them that they didn’t understand life.”"},{"loc":"2147-2148","authors":["Manoj Arora"],"date":"2018-12-22T23:27:00.000Z","content":"“When we strive to become better than we are, everything around us becomes better too.”"},{"loc":"2271-2272","authors":["Manoj Arora"],"date":"2018-12-22T23:40:37.000Z","content":"Invest for cash flow instead of capital gains."},{"loc":"2273-2274","authors":["Manoj Arora"],"date":"2018-12-22T23:40:57.000Z","content":"…capital gain is an income derived from the sale of any investment or “capital asset”. The capital investment can be a home, a farm, a ranch, a family business, shares and bonds or a work of art."},{"loc":"2279-2280","authors":["Manoj Arora"],"date":"2018-12-22T23:42:42.000Z","content":"Investopedia defines a cash flow as : “A revenue or expense stream that changes a cash account over a given period”."},{"loc":"2280-2282","authors":["Manoj Arora"],"date":"2018-12-22T23:42:55.000Z","content":"Cash inflows usually arise from one of three activities — financing, operations or investing — although this can also occur as a result of donations or gifts in the case of personal finance. Cash outflows result from expenses or investments. This holds true for both business and personal finance."},{"loc":"2339-2340","authors":["Manoj Arora"],"date":"2018-12-22T23:51:21.000Z","content":"The habit of always putting off something until you can afford it, or until the time is right, or until you know how to do it is one of the greatest thiefs of joy."},{"loc":"2341-2341","authors":["Manoj Arora"],"date":"2018-12-22T23:51:31.000Z","content":"“If and When were planted, and Nothing grew.”"},{"loc":"2400-2403","authors":["Manoj Arora"],"date":"2018-12-22T23:59:02.000Z","content":"Most of our mental development and study discipline comes through formal education. But as soon as we leave the external discipline of school, many of us let our minds just wander around. We do not do any more serious reading, we do not explore new subjects in any real depth outside our field of work, we do not think analytically, we do not write — at least not critically or in away that tests our ability to express ourselves in clear and concise language."},{"loc":"2414-2415","authors":["Manoj Arora"],"date":"2018-12-23T12:00:26.000Z","content":"“The person who doesn’t read is no better off than the person who cannot read.”"},{"loc":"2442-2442","authors":["Manoj Arora"],"date":"2018-12-23T12:03:07.000Z","content":"“Your attitude, not your aptitude, will determine your altitude.”"},{"loc":"2443-2444","authors":["Manoj Arora"],"date":"2018-12-23T12:03:18.000Z","content":"“Whether you think you can, or you think you cannot, you are right.”"},{"loc":"2509-2509","authors":["Manoj Arora"],"date":"2018-12-23T12:13:23.000Z","content":"“Opportunity is a goddess who does not waste her time with the unprepared”."},{"loc":"2669-2670","authors":["Manoj Arora"],"date":"2018-12-23T9:31:19.000Z","content":"When money realizes that it is in good hands, it wants to stay and multiply in those hands."},{"loc":"2783-2784","authors":["Manoj Arora"],"date":"2018-12-23T9:53:50.000Z","content":"Those who plan do better than those who do not plan even though they may not be able to stick to their plan."},{"loc":"3651-3651","authors":["Manoj Arora"],"date":"2018-12-23T23:12:35.000Z","content":"If your goals and dreams are big enough, facts don’t count."},{"loc":"3676-3677","authors":["Manoj Arora"],"date":"2018-12-23T23:14:41.000Z","content":"A penny saved is a dollar earned."},{"loc":"3799-3799","authors":["Manoj Arora"],"date":"2018-12-23T23:28:30.000Z","content":"I don’t dream at night, I dream all day; I dream for a living."},{"loc":"3801-3801","authors":["Manoj Arora"],"date":"2018-12-23T23:28:37.000Z","content":"A mediocre idea that generates enthusiasm will go further than a great idea that inspires no one."},{"loc":"3843-3844","authors":["Manoj Arora"],"date":"2018-12-23T23:32:45.000Z","content":"Never give up. You only get one life. Go for it!"}]