[{"loc":"143-144","authors":["Ramit Sethi"],"date":"2018-12-01T23:44:54.000Z","content":"People love to argue minor points, partially because they feel it absolves them from actually having to do anything."},{"loc":"160-160","authors":["Ramit Sethi"],"date":"2018-12-01T23:47:17.000Z","content":"…decision paralysis, a fancy way of saying that with too much information, we do nothing."},{"loc":"170-171","authors":["Ramit Sethi"],"date":"2018-12-01T23:48:43.000Z","content":"The single most important thing you can do to be rich is to start early."},{"loc":"210-211","authors":["Ramit Sethi"],"date":"2018-12-01T23:54:33.000Z","content":"BECAUSE OF INFLATION, YOU’RE ACTUALLY LOSING MONEY EVERY DAY YOUR MONEY IS SITTING IN A BANK ACCOUNT."},{"loc":"276-277","authors":["Ramit Sethi"],"date":"2018-12-02T12:02:23.000Z","content":"I encourage you to set your goals today. Why do you want to be rich? What do you want to do with your wealth?"},{"loc":"281-283","authors":["Ramit Sethi"],"date":"2018-12-02T12:03:25.000Z","content":"…when individual investors talk about complicated concepts like this, it’s like two elementary school tennis players arguing about the string tension of their racquets. Sure, it might matter a little, but they’d be much better tennis players if they just went outside and hit some balls for a few hours each day."},{"loc":"330-330","authors":["Ramit Sethi"],"date":"2018-12-02T13:30:36.000Z","content":"…establishing good credit is the first step in building an infrastructure for getting rich."},{"loc":"332-332","authors":["Ramit Sethi"],"date":"2018-12-02T13:33:34.000Z","content":"Credit has a far greater impact on your finances than saving a few dollars a day on a cup of coffee."},{"loc":"335-336","authors":["Ramit Sethi"],"date":"2018-12-02T13:34:26.000Z","content":"There are two main components to credit (also known as your credit history): the credit report and the credit score."},{"loc":"340-342","authors":["Ramit Sethi"],"date":"2018-12-02T13:37:40.000Z","content":"Your credit report gives potential lenders—the people who are considering lending you money for a car or home—basic information about you, your accounts, and your payment history. In general, it tracks all credit-related activities, although recent activities are given higher weight."},{"loc":"343-346","authors":["Ramit Sethi"],"date":"2018-12-02T13:38:14.000Z","content":"Your credit score (often called your FICO score because it was created by the Fair Isaac Corporation) is a single, easy-to-read number between 300 and 850 that represents your credit risk to lenders. It’s like Cliff’s Notes for the credit industry. The lenders take this number (higher is better) and, with a few other pieces of information, such as your salary and age, decide if they’ll lend you money for credit like a credit card, mortgage, or car loan. They’ll charge you more or less for the loan, depending on the score, which signifies how risky you are."},{"loc":"357-358","authors":["Ramit Sethi"],"date":"2018-12-02T13:41:16.000Z","content":"…rich people plan before they need to plan."},{"loc":"431-431","authors":["Ramit Sethi"],"date":"2018-12-02T13:52:39.000Z","content":"If you’re getting a rewards card, find one that gives you something you value."},{"loc":"445-445","authors":["Ramit Sethi"],"date":"2018-12-02T13:54:16.000Z","content":"Pay off your credit card regularly."},{"loc":"453-458","authors":["Ramit Sethi"],"date":"2018-12-02T13:56:33.000Z","content":"If you miss even one payment on your credit card, here are four terrible, horrible, no good, very bad results you may face: 1. Your credit score can drop more than 100 points, which would add $240/month to an average thirty-year fixed-mortgage loan. 2. Your APR can go up to 30 percent. 3. You’ll be charged a late fee, usually around $35. 4. Your late payment can trigger rate increases on your other credit cards as well, even if you’ve never been late on them. (I find this fact amazing.)"},{"loc":"500-503","authors":["Ramit Sethi"],"date":"2018-12-02T14:03:23.000Z","content":"Most people should switch from a for-fee card to a free card, so ask your credit card company what they’ll do for you. If they waive your fees, great! If not, switch to a no-fee credit card. I suggest you do this at the same credit card company to simplify your life—and so you don’t have to close one account and open another, which will affect your credit score. If you decide to close the account and get a new credit card, look for one with no fees and good rewards"},{"loc":"504-508","authors":["Ramit Sethi"],"date":"2018-12-02T14:07:58.000Z","content":"Your APR, or annual percentage rate, is the interest rate your credit card company charges you. The average APR is 14 percent, which makes it extremely expensive if you carry a balance on your card. Put another way, since you can make an average of about 8 percent in the stock market, your credit card is getting a great deal by lending you money. If you could get a 14 percent return, you’d be thrilled—you want to avoid the black hole of credit card interest payments so you can earn money, not give it to the credit card companies."},{"loc":"520-521","authors":["Ramit Sethi"],"date":"2018-12-02T14:10:24.000Z","content":"If you have a credit card, keep it active using an automatic payment at least once every three months."},{"loc":"529-530","authors":["Ramit Sethi"],"date":"2018-12-02T14:12:06.000Z","content":"…credit utilization rate, which is simply how much you owe divided by your available credit. This makes up 30 percent of your credit score."},{"loc":"532-533","authors":["Ramit Sethi"],"date":"2018-12-02T14:13:21.000Z","content":"Lower is preferred because lenders don’t want you regularly spending all the money you have available through credit—it’s too likely that you’ll default and not pay them anything."},{"loc":"533-534","authors":["Ramit Sethi"],"date":"2018-12-02T14:13:56.000Z","content":"Always Track Your Calls to Financial Companies"},{"loc":"535-537","authors":["Ramit Sethi"],"date":"2018-12-02T14:15:05.000Z","content":"…the best ways to improve your chances of getting fees waived is by keeping track of every time you call your financial institutions, including credit card companies, banks, and investment companies."},{"loc":"555-557","authors":["Ramit Sethi"],"date":"2018-12-02T14:17:51.000Z","content":"To improve your credit utilization rate, you have two choices: Stop carrying so much debt on your credit cards (even if you pay it off each month) or increase your total available credit. Because we’ve already established that if you’re doing this, you’re debt-free, all that remains for you to do is to increase your available credit."},{"loc":"622-623","authors":["Ramit Sethi"],"date":"2018-12-02T14:27:01.000Z","content":"People with zero debt get a free pass. If you have no debt, close as many accounts as you want. It won’t affect your credit utilization score."},{"loc":"623-624","authors":["Ramit Sethi"],"date":"2018-12-02T14:27:14.000Z","content":"Manage debt to avoid damaging your credit score."},{"loc":"628-630","authors":["Ramit Sethi"],"date":"2018-12-02T14:28:01.000Z","content":"If you’re applying for a major loan—for a car, home, or education—don’t close any accounts within six months of filing the loan application. You want as much credit as possible when you apply."},{"loc":"642-642","authors":["Ramit Sethi"],"date":"2018-12-02T14:30:03.000Z","content":"Focus on the big wins if you want bigger results."},{"loc":"648-649","authors":["Ramit Sethi"],"date":"2018-12-02T14:30:50.000Z","content":"Avoid getting sucked in by “Apply Now and Save 10 Percent in Just Five Minutes!” offers."},{"loc":"667-668","authors":["Ramit Sethi"],"date":"2018-12-03T22:57:11.000Z","content":"Focus on the big wins to get the big results. They may not be as obvious or sexy as jumping from account to account and getting a few extra bucks, but the big wins will make you rich over the long term."},{"loc":"669-670","authors":["Ramit Sethi"],"date":"2018-12-03T22:57:28.000Z","content":"Don’t make the mistake of paying for your friends with your credit card and keeping the cash—and then spending it all."},{"loc":"727-728","authors":["Ramit Sethi"],"date":"2018-12-03T23:04:12.000Z","content":"…the number one mistake people make with their credit cards is carrying a balance, or not paying it off every month."},{"loc":"748-748","authors":["Ramit Sethi"],"date":"2018-12-03T23:07:23.000Z","content":"Managing your money has to be a priority if you ever want to be in a better situation than you are today."},{"loc":"760-761","authors":["Ramit Sethi"],"date":"2018-12-03T23:09:27.000Z","content":"“deadbeat,” a curious nickname they actually use for customers who pay on time every month and therefore produce virtually no revenue."},{"loc":"773-774","authors":["Ramit Sethi"],"date":"2018-12-03T23:11:00.000Z","content":"Figure out how much debt you have."},{"loc":"810-810","authors":["Ramit Sethi"],"date":"2018-12-03T23:14:42.000Z","content":"Decide where the money to pay off your credit cards will come from."},{"loc":"823-824","authors":["Ramit Sethi"],"date":"2018-12-09T22:36:09.000Z","content":"It’s fine to use credit cards as tools for convenient spending and to rack up “bonus points,” as long as you’re aware of the possibility you are subtly spending more due to the ease of use."},{"loc":"986-990","authors":["Ramit Sethi"],"date":"2018-12-09T23:31:34.000Z","content":"The most important practical difference between checking accounts and savings accounts is that you withdraw money regularly from your checking account—but you rarely withdraw from your savings account (or at least that’s the way it should be). Checking accounts are built for frequent withdrawals: They have debit cards and ATMs for your convenience. But your savings account is really a “goals” account, where every dollar is assigned to a specific item you’re saving up for."},{"loc":"994-998","authors":["Ramit Sethi"],"date":"2018-12-09T23:32:46.000Z","content":"There is one downside to having an online savings account: It can take a few business days to access your money. Typically, if you want to withdraw your money, you’ll log in to your online savings account, initiate a free transfer to your checking account, and then wait three to five days for it to happen. If you need your money immediately, this could cause a problem—but then again, you shouldn’t be withdrawing very frequently from your savings account, so most likely"},{"loc":"1017-1018","authors":["Ramit Sethi"],"date":"2018-12-09T23:40:05.000Z","content":"For consumer protection, I pay my bills using my credit card. The credit card is automatically paid in full every month by my online checking account."},{"loc":"1021-1022","authors":["Ramit Sethi"],"date":"2018-12-09T23:41:02.000Z","content":"…it’s not just about your immediate earnings—being young is about developing the right habits."},{"loc":"1023-1024","authors":["Ramit Sethi"],"date":"2018-12-09T23:41:25.000Z","content":"Start small now so that when you do have a lot of money, you’ll know what to do with it."},{"loc":"1150-1154","authors":["Ramit Sethi"],"date":"2018-12-09T23:58:22.000Z","content":"…half my friends are afraid of talking to people on the phone and it ends up costing them lots of money. I have a friend who recently lost his bank password and, for security reasons, had to call the bank to prove who he was. He turned into a Stockholm Syndrome victim in front of my eyes, muttering, “It’s not that important. I’ll just wait until I go into the bank” over and over. He didn’t get his password for four months! What the hell is wrong with people? You may not like to talk on the phone, but most of the special deals I’ll show you how to get require talking to someone in person or on the phone. So suck it up."},{"loc":"1240-1241","authors":["Ramit Sethi"],"date":"2018-12-10T12:07:36.000Z","content":"Leave one and a half months of living expenses in your checking account, or as close to it as you can manage."},{"loc":"1259-1260","authors":["Ramit Sethi"],"date":"2018-12-10T22:38:21.000Z","content":"“Compounding,” Albert Einstein said, “is mankind’s greatest invention because it allows for the reliable, systematic accumulation of wealth.”"},{"loc":"1282-1282","authors":["Ramit Sethi"],"date":"2018-12-10T22:41:17.000Z","content":"“buy low, sell high,”"},{"loc":"1518-1519","authors":["Ramit Sethi"],"date":"2018-12-10T23:22:04.000Z","content":"Don’t get fooled by smooth-talking salespeople: You can easily manage your investment account by yourself."},{"loc":"1535-1536","authors":["Ramit Sethi"],"date":"2018-12-10T23:24:21.000Z","content":"“Don’t put off until tomorrow what you can do today.”"},{"loc":"1642-1643","authors":["Ramit Sethi"],"date":"2018-12-11T23:06:49.000Z","content":"If you decide that spending $2.50 on Cokes when you eat out isn’t worth it—and you’d rather save that $15 each week for a movie—that’s not cheap. That’s using frugality to drive conscious spending."},{"loc":"1655-1656","authors":["Ramit Sethi"],"date":"2018-12-11T23:16:58.000Z","content":"TOO OFTEN, OUR FRIENDS INVISIBLY PUSH US AWAY FROM BEING FRUGAL AND CONSCIOUS SPENDERS."},{"loc":"1669-1671","authors":["Ramit Sethi"],"date":"2018-12-11T23:22:10.000Z","content":"…frugality is not about simply cutting your spending on various things. It’s about making your own decisions about what’s important enough to spend a lot on, and what’s not, rather than blindly spending on everything."},{"loc":"1708-1709","authors":["Ramit Sethi"],"date":"2018-12-11T23:26:50.000Z","content":"…it’s fun to judge your friends, keep in mind that the context matters."},{"loc":"1789-1790","authors":["Ramit Sethi"],"date":"2018-12-11T23:37:14.000Z","content":"A Conscious Spending Plan involves four major buckets where your money will go: Fixed Costs, Investments, Savings, and Guilt-free Spending Money."},{"loc":"1853-1854","authors":["Ramit Sethi"],"date":"2018-12-13T7:50:29.000Z","content":"…good rule of thumb is to save 5 to 10 percent of your take-home pay to meet your goals."},{"loc":"1954-1955","authors":["Ramit Sethi"],"date":"2018-12-13T8:01:59.000Z","content":"Once you list your goals and start making those trade-offs, you’ll realize that saving money becomes far easier."},{"loc":"2401-2405","authors":["Ramit Sethi"],"date":"2018-12-13T23:12:38.000Z","content":"Add a savings goal of three months of bare-bones income before you do any investing. For example, if you need at least $1,500/month to live on, you’ll need to have $4,500 in a savings buffer, which you can use to smooth out months where you don’t generate much income. The buffer should exist as a sub-account in your savings account. To fund it, use money from two places: First, forget about investing while you’re setting up the buffer, and instead take any money you would have invested and send it to your savings account. Second, in good months, any extra dollar you make should go into your buffer savings."},{"loc":"2481-2482","authors":["Ramit Sethi"],"date":"2018-12-14T8:25:50.000Z","content":"More information is not always good, especially when it’s not actionable and causes you to make errors in your investing."},{"loc":"2767-2767","authors":["Ramit Sethi"],"date":"2018-12-14T21:08:43.000Z","content":"…the best time to make money is when everyone else is getting out of the market."},{"loc":"2773-2774","authors":["Ramit Sethi"],"date":"2018-12-14T21:09:38.000Z","content":"…investors should “be fearful when others are greedy and greedy when others are fearful.”"},{"loc":"2801-2802","authors":["Ramit Sethi"],"date":"2018-12-14T21:13:40.000Z","content":"…more than 90 percent of your portfolio’s volatility is a result of your asset allocation."},{"loc":"2803-2805","authors":["Ramit Sethi"],"date":"2018-12-14T21:14:16.000Z","content":"Asset allocation is your plan for investing, the way you organize the investments in your portfolio between stocks, bonds, and cash. In other words, by diversifying your investments across different asset classes (like stocks and bonds, or, better yet, stock funds and bond funds), you could control the risk in your portfolio—and therefore control how much money, on average, you’d lose due to volatility."},{"loc":"2808-2808","authors":["Ramit Sethi"],"date":"2018-12-14T21:14:44.000Z","content":"…asset allocation is the most significant part of your portfolio that you can control."},{"loc":"2809-2809","authors":["Ramit Sethi"],"date":"2018-12-14T21:15:01.000Z","content":"Your investment plan is more important than your actual investments."},{"loc":"2841-2843","authors":["Ramit Sethi"],"date":"2018-12-14T21:19:42.000Z","content":"…individual investors like you and me should not invest in individual stocks. Instead, we’ll choose funds, which are collections of stocks (and sometimes, for diversification, bonds)."},{"loc":"2847-2849","authors":["Ramit Sethi"],"date":"2018-12-14T21:20:58.000Z","content":"The advantages of bonds are that you can choose the term, or length of time, you want the loan to last (two years, five years, ten years, and so on), and you know exactly how much you’ll get when they “mature” or pay out."},{"loc":"2875-2876","authors":["Ramit Sethi"],"date":"2018-12-14T21:25:48.000Z","content":"It is important to diversify within stocks, but it’s even more important to allocate across the different asset classes—like stocks and bonds. Investing in only one category is dangerous over the long term."},{"loc":"2877-2879","authors":["Ramit Sethi"],"date":"2018-12-14T21:26:50.000Z","content":"Diversification is D for going deep into a category (for example, buying different types of stocks: large-cap, small-cap, international, and so on), and asset allocation is A for going across all categories (for example, stocks and bonds)."},{"loc":"2900-2901","authors":["Ramit Sethi"],"date":"2018-12-14T21:31:08.000Z","content":"…bonds will generally perform better when stocks fall, bonds lower your risk a lot while limiting your returns only a little."},{"loc":"2902-2905","authors":["Ramit Sethi"],"date":"2018-12-14T21:31:50.000Z","content":"Bonds aren’t really for young people in their twenties. If you’re in your twenties or early thirties, and you don’t necessarily need to reduce your risk, you can simply invest in all-stock funds and let time mitigate any risk. But in your thirties and older, you’ll want to begin balancing your portfolio with bonds to reduce risk. What if stocks as a whole don’t perform well for a long time? That’s when you need to own other asset classes—to offset the bad times."},{"loc":"2907-2909","authors":["Ramit Sethi"],"date":"2018-12-14T21:32:52.000Z","content":"…there are many types of stocks, and we need to own a little of all of them. Same with bonds. This is called diversifying, and it essentially means digging in to each asset class—stocks and bonds—and investing in all their subcategories."},{"loc":"2924-2930","authors":["Ramit Sethi"],"date":"2018-12-14T21:38:50.000Z","content":"The fact that performance varies so much in each asset class means two things: First, if you’re trying to make a quick buck off investing, you’ll usually lose money because you have no idea what will happen in the near future. Anyone who tells you they do is a fool or a commission-based salesman. Second, you should own different categories of stocks (and maybe bonds) to balance out your portfolio. You don’t want to own only U.S. small-cap stocks, for example, or funds that own only small-cap stocks. If they didn’t perform well for ten years, that would really suck. If, however, you own small-cap stocks, plus large-cap stocks, plus international stocks, and more, you’re effectively insured against any one area dragging you down. So, if you were to invest in stocks, you’d want to diversify, buying all different types of stocks or stock funds to have a balanced portfolio."},{"loc":"2933-2935","authors":["Ramit Sethi"],"date":"2018-12-14T21:39:35.000Z","content":"…if you’re twenty-five and just starting out, your biggest danger isn’t having a portfolio that’s too risky. It’s being lazy and overwhelmed and not doing any investing at all. That’s why it’s important to understand the basics but not get too wrapped up in all the variables and choices."},{"loc":"3149-3155","authors":["Ramit Sethi"],"date":"2018-12-14T23:33:33.000Z","content":"…most people who try to manage their own portfolios fail at even matching the market. They fail because they sell at the first sign of trouble, or because they buy and sell too often, thereby diminishing their returns with taxes and trading fees. (Think of all the people who sold off their 401(k)s in late 2008, not really understanding that there were bargains to be had by simply continuing their consistent investing. It was fear—not strategy.) The result is tens of thousands of dollars lost over a lifetime. Plus, if you buy individual index funds, you’ll have to rebalance every year to make sure your asset allocation is still what you want it to be (more on this in a minute). Lifecycle funds do this for you, so if you just want an easy way to invest, use one."},{"loc":"3155-3156","authors":["Ramit Sethi"],"date":"2018-12-14T23:33:55.000Z","content":"THE KEY TO CONSTRUCTING A PORTFOLIO IS NOT PICKING KILLER STOCKS! IT’S FIGURING OUT A BALANCED ASSET ALLOCATION THAT WILL LET YOU RIDE OUT STORMS AND SLOWLY GROW OVER TIME."},{"loc":"3208-3209","authors":["Ramit Sethi"],"date":"2018-12-14T23:40:09.000Z","content":"…when you look for various funds, make sure you’re being strategic about your domestic equities, international equities, bonds, and all the rest. You cannot just pick random funds and expect to have a balanced asset allocation."},{"loc":"3217-3218","authors":["Ramit Sethi"],"date":"2018-12-14T23:41:32.000Z","content":"…dollar-cost averaging is a fancy phrase that refers to investing regular amounts over time, rather than investing all your money into a fund at once."},{"loc":"3223-3225","authors":["Ramit Sethi"],"date":"2018-12-14T23:42:51.000Z","content":"By investing over time, you hedge against any drops in the price—and if your fund does drop, you’ll pick up shares at a discount price. In other words, by investing over a regular period of time, you don’t try to time the market. Instead, you use time to your advantage."},{"loc":"3230-3230","authors":["Ramit Sethi"],"date":"2018-12-14T23:43:25.000Z","content":"Creating your own portfolio takes significant research."},{"loc":"3498-3499","authors":["Ramit Sethi"],"date":"2018-12-15T11:13:08.000Z","content":"In your twenties and thirties, there are only three reasons to sell your investments: You need the money for an emergency, you made a terrible investment and it’s consistently underperforming the market, or you’ve achieved your specific goal for investing."},{"loc":"3690-3691","authors":["Ramit Sethi"],"date":"2018-12-15T11:36:54.000Z","content":"Tread gently. Nobody likes talking about money—especially if it means having to admit to their kids that they need help."},{"loc":"3972-3973","authors":["Ramit Sethi"],"date":"2018-12-15T24:26:03.000Z","content":"Getting rich isn’t about one silver bullet or secret strategy. It happens through regular, boring, disciplined action. Most people see only the results of all this action—a winnable moment or an article in the press. But it’s the behind-the-scenes work that really makes you rich."},{"loc":"4166-4166","authors":["Ramit Sethi"],"date":"2018-12-15T24:57:46.000Z","content":"THE BOTTOM LINE: BUY ONLY IF YOU’RE PLANNING TO LIVE IN THE SAME PLACE FOR TEN YEARS OR MORE."},{"loc":"4238-4239","authors":["Ramit Sethi"],"date":"2018-12-15T13:10:11.000Z","content":"“You don’t get rich spending a dollar to save 30 cents!”"}]