[{"loc":"320-321","authors":["Grant Barrett"],"date":"2019-03-08T22:39:10.000Z","content":"We must write differently than we speak."},{"loc":"323-327","authors":["Grant Barrett"],"date":"2019-03-08T22:40:03.000Z","content":"It’s easy to lose sight of what is important. You focus on word count rather than results. You lose track of your good idea because you’re worried about margins or type size. You’re concerned about the introduction but haven’t given a thought to the conclusion. You’re so worried about your deadline it distracts you from doing the work. Many writers go through this! You are not alone. To focus on what is important, look at the finished, published writing around you and think, “If they did it, so can I.”"},{"loc":"337-337","authors":["Grant Barrett"],"date":"2019-03-08T22:41:32.000Z","content":"Don’t be the person who doesn’t recognize when it is the right time for formal versus informal language!"},{"loc":"352-356","authors":["Grant Barrett"],"date":"2019-03-08T22:44:13.000Z","content":"Tell someone else about your writing. Some people feel that talking to anyone else will void their ideas of meaning, that in the telling, the magic is gone, and all that is left is dusty vagueness. But the important part is to ask the other person to tell your ideas back to you. You’ll probably find yourself wanting to correct what they’re saying, or add to their words. As the two of you discuss your project, take notes. Take lots of notes as quickly as you can. Those notes become your outline."},{"loc":"356-358","authors":["Grant Barrett"],"date":"2019-03-08T22:45:36.000Z","content":"Start at the end. If your hero dies in the end, write that first. Then, write what happened right before the hero died. And then write what happened before that. Keep working backward until you reach the beginning of the story. This also works for speeches, essays, and even complicated emails: put down your final, summarizing thoughts, and then justify them."},{"loc":"379-381","authors":["Grant Barrett"],"date":"2019-03-08T22:51:49.000Z","content":"…paragraphs have two important characteristics: 1. They contain one main idea. 2. They have multiple sentences."},{"loc":"381-385","authors":["Grant Barrett"],"date":"2019-03-08T22:52:07.000Z","content":"How do you know when to start a paragraph? - when introducing an essay or a new idea, when concluding an essay or finishing the discussion of an idea, when an existing paragraph seems to contain too many ideas (in which case, move each main idea into its own paragraph), when trying to avoid a big unbroken block of words—or “wall of text” — which can be intimidating. Paragraphs can be any length, but good writers usually try to break down long paragraphs into several shorter paragraphs."},{"loc":"460-466","authors":["Grant Barrett"],"date":"2019-03-08T23:05:22.000Z","content":"Writers at all levels have a hard time making an argument that flows naturally from beginning to end—that’s why it’s taught in schools! Good transitions can help fix that by making it feel more like a story and less like a pile of facts and opinions. Avoid simply jumping to the next topic. Transitions can appear in topic sentences, concluding sentences, or both. Develop a variety of transition techniques and use them without shame. Every good writer has a stock of useful phrases to ease them through their writing. In fact, as you’re reading, note how other writers move smoothly between ideas and see if those strategies will work for you, too."},{"loc":"466-471","authors":["Grant Barrett"],"date":"2019-03-08T23:05:49.000Z","content":"Inside of sentences, these words and phrases can help you build good transitions: - although, as a result, at first, eventually, finally, however, next, now, then"},{"loc":"471-483","authors":["Grant Barrett"],"date":"2019-03-08T23:06:00.000Z","content":"Between sentences, these words and phrases can provide good transitions: A good example of that is, As I wrote above, Eventually, Finally, For instance, Furthermore, However, In addition, In conclusion, In fact, Indeed, Just as with X, the facts show that Y is also, More importantly, On the other hand, Overall, Therefore, This is also the opinion of Dr. Z, who believes, To illustrate, To put it briefly, To summarize, With this in mind."},{"loc":"485-486","authors":["Grant Barrett"],"date":"2019-03-08T23:07:54.000Z","content":"Don’t wait until the end to make your best point. Always lead with your best arguments."},{"loc":"491-493","authors":["Grant Barrett"],"date":"2019-03-08T23:09:03.000Z","content":"Support your opinions with official data, research, and experts’ opinions, which are more persuasive than your opinions alone. Sentences that begin with I think or I feel need more than your thoughts and emotions to back them up."},{"loc":"494-495","authors":["Grant Barrett"],"date":"2019-03-08T23:09:23.000Z","content":"Think twice about trying to be funny, unless you’ve been asked specifically to write a humorous essay. Most attempts at humor fail."},{"loc":"503-505","authors":["Grant Barrett"],"date":"2019-03-08T23:10:32.000Z","content":"If you can finish with lots of time to spare, put the writing aside and then go back to it later. Even just a couple of hours can give you a new perspective on your own work. If you can go back to it days or even weeks later, so much the better. It will be like reading someone else’s work, and you’re likely to say, “What was I thinking?” more than a few times."},{"loc":"506-508","authors":["Grant Barrett"],"date":"2019-03-08T23:11:01.000Z","content":"If you don’t have time to spare, a widely used trick is to temporarily change the typeface and the size of the text and margins. Make the margins bigger and the text larger. This way, your eyes are less likely to glide over familiar-looking blocks of text."},{"loc":"508-510","authors":["Grant Barrett"],"date":"2019-03-08T23:11:21.000Z","content":"Don’t be kind to your own writing. The saying in the writing business is, “kill your darlings.” That means that any spot where you think you’ve been particularly brilliant is a spot where you should spend time making sure it’s really as brilliant as you think it is. Chances are, it can be trimmed, reworded, or even removed altogether."},{"loc":"549-551","authors":["Grant Barrett"],"date":"2019-03-09T21:40:32.000Z","content":"If you want to learn to spell a lot of words very fast, try this trick: Write them all into the craziest story you can imagine. Then read the story aloud to yourself and friends—but when you get to the words you need to learn, spell them out instead of saying them."},{"loc":"596-597","authors":["Grant Barrett"],"date":"2019-03-09T21:51:09.000Z","content":"Homophones are words that sound alike but are spelled differently."},{"loc":"678-681","authors":["Grant Barrett"],"date":"2019-03-09T22:02:33.000Z","content":"An inflected ending is a type of suffix that modifies (1) the tense of a verb to indicate the time, duration, completeness, quantity, or other quality of what is being referred to or (2) the number. These inflected endings come—of course, because this is English—with irregular as well as regular patterns."},{"loc":"684-686","authors":["Grant Barrett"],"date":"2019-03-09T22:05:39.000Z","content":"Suffixes such as -able, -ant, -ly, -ness, -ology, and -ure can change a word from one part of speech to another. They are known as derivational suffixes."},{"loc":"938-939","authors":["Grant Barrett"],"date":"2019-03-09T22:38:13.000Z","content":"The time, with the definite article the, is used to refer to events that have happened, but without being specific about when."},{"loc":"941-942","authors":["Grant Barrett"],"date":"2019-03-09T22:38:19.000Z","content":"One time is often used to introduce a story about something specific that happened, without being specific about when."},{"loc":"944-945","authors":["Grant Barrett"],"date":"2019-03-09T22:38:23.000Z","content":"Once upon a time is a formal way of introducing a story, especially a fairy tale or folk tale."},{"loc":"1081-1082","authors":["Grant Barrett"],"date":"2019-03-11T21:57:55.000Z","content":"…for either/or and neither/nor sentences, the verb is conjugated based on the subject nearest to it."},{"loc":"1084-1085","authors":["Grant Barrett"],"date":"2019-03-11T21:58:15.000Z","content":"A phrase or clause that comes between the subject and the verb does not change the antecedent’s number."},{"loc":"1088-1088","authors":["Grant Barrett"],"date":"2019-03-11T22:00:05.000Z","content":"When you use indefinite pronouns such as anybody, each, everybody, and someone, use a singular verb."},{"loc":"1102-1103","authors":["Grant Barrett"],"date":"2019-03-11T22:02:56.000Z","content":"…you have a phrase or sentence with a subject and a predicate, then you have a clause."},{"loc":"1111-1112","authors":["Grant Barrett"],"date":"2019-03-11T22:03:53.000Z","content":"The when in when I left my backpack on the bus is an example of a subordinator, which introduces a dependent clause."},{"loc":"1115-1116","authors":["Grant Barrett"],"date":"2019-03-11T22:04:45.000Z","content":"Noun clause markers are useful when you want to connect two independent clauses."},{"loc":"1130-1130","authors":["Grant Barrett"],"date":"2019-03-11T22:05:30.000Z","content":"“That” is a special noun clause marker that can be omitted. The others cannot."},{"loc":"1133-1134","authors":["Grant Barrett"],"date":"2019-03-11T22:05:58.000Z","content":"While a clause has both a subject and a predicate, a phrase does not."},{"loc":"1149-1150","authors":["Grant Barrett"],"date":"2019-03-11T22:08:14.000Z","content":"One type of noun phrase is an appositive phrase, where the subject is defined or restated, usually right after it."},{"loc":"1154-1154","authors":["Grant Barrett"],"date":"2019-03-11T22:08:57.000Z","content":"Another type of noun phrase is a gerund phrase, which is made from a verb but behaves like a noun."},{"loc":"1155-1156","authors":["Grant Barrett"],"date":"2019-03-11T22:09:12.000Z","content":"There are also infinitive phrases, which use an unconjugated form of the verb."},{"loc":"1158-1159","authors":["Grant Barrett"],"date":"2019-03-11T22:11:19.000Z","content":"Verb phrases start with a verb and may include a direct or indirect object, or a complement (see section 5.7). They do not include the subject. Verb phrases can sometimes behave like adjectives or adverbs."},{"loc":"1169-1169","authors":["Grant Barrett"],"date":"2019-03-11T22:24:04.000Z","content":"Absolute phrases modify the entire sentence and are set off by commas or dashes from it."},{"loc":"1172-1173","authors":["Grant Barrett"],"date":"2019-03-11T22:24:32.000Z","content":"…complement completes the predicate. It finishes the idea started by the subject or object or a verb."},{"loc":"1173-1174","authors":["Grant Barrett"],"date":"2019-03-11T22:24:48.000Z","content":"A subject complement comes after a linking verb (see section 6.9) and describes or redefines the subject."},{"loc":"1177-1178","authors":["Grant Barrett"],"date":"2019-03-11T22:25:04.000Z","content":"An object complement, usually a noun or adjective or words behaving like one, refers to a direct object (see section 5.3, Objects)."},{"loc":"1181-1182","authors":["Grant Barrett"],"date":"2019-03-11T22:28:25.000Z","content":"A verb complement supplements the understanding of another verb. In other words, one verb is the object of the others."},{"loc":"1208-1209","authors":["Grant Barrett"],"date":"2019-03-12T21:51:08.000Z","content":"Mass nouns, which act as a singular subject even though they refer to lots of things, take the singular conjugation."},{"loc":"1217-1217","authors":["Grant Barrett"],"date":"2019-03-12T21:56:18.000Z","content":"Simple past tense is for actions that happened at a specific time."},{"loc":"1222-1223","authors":["Grant Barrett"],"date":"2019-03-12T21:56:36.000Z","content":"Past perfect is for actions that happened but were finished before a specific time. This was traditionally called the pluperfect."},{"loc":"1224-1225","authors":["Grant Barrett"],"date":"2019-03-12T21:57:03.000Z","content":"Past perfect progressive is for actions that happened continuously but then stopped happening continuously at a specific time."},{"loc":"1228-1228","authors":["Grant Barrett"],"date":"2019-03-12T21:57:27.000Z","content":"Simple present tense happens now and is repeated. It’s about habits or regular events."},{"loc":"1230-1231","authors":["Grant Barrett"],"date":"2019-03-12T21:57:36.000Z","content":"Present progressive actions are continuously happening now."},{"loc":"1233-1233","authors":["Grant Barrett"],"date":"2019-03-12T21:57:48.000Z","content":"Present perfect actions started and finished in the past at an unspecified time but are relevant to the present."},{"loc":"1235-1236","authors":["Grant Barrett"],"date":"2019-03-12T21:57:57.000Z","content":"Present perfect progressive is for actions that were continuously happening in the past and are still happening now."},{"loc":"1239-1240","authors":["Grant Barrett"],"date":"2019-03-12T21:59:29.000Z","content":"There are two forms that talk about the future. Will forms tend to be about a promise, intention, or voluntary action. Going to forms tend to be about plans or a certain future."},{"loc":"1243-1244","authors":["Grant Barrett"],"date":"2019-03-12T22:03:15.000Z","content":"Future progressive says what will be happening continuously."},{"loc":"1246-1247","authors":["Grant Barrett"],"date":"2019-03-12T22:03:25.000Z","content":"Future perfect says that at a certain future time, a specific event will have happened."},{"loc":"1249-1250","authors":["Grant Barrett"],"date":"2019-03-12T22:05:30.000Z","content":"Future perfect progressive says that at a certain future time, a continuous event will have been happening."},{"loc":"1255-1255","authors":["Grant Barrett"],"date":"2019-03-12T22:05:47.000Z","content":"Indicative mood tells us things that are true. It is by far the most common."},{"loc":"1255-1256","authors":["Grant Barrett"],"date":"2019-03-12T22:05:54.000Z","content":"Subjunctive mood suggests possibility, wishes, or hypotheticals, especially in contradiction to what is true."},{"loc":"1262-1263","authors":["Grant Barrett"],"date":"2019-03-12T22:06:54.000Z","content":"Imperative mood makes a verb into a command. It uses the second person, even when, for example, the subject is speaking to herself or himself."},{"loc":"1265-1266","authors":["Grant Barrett"],"date":"2019-03-12T22:07:22.000Z","content":"The voice of a verb has nothing do with the sounds made by the mouth. Instead, it has to do with who or what is performing or doing the verb."},{"loc":"1275-1276","authors":["Grant Barrett"],"date":"2019-03-12T22:08:32.000Z","content":"What you should try to avoid is using passive voice to deflect responsibility, unless that’s what you’re aiming for."},{"loc":"1278-1280","authors":["Grant Barrett"],"date":"2019-03-12T22:09:14.000Z","content":"Passive voice is rightly used when you can’t or don’t need to explicitly identify the subject. Perhaps the subject—the main actor—is unknown, or doesn’t matter, or is understood from the context."},{"loc":"1294-1296","authors":["Grant Barrett"],"date":"2019-03-12T22:11:44.000Z","content":"In the present tense, a thing is happening while the words are being said, whereas in the historical simple tense, important past events are described as if they are happening right now, although it is usually clear from the context that there’s no way they could be."},{"loc":"1314-1315","authors":["Grant Barrett"],"date":"2019-03-12T22:15:26.000Z","content":"…if the gerund is preceded by a pronoun, the possessive form is the best choice."},{"loc":"1318-1319","authors":["Grant Barrett"],"date":"2019-03-12T22:15:49.000Z","content":"Action verbs indicate what the subject of a sentence is doing. In good writing, action verbs can make the reader feel emotions, see scenes more vividly, and accurately know what is happening. Action verbs can be transitive or intransitive."},{"loc":"1320-1320","authors":["Grant Barrett"],"date":"2019-03-12T22:15:57.000Z","content":"Transitive verbs have a direct object, which is the thing or person being acted upon by the verb."},{"loc":"1324-1325","authors":["Grant Barrett"],"date":"2019-03-12T22:18:00.000Z","content":"Intransitive verbs do not act upon anything. They may be followed by an adjective, adverb, preposition, or another part of speech."},{"loc":"1328-1331","authors":["Grant Barrett"],"date":"2019-03-12T22:19:24.000Z","content":"Linking verbs add details about the subject of a sentence. In their simplest form, they connect the subject and the sentence complement—that is, the adjective, noun, or pronoun that follows the linking verb. They link them together instead of showing action. The linguistic term for this connection is copula. Often, what is on each side of a linking verb is equivalent; the complement redefines or restates the subject."},{"loc":"1348-1349","authors":["Grant Barrett"],"date":"2019-03-12T22:20:57.000Z","content":"Also called helping verbs, auxiliary verbs extend the main verb by helping to show time, tense, and possibility. The auxiliary verbs are be, have, and do. They are used in the continuous (progressive) and perfect tenses."},{"loc":"1349-1351","authors":["Grant Barrett"],"date":"2019-03-12T22:21:27.000Z","content":"In the progressive tenses, the auxiliary verb be and its conjugated forms are part of the construction that shows that the action is or was happening continuously."},{"loc":"1367-1369","authors":["Grant Barrett"],"date":"2019-03-19T21:55:03.000Z","content":"Do is used for emphasis, usually in a situation where there has been some doubt about the truth. If you were reading these sentences aloud, you would put a lot of emphasis on the form of do."},{"loc":"1372-1373","authors":["Grant Barrett"],"date":"2019-03-19T21:56:18.000Z","content":"Modal verbs, also known as conditionals, are a kind of auxiliary verb. They assist the main verb in suggesting ability, possibility, potential, expectation, permission, and obligation. When used with the main verb, modal verbs do not end with -s for the third-person singular."},{"loc":"1387-1388","authors":["Grant Barrett"],"date":"2019-03-19T21:59:13.000Z","content":"There are three verbs that behave like modals some of the time, but like main verbs the rest of the time: dare, need to, and used to."},{"loc":"1402-1402","authors":["Grant Barrett"],"date":"2019-03-19T22:03:52.000Z","content":"The most common irregular verb in English is to be."},{"loc":"1405-1406","authors":["Grant Barrett"],"date":"2019-03-19T22:04:04.000Z","content":"The present participle of to be is being and the past participle is been."},{"loc":"1406-1408","authors":["Grant Barrett"],"date":"2019-03-19T22:04:33.000Z","content":"The other two most common irregular verbs are to have (present participle: having, past participle: had) and to do (present participle: doing, past participle: done)."},{"loc":"1537-1538","authors":["Grant Barrett"],"date":"2019-03-19T22:12:13.000Z","content":"In North American English, gotten is the past participle of to get, meaning obtained or received, while got is a past participle meaning possessed. The British tend to use got in both cases."},{"loc":"1564-1565","authors":["Grant Barrett"],"date":"2019-03-19T22:18:59.000Z","content":"For most nonfiction or academic writing, use the present tense to relay facts and the past tense to relay actions."},{"loc":"1568-1569","authors":["Grant Barrett"],"date":"2019-03-19T22:23:49.000Z","content":"When commenting on what a source says, use the present tense."},{"loc":"1570-1571","authors":["Grant Barrett"],"date":"2019-03-19T22:23:59.000Z","content":"When describing a source’s dated, published work, use the past tense."},{"loc":"1572-1573","authors":["Grant Barrett"],"date":"2019-03-19T22:24:04.000Z","content":"When discussing current thinking of a domain or field, use the present tense."},{"loc":"1575-1575","authors":["Grant Barrett"],"date":"2019-03-19T22:24:13.000Z","content":"When narrating a chain of events, use the past tense."},{"loc":"1577-1579","authors":["Grant Barrett"],"date":"2019-03-19T22:25:33.000Z","content":"When narrating an exciting chain of events that lead to a big conclusion, consider using the historical present tense. This uses verbs conjugated as if they are the present tense in past tense situations."},{"loc":"1581-1582","authors":["Grant Barrett"],"date":"2019-03-19T22:25:59.000Z","content":"Sometimes a verb becomes joined with a preposition or adverb into a new phrase that has its own meaning above and beyond its parts. This type of idiom is known as a phrasal verb."},{"loc":"1590-1591","authors":["Grant Barrett"],"date":"2019-03-19T22:28:06.000Z","content":"Some phrasal verbs can put the object either right after the verb or right after the whole phrase."},{"loc":"1599-1600","authors":["Grant Barrett"],"date":"2019-03-19T22:29:18.000Z","content":"Usually, a noun phrase has just one determiner. If there is more than one, they have a natural order. Not all determiners can be used together."}]