[{"loc":"72-74","authors":["Devdutt Pattanaik"],"date":"2020-05-03T22:12:48.000Z","content":"He is Ram of the axe, Ram of the bow, and Ram of the plough. He is Narayana who reclines on the coils of a serpent afloat on the ocean of milk. He is Vishnu who rides the great eagle with golden wings, and fights for devas, and tricks asuras. Him you shall never know if you leave this earth for the sky."},{"loc":"75-76","authors":["Devdutt Pattanaik"],"date":"2020-05-03T22:13:24.000Z","content":"‘Stories are for those who listen; not those who wander.’"},{"loc":"90-92","authors":["Devdutt Pattanaik"],"date":"2020-05-03T22:16:04.000Z","content":"I will split it into sixteen chapters for simplicity.’ ‘Why sixteen?’ ‘One for every stage of his life. Also because sixteen steps constitute the ritual adoration of God in a temple.’"},{"loc":"103-105","authors":["Devdutt Pattanaik"],"date":"2020-05-03T22:17:51.000Z","content":"Unlike the unenlightened householder, for whom material life is either a burden or an indulgence, Krishna embodies the enlightened householder: he who lives as a householder but thinks like a hermit, is engaged in everything but possessive of nothing."},{"loc":"107-108","authors":["Devdutt Pattanaik"],"date":"2020-05-03T22:18:42.000Z","content":"Shuka is therefore called the primal Go-swami, master (swami) of the sense organs (indriya) visualized in yogic tradition as cows (gau) that continuously graze (chara) upon sensory stimuli."},{"loc":"111-117","authors":["Devdutt Pattanaik"],"date":"2020-05-03T22:19:51.000Z","content":"The shodasopchara or sixteen steps of adoration (upasana) are aimed at making the divine feel welcome as a guest: 1. Invocation (avahan); 2. Offering a seat (asana); 3. Washing the deity’s feet (padyam); 4. Washing our hands (arghya); 5. Washing our mouth (achaman); 6. Bathing the deity (snana); 7. Offering clothes (vastra); 8. Offering sacred thread (yagnopaveeta); 9. Offering fragrances (gandha); 10. Offering ornaments (alankara); 11. Offering flowers (pushpa); 12. Offering incense (dhupa); 13. Offering lamps (deepa); 14. Offering food (naivedya); 15. Offering mouth freshener (tambulam); and 16. Singing songs of praise (aarti)."},{"loc":"120-122","authors":["Devdutt Pattanaik"],"date":"2020-05-03T22:22:10.000Z","content":"Images of Madanmohanji, Govinddevji and Gopinathji that were lost and later found in the fifteenth century in Vrindavana by Goswamis and then taken to Rajasthan for protection from Muslim marauders are called Bajrakrit, or ‘made by Vajranabhi’."},{"loc":"124-125","authors":["Devdutt Pattanaik"],"date":"2020-05-03T22:22:26.000Z","content":"‘In order to help the limited discover limitlessness, the infinite had to descend as the finite.’"},{"loc":"138-139","authors":["Devdutt Pattanaik"],"date":"2020-05-03T22:24:49.000Z","content":"While Abrahamic traditions speak of God creating the world out of nothingness, in Hindu tradition creation is an act of waking up from a deep slumber and finally gaining full awareness."},{"loc":"143-147","authors":["Devdutt Pattanaik"],"date":"2020-05-03T22:26:19.000Z","content":"The idea of the law of the jungle is expressed in the Bhagavata Purana (1.13.47): those without hands are food for those with hands (ahastani sahastanam), those without feet are food for those with four feet (apadani catus-padam), the weak exist for the strong (phalguni tatra mahatam), life feeds on life (jivo jivasya jivanam). Human beings are the only creatures who can subvert this jungle law and establish dharma where the strong help the weak."},{"loc":"167-170","authors":["Devdutt Pattanaik"],"date":"2020-05-03T22:29:04.000Z","content":"An interesting aspect of the Bhagavata tradition is the concept of reverse-devotion (viparit-bhakti) or devotion expressed through hatred (dvesha-bhakti) that looks at all the enemies of Krishna as his devotees for they keep chanting his name (nama-japa) albeit in hatred. So Hiranayaksha, Hiranakashipu, Ravana, Kumbhakarna, Shishupala and Dantavakra are all devotees who express devotion through their nastiness and by thinking of Vishnu all the time."},{"loc":"183-184","authors":["Devdutt Pattanaik"],"date":"2020-05-04T18:24:40.000Z","content":"In bronze images from the Chola period in south India, there is a triangle on the right shoulder indicating the presence of Lakshmi (shrivatsa)."},{"loc":"185-186","authors":["Devdutt Pattanaik"],"date":"2020-05-04T18:25:03.000Z","content":"The story of Bhrigu kicking Vishnu’s chest is the theme of the Tirumalai Sthala Puranam that explains why Vishnu resides on the seven hills of Andhra as Tirupati Balaji."},{"loc":"214-215","authors":["Devdutt Pattanaik"],"date":"2020-05-04T18:35:13.000Z","content":"You are Madhusudana, killer of Madhu, who created me. I am Medhini, born from the marrow of the demons Madhu and Kaitabha."},{"loc":"230-232","authors":["Devdutt Pattanaik"],"date":"2020-05-04T18:37:13.000Z","content":"Ram and Krishna are complete incarnations of Vishnu. Of these, Krishna is the most complete as, unlike Ram, he is constantly aware of his divinity, is linked with playfulness (leela) and aesthetic delight (rasa), and comfortably embraces his feminine side."},{"loc":"232-235","authors":["Devdutt Pattanaik"],"date":"2020-05-04T18:37:52.000Z","content":"In many Vaishnava traditions, gurus are considered an avatar of Krishna, or the avatar of the avatar (avataravatara). This is why for followers of the Gaudiya Vaishnava parampara there is no difference between Chaitanya and the combined form of Radha-Krishna (Shri-Krishna-Chaitanya Radha-Krishna nahe anya)."},{"loc":"237-239","authors":["Devdutt Pattanaik"],"date":"2020-05-04T18:38:55.000Z","content":"Avatar and dharma are both social concepts; avatar is the means by which divinity engages with the world while dharma ignites the human potential to rise above animal instinct of self-preservation."},{"loc":"240-241","authors":["Devdutt Pattanaik"],"date":"2020-05-04T18:39:06.000Z","content":"…nowadays, people have increasingly started referring to Shiva’s avatar and Devi’s avatar, diluting the distinction between world-engaging Vishnu, world-renouncing Shiva and world-embodying Devi."},{"loc":"242-244","authors":["Devdutt Pattanaik"],"date":"2020-05-04T18:39:34.000Z","content":"The standard list of Vishnu’s ten avatars became popular after Jayadeva’s Gita Govinda mentioned it. In the older Bhagavata Purana there are twenty-two avatars, including the Jain leader Rishabha, the enchantress Mohini, the sage Kapila and the swan Hamsa."},{"loc":"244-246","authors":["Devdutt Pattanaik"],"date":"2020-05-04T18:39:48.000Z","content":"The Hindu concept of avatar (infinity becomes finite to enable human beings to find their humanity) is very different from the American concept of superhero (ordinary becomes extraordinary to solve problems)."},{"loc":"288-290","authors":["Devdutt Pattanaik"],"date":"2020-05-04T18:49:47.000Z","content":"Psychoanalysts speak of the Oedipus complex where a young man kills his father and marries his mother, indicative of how the younger generation overpowers the older generation. This Greek/Western notion is reversed in the Yayati story. In the Yayati complex an old man feeds on the youth of his children to prolong his pleasure, indicative of how the older generation exploits the younger generation."},{"loc":"292-295","authors":["Devdutt Pattanaik"],"date":"2020-05-04T18:50:56.000Z","content":"From Manu descended two dynasties of kings: the solar and the lunar. Unlike the lunar, the solar dynasty was upright and did not let desire override good sense. Upright Ram belongs to the solar line of kings and his story is told in the Ramayana. Self-indulgent Yayati belongs to the lunar line of kings. His descendants are the Bharatas whose story is told in the Mahabharata."},{"loc":"304-305","authors":["Devdutt Pattanaik"],"date":"2020-05-04T18:52:16.000Z","content":"Madhura, or Mathura, home of the nagas, the snake people, who were ruled not by kings but by a council of elders. An oligarchy, rather than a monarchy."},{"loc":"305-307","authors":["Devdutt Pattanaik"],"date":"2020-05-04T18:52:50.000Z","content":"Impressed by Yadu’s beauty, strength and wisdom, the nagas let him settle among them and marry their daughters. Together, the ten sons born of these unions came to be known as Dasarha and founded many tribes such as Vrishni, Andhaka and Bhojaka. This tribal collective identified itself as the Yadavas, descendants of Yadu."},{"loc":"310-311","authors":["Devdutt Pattanaik"],"date":"2020-05-04T18:53:48.000Z","content":"Mathura, or Madhura, probably means a city sweeter than honey (madhu)."},{"loc":"311-312","authors":["Devdutt Pattanaik"],"date":"2020-05-04T18:54:11.000Z","content":"In the Puranas, the Yadava council was called Dasarhi, after the Dasarha, a set of ten brothers, sons of Yadu."},{"loc":"317-318","authors":["Devdutt Pattanaik"],"date":"2020-05-04T18:54:54.000Z","content":"If one traces Krishna’s lineage we see that he has the blood of nagas (Yadu’s wives), asuras (Yadu’s mother) and manavas (Yadu’s father)."},{"loc":"319-321","authors":["Devdutt Pattanaik"],"date":"2020-05-04T18:57:10.000Z","content":"Before the rise of the Mauryan empire, there were sixteen republics in the Gangetic plains, one of which was Surasena near modern-day Mathura. Avantiputta was the king of the Surasenas in the time of Maha Kachchana, one of the chief disciples of Gautama Buddha, who spread Buddhism in the Mathura region."},{"loc":"367-368","authors":["Devdutt Pattanaik"],"date":"2020-05-05T18:28:11.000Z","content":"Among the women Vasudev married were Rohini and Devaki. Rohini’s brother was Nanda, the chief of cowherds, who lived in Gokul on the other side of the Yamuna river."},{"loc":"405-406","authors":["Devdutt Pattanaik"],"date":"2020-05-05T18:32:25.000Z","content":"In the bhakti tradition, Kamsa’s horrible deeds are forms of reverse-devotion designed to force God to descend on earth and liberate him from earthly bonds."},{"loc":"417-418","authors":["Devdutt Pattanaik"],"date":"2020-05-05T18:33:25.000Z","content":"Krishna’s story begins with the baby-killer Kamsa and ends with the baby-killer Ashwatthama."},{"loc":"422-425","authors":["Devdutt Pattanaik"],"date":"2020-05-05T18:34:15.000Z","content":"Putana said, ‘Every time a woman menstruates an ancestor loses his chance to be reborn. By preventing rebirth, you incur the wrath of the pitrs. They will curse you as your mother cursed you. Don’t let that happen. Haven’t you been cursed enough? Let Vasudev stay with Devaki. If they still make babies knowing what fate awaits them, it is their burden, not yours.’"},{"loc":"426-429","authors":["Devdutt Pattanaik"],"date":"2020-05-05T18:34:46.000Z","content":"‘Why do we suffer so?’ wondered Devaki. Vasudev replied, ‘Nothing in this world happens without a reason. Our suffering, our children’s suffering must be the result of misdeeds in our past lives. The law of karma which makes the world go round clearly states: every creature is obliged to experience the results of its actions, either in the same life or the next.’"},{"loc":"447-448","authors":["Devdutt Pattanaik"],"date":"2020-05-05T18:37:22.000Z","content":"Since Balarama is created by being extracted (karshana) from one womb and put together (sama) in another, he is called Samkarshana. Samkarshana also means ‘one who brings together’ which is ironic since Balarama is a hermit-like loner, unlike the friendly Krishna."},{"loc":"491-492","authors":["Devdutt Pattanaik"],"date":"2020-05-05T19:04:27.000Z","content":"Ancient mythologies are full of stories of hero gods such as Sargon of Mesopotamia and Moses of Israel being taken across rivers to protect them from potential killers."},{"loc":"493-494","authors":["Devdutt Pattanaik"],"date":"2020-05-05T19:04:46.000Z","content":"Vasudev was named Anakadundhubi because the gods played drums at the time of his birth for he would be the father of Krishna. He is also called Bhukashyapa, or Kashyapa on earth."},{"loc":"511-514","authors":["Devdutt Pattanaik"],"date":"2020-05-05T19:07:17.000Z","content":"In the Jain Kalpasutra, the birth of Krishna is preceded by seven dreams indicating he is a Vasudeva and the birth of Balarama by four dreams that suggest he is a Baladeva. A chakravarti’s birth is preceded by fourteen dreams, and a Tirthankara’s by sixteen. Each dream displays an auspicious object such as a pot, a pile of gems, lotus flowers, a throne, a flag, an elephant, the goddess of fortune, a pond, the sun, the moon, etc."},{"loc":"526-527","authors":["Devdutt Pattanaik"],"date":"2020-05-05T19:08:23.000Z","content":"In Kerala, there is a sacred forest known as Iringole Kavu that is said to contain the power of Yogamaya. She appears as Saraswati at dawn, as the forest goddess during the day, and as Kali at night."},{"loc":"545-547","authors":["Devdutt Pattanaik"],"date":"2020-05-05T21:15:09.000Z","content":"In ancient India, a dark complexion was not considered inferior or ugly unlike contemporary India, where increasingly television shows select fair-skinned actors to play the role of Krishna. In the thirteenth century, Marco Polo remarked that the people of India preferred dark skin."},{"loc":"548-549","authors":["Devdutt Pattanaik"],"date":"2020-05-05T21:16:01.000Z","content":"India was called Jambu-dvipa or land of the Indian gooseberry (jamun). The fruit’s dark shiny skin was said to be the complexion of the gods, of Ram and Shyam, of Vishnu and Kali."},{"loc":"553-556","authors":["Devdutt Pattanaik"],"date":"2020-05-05T21:17:50.000Z","content":"Krishna’s birth is celebrated on the eighth night in the waning half of the Hindu month of Shravana. On this night images of Krishna are placed on a swing and songs are sung for Krishna’s pleasure. This ritual is called Dolai Kannan in south Indian temples. It is performed regularly in Krishna temples to evoke the experience of love for the divine child."},{"loc":"638-640","authors":["Devdutt Pattanaik"],"date":"2020-05-05T22:07:57.000Z","content":"It came to be known as Vrinda-vana or Vrindavana, the settlement in the basil forest, so named because the air was redolent with the gentle fragrance of tulsi."},{"loc":"674-675","authors":["Devdutt Pattanaik"],"date":"2020-05-05T22:12:12.000Z","content":"Krishna is called Damodara because his mother tied a rope around his belly (udara) and tied him to a mortar."},{"loc":"690-691","authors":["Devdutt Pattanaik"],"date":"2020-05-05T22:13:58.000Z","content":"Berries are associated with Krishna as well as Ram. Typically, these are considered to be inferior tribal fruits unlike bananas or bilva which are believed to be superior."},{"loc":"716-718","authors":["Devdutt Pattanaik"],"date":"2020-05-05T22:16:56.000Z","content":"People tend to relate the story of Matsya saving Manu with that of Noah’s ark. But the flood that Noah experiences is the wrath of God while the flood Manu experiences is pralaya, an event that occurs when culture collapses and mankind behaves like animals, exploiting rather than enabling the meek."},{"loc":"749-753","authors":["Devdutt Pattanaik"],"date":"2020-05-05T22:21:02.000Z","content":"Krishna’s dark complexion contrasts Balarama’s fair skin. Krishna is the dark Vishnu and, in many traditions, Balarama is the fair Shiva. Shiva is karpura gauranga, one who is white as camphor. Together, black and white indicate complementary ideas (world-affirming versus world-rejecting) and appear as a recurring theme in Hindu mythology. And so Ganga is white and Yamuna, her twin river, is dark. The Goddess is the wild Kali who is dark as well as the fair Gauri who is demure and domestic."},{"loc":"754-755","authors":["Devdutt Pattanaik"],"date":"2020-05-05T22:21:25.000Z","content":"Krishna’s love is not bound by biological or legal connections and obligations. His mother is not his mother. His father is not his father. His brother is not his brother. Later, his lover is not his wife. What binds them all is love."},{"loc":"785-786","authors":["Devdutt Pattanaik"],"date":"2020-05-05T22:24:54.000Z","content":"Krishna is called Navneet-priya, he who loves fresh butter made from curds."},{"loc":"828-829","authors":["Devdutt Pattanaik"],"date":"2020-05-06T18:11:27.000Z","content":"Krishna is a highly Sanskritized name. In Bengal he is Keshto. In the Gangetic plains he is Kanha. In Tamilakam, he is Kanna. In Maharashtra, he is Kanhoba."},{"loc":"939-941","authors":["Devdutt Pattanaik"],"date":"2020-05-06T18:26:49.000Z","content":"Krishna stands bent in three places while playing the flute. This pose, known as tribhanga, is a feminine pose that Krishna adopts. In art, Krishna is often depicted with a plait, a nose ring, anklets, palms painted with alta, like a woman. It is said that Krishna is so comfortable in his masculinity that he does not shun femininity, unlike hermits."},{"loc":"978-980","authors":["Devdutt Pattanaik"],"date":"2020-05-06T18:34:42.000Z","content":"Cows are a metaphor for the senses. Just as a cow grazes on grass the senses graze on sensory stimuli (indriya-go-chara). Krishna is go-swami or go-sain, the lord of the senses."},{"loc":"1047-1047","authors":["Devdutt Pattanaik"],"date":"2020-05-06T18:50:09.000Z","content":"Krishna is called Keshava because he kills Keshi, the horse demon."},{"loc":"1167-1169","authors":["Devdutt Pattanaik"],"date":"2020-05-06T19:01:09.000Z","content":"Krishna the dancer atop Kaliya is called natawara who entertains the gopis and gopas with his expressive eyes and mesmerizing movements—a contrast to Shiva who is nataraja, whose eyes are shut when he dances, totally immersed like a sage, indifferent to the spectators."},{"loc":"1171-1174","authors":["Devdutt Pattanaik"],"date":"2020-05-06T19:01:49.000Z","content":"In some stories, Kaliya’s venom turns Krishna blue, giving Krishna the name Nila-Madhav (blue god) just as the Halahal venom churned from the ocean of milk turned Shiva’s throat blue, giving Shiva the name Nila-kantha (blue-throated one). The confusion between black and blue is widespread in Hindu communities with many people preferring a blue Krishna over the black."},{"loc":"1247-1249","authors":["Devdutt Pattanaik"],"date":"2020-05-06T19:07:42.000Z","content":"This story of Indra’s defeat most clearly reveals a shift away from the Vedic worship of celestial beings to the more popular worship of nature. Krishna was clearly a pastoral god who gradually became part of later Puranic Hinduism, overthrowing old Vedic gods."},{"loc":"1297-1298","authors":["Devdutt Pattanaik"],"date":"2020-05-07T18:11:57.000Z","content":"Amongst the twelve Alvars (those who are immersed in love for Vishnu-Krishna) is one woman, Andal, known for her long black hair, and for weaving garlands, who chose Krishna as her beloved."},{"loc":"1392-1395","authors":["Devdutt Pattanaik"],"date":"2020-05-07T18:32:17.000Z","content":"The twelfth-century Nimbarka sampradaya was the earliest Brahmin group to venerate Radha and Krishna as a couple. Nimbarka was clear that one could not get liberation through Krishna alone; one had to go through Radha. This gave rise to the Radha-vallabhi movement where men dressed as women as part of Krishna bhakti. Here Radha is Krishna’s transcendental wife and partner. The two cannot be separated."},{"loc":"1427-1433","authors":["Devdutt Pattanaik"],"date":"2020-05-07T18:41:15.000Z","content":"While Radha is mythic, Meera Bai, a Rajput princess, is historical. Meera lived 400 years ago, and behaved just like Radha, pining for Krishna. From her songs, compiled as Padavali, we know she refused to acknowledge her husband, refused to perform sati (burn on his funeral pyre) when he died, and suffered greatly in the Rajput household that could not handle her obsession with Krishna. She sang and danced in the streets. She travelled to Vrindavana. When Jiva Goswami refused to meet her on grounds that she was a woman, she replied, ‘But I thought the only man in Vraja is Krishna. We are all women, his gopikas, in male or female bodies.’ When forced to return to her Rajput household, she merged with the image of Krishna in Dwaraka. All her relatives found was her white garment draped around the idol of the lord."},{"loc":"1454-1456","authors":["Devdutt Pattanaik"],"date":"2020-05-07T18:44:08.000Z","content":"Krishna is the only man in Vrindavana, and so everyone, even Shiva, must be a gopika. Thus Shiva’s linga is bedecked as a milkmaid, complete with nose ring and veil. This form is called Gopeshwara-Mahadeva and is much adored by the transgender communities of the Gangetic plains."},{"loc":"1524-1527","authors":["Devdutt Pattanaik"],"date":"2020-05-08T18:19:20.000Z","content":"Gaudiya Vaishnavism of Chaitanya, institutionalized by the Goswamis, rejects the sterile connection with the abstract notion of brahman, and champions instead the sensory and emotional connection established with bhagavan, embodied as Krishna. This shift elevates the Bhagavata Purana, making it the most venerated bhakti text."},{"loc":"1641-1642","authors":["Devdutt Pattanaik"],"date":"2020-05-08T18:28:32.000Z","content":"Krishna-Vishnu’s bow is called Saranga and he is known as Saranga-pani, bearer of the bow."},{"loc":"1790-1792","authors":["Devdutt Pattanaik"],"date":"2020-05-08T18:42:41.000Z","content":"In the fifteenth century two complementary traditions were popular among Tamil Shri-Vaishnava brahmins: Vedanta Desika’s monkey theory of participative devotion (markata kishore nyaya) and Manavala Mamuni’s cat theory of passive devotional surrender (manjara kishore nyaya)."},{"loc":"1905-1908","authors":["Devdutt Pattanaik"],"date":"2020-05-08T18:53:18.000Z","content":"In the Bhagavata Purana, Uddhava simply meets the gopis, but in popular lore he converses with Radha. She addresses not Uddhava but a bumblebee that appears to be trying to touch her feet. She identifies the bee as Krishna who moves from flower to flower, from the women of Vrindavana to the women of Mathura. This expression of abandonment is called the ‘Bhramara Gita’ or the song of the bee."},{"loc":"1982-1983","authors":["Devdutt Pattanaik"],"date":"2020-05-08T18:59:37.000Z","content":"In the Padma Purana it is said that bhakti, which is born in Tamilakam, becomes a youth in Karnataka, old in Gujarat and is rejuvenated in the Gangetic plains."},{"loc":"2045-2048","authors":["Devdutt Pattanaik"],"date":"2020-05-08T19:05:37.000Z","content":"Krishna who withdraws from the battlefield is called Ranchhodrai, the one who withdrew from battle. This form of Krishna is worshipped in Dwaravati and Dakor in Gujarat. It is ironical since this region is associated with Rajputs, who prefer death to dishonour. Krishna, however, finds no shame in tactical withdrawal and living to fight another day."},{"loc":"2100-2101","authors":["Devdutt Pattanaik"],"date":"2020-05-08T22:05:52.000Z","content":"Krishna’s charioteer is named Daruka and the four horses of his chariot are Shaibya, Sugriva, Meghapushpa and Balahak. This is mentioned in the ‘Ashwamedha Parva’ of the Mahabharata."},{"loc":"2169-2170","authors":["Devdutt Pattanaik"],"date":"2020-05-08T22:11:49.000Z","content":"Through Satyabhama, Krishna gets legitimacy, wealth and status among the Yadavas. Satyabhama realizes her importance in Krishna’s life and becomes a dominating and demanding wife."},{"loc":"2227-2232","authors":["Devdutt Pattanaik"],"date":"2020-05-08T22:16:58.000Z","content":"The Manusmriti describes eight different types of marriage in ancient India: where the boy approaches the girl’s father (Brahma-vivah), where the girl approaches the boy and offers dowry (Prajapati-vivah), where the girl is offered as service fee to a worthy service provider (deva-vivah), where the girl is given as gift to a hermit along with a cow and an ox to set up a household (rishi-vivah), where a girl is bought (asura-vivah), where a girl is abducted (rakshasa-vivah), where the boy and girl choose each other seeking no one’s approval (gandharva-vivah) and where a girl is forced into marriage without her approval (pisacha-vivah)."},{"loc":"2269-2270","authors":["Devdutt Pattanaik"],"date":"2020-05-08T22:20:48.000Z","content":"Traditionally, Krishna is offered fifty-six (chhappan) food items (bhog) every day. These are seven dishes cooked by his eight wives served throughout the day."},{"loc":"2286-2287","authors":["Devdutt Pattanaik"],"date":"2020-05-08T22:22:36.000Z","content":"The idea of love for Krishna is greater than Krishna himself, or that the name of Ram is greater than Ram himself, is a recurring theme in bhakti lore."},{"loc":"2429-2431","authors":["Devdutt Pattanaik"],"date":"2020-05-09T22:11:12.000Z","content":"In modern times, when celibacy or monogamy are preferred, people choose to see Krishna’s many marriages as a metaphor for the union of the finite individual souls (jiva-atma) with the infinite cosmic soul (param-atma)."},{"loc":"2469-2471","authors":["Devdutt Pattanaik"],"date":"2020-05-09T22:14:44.000Z","content":"Temples of Krishna in the south, such as Mannargudi in Tamil Nadu and Guruvayur in Kerala are often called ‘Dakshin Dwaraka’ or the Dwaraka of the South. Krishna is worshipped as a child and cowherd in these temples, even though an older Krishna lived in Dwaraka as a householder with his many queens."},{"loc":"3036-3037","authors":["Devdutt Pattanaik"],"date":"2020-05-10T11:17:24.000Z","content":"Krishna’s cosmic form is related to the ‘Purusha Sukta’ of the Rig Veda where the entire universe is imagined as a single organism."},{"loc":"3175-3179","authors":["Devdutt Pattanaik"],"date":"2020-05-10T17:23:47.000Z","content":"It is in the Bhagavad Gita that a summary of Vedic philosophy is presented. Here, for the first time in Hindu lore, themes of devotion and theism are explored. While acharyas like Shankara in the eighth century focused on its intellectual aspect (gyana marga) in their Sanskrit commentaries (bhasya), others like Ramanuja and Madhva in the twelfth and thirteenth centuries focused on its emotional aspect (bhakti marga). Poet-sages such as Dyaneshwara who wrote in regional languages saw the Bhagavad Gita as Krishna’s words propagating the doctrine of bhakti."},{"loc":"3179-3181","authors":["Devdutt Pattanaik"],"date":"2020-05-10T17:23:55.000Z","content":"In the eighteenth century, the British rulers of the land promoted the Gita’s English translations as they found its monotheistic tilt far more acceptable than the polytheistic tilt of the Vedas."},{"loc":"3202-3203","authors":["Devdutt Pattanaik"],"date":"2020-05-10T17:25:32.000Z","content":"Krishna embodies the entire cosmos in this incident. When he is a child, his mother sees the cosmos in him. He is the world, he is in the world and the world is in him."},{"loc":"3204-3206","authors":["Devdutt Pattanaik"],"date":"2020-05-10T17:27:29.000Z","content":"Vedanta philosophers saw the world as no different from the divine (advaita or abheda school of Madhusudana Saraswati), the world and the divine are separate (dvaita or bheda school of Madhva) and the world and the divine are same and separate simultaneously (bhedabheda school of Ramanuja)."},{"loc":"3227-3229","authors":["Devdutt Pattanaik"],"date":"2020-05-10T17:29:56.000Z","content":"In Hindu lore, the question is repeatedly asked: Who is the real father? The one who makes the mother pregnant (Indra in the case of Arjuna), the one who marries the mother and so is the legal guardian (Pandu in the case of Arjuna) or the one who raises the child (Bhisma in the case of Arjuna)? From Indra, Arjuna gets talent, from Pandu he gets inheritance, and from Bhisma he gets love."},{"loc":"3251-3255","authors":["Devdutt Pattanaik"],"date":"2020-05-10T17:32:19.000Z","content":"In the Shiva Purana, Shiva beheads Brahma and Daksha, both brahmins. In the Ramayana, Ram beheads Ravana, also a brahmin. In the Mahabharata, Krishna enables the beheading of Drona, also a brahmin. That brahmins are being beheaded in texts deemed ‘brahminical’ reveals the tension in Hinduism between being brahmin by refined thought (varna) versus brahmin by inherited station (jati). In refined thought, we can see the atma in all its diversity, and so are free of status anxiety. In inherited station, we favour caste hierarchy as it grants us privileged status."},{"loc":"3291-3293","authors":["Devdutt Pattanaik"],"date":"2020-05-10T17:36:14.000Z","content":"‘When a noble man insults his elder brother, that is as good as murdering him. When a noble man indulges in self-praise, it is as good as committing suicide. Let words do the deed. Let harm be done to the psychological body, not the physical body. Keep the weapons out.’"},{"loc":"3295-3297","authors":["Devdutt Pattanaik"],"date":"2020-05-10T17:36:36.000Z","content":"Krishna is popular as one who twists arguments to get his way. But anyone who twists arguments is not Krishna. To be Krishna, the arguments have to lead towards dharma, where the meek take care of the meek, and where we fight for the meek without hating the mighty."},{"loc":"3308-3310","authors":["Devdutt Pattanaik"],"date":"2020-05-10T17:37:45.000Z","content":"Shyam smiled and said, ‘For you, Yudhishtira, this is a march towards dharma. I live in dharma every moment of the day and so aesthetics matter at the same time as justice and ethics and morality. They are all simultaneous, not sequential. You will realize this when dharma is not a mere objective, but a way of being.’"},{"loc":"3334-3337","authors":["Devdutt Pattanaik"],"date":"2020-05-10T17:40:03.000Z","content":"Ram who follows the rules is called maryada purushottam, the rule-following perfect man. Krishna who breaks rules is called leela purushottam, the game-playing perfect man. A perfect man is neither one who follows rules or bends rules of a game, he is one who upholds dharma, takes care of the weak without appreciating the insecurities of the mighty."},{"loc":"3417-3420","authors":["Devdutt Pattanaik"],"date":"2020-05-10T17:51:44.000Z","content":"Krishna fights for dharma, but he does not reject the law of karma. A good deed can have bad consequences. He ends with the curse of Gandhari that will wipe out his entire clan. In the Ramayana, Ram establishes Ramrajya but his own wife and children live in the forest. In the Mahabharata, the victory of the Pandavas does not bring joy to Krishna either."},{"loc":"3430-3434","authors":["Devdutt Pattanaik"],"date":"2020-05-10T17:55:07.000Z","content":"He who seeks to destroy craving with weapons ends up craving those very weapons. He who seeks to destroy craving with charity ends up craving charity. He who seeks to destroy craving with scriptures ends up craving scriptures. He who seeks to destroy craving with truth ends up craving truth. He who seeks to destroy craving with austerities ends up craving austerities. He who seeks to destroy craving with renunciation ends up craving renunciation. Craving cannot be destroyed, but it can be put to good use by locating it in dharma. So seek to destroy dharma, and you will end up craving dharma!"},{"loc":"3457-3459","authors":["Devdutt Pattanaik"],"date":"2020-05-10T17:57:28.000Z","content":"The Gita commonly refers to the Bhagavad Gita, the conversation of Krishna and Arjuna on the battlefield of Kurukshetra. However, the Mahabharata has several Gitas, including the Kama Gita and Anu Gita uttered by Krishna himself that many people are not familiar with."},{"loc":"3469-3470","authors":["Devdutt Pattanaik"],"date":"2020-05-10T17:58:34.000Z","content":"Our vision of the world is limited (mithya) while God’s vision is limitless (satya). We think we are the heroes of the story, but from another’s perspective we are just sidekicks."},{"loc":"3503-3504","authors":["Devdutt Pattanaik"],"date":"2020-05-10T18:01:58.000Z","content":"In temples, Krishna’s right foot is always directed towards Radha who stands to his left. When the left foot is directed to the right side, it is considered inauspicious, heralding misfortune and death."},{"loc":"3574-3581","authors":["Devdutt Pattanaik"],"date":"2020-05-10T18:11:32.000Z","content":"‘From the earth, I learned tolerance; from the wind, how movement creates breath; from fire, that the ashes of all things look the same; from water, about refreshment; from the sea, the restraint of its shorelines; from the sun, the cyclical nature of things; from the moon, the shifting moods of life; from the swan that was caught by the fowler and separated from its mate, that relationships can end for no fault of ours; from the kite that is attacked by larger eagles for the meat on its talons, the power of letting go; from the beehive attacked by the bear, the danger of hoarding; from the butterfly that collects honey without hurting the flower, the wise way to satisfy hunger; from the wandering snake, the importance of never resting; from the python, waiting for opportunities to come our way; from the moth drawn to fire, the male elephant that loses control of his senses when sexually aroused by the smell of the female, the deer trapped by the hunter’s music, the fish caught by worms hanging from the fisherman’s bait, how our sense organs—eyes, nose, ears, mouth—entrap us in the world of suffering; from the baby that cries when hungry and gurgles when happy, how emotions are temporary and bound by need; from the clinking bangles on the cook’s hand, how isolation is better than company if one seeks silence; from the damsel whose happiness needed the appreciation of lovers, the power of autonomy; from the arrowsmith who failed to notice the king, the power of concentration; from the spider’s web, the interconnectedness of things; from the relentless buzzing of insects, how negative sounds evoke negative emotions.’"},{"loc":"3591-3592","authors":["Devdutt Pattanaik"],"date":"2020-05-10T18:12:30.000Z","content":"The Uddhava Gita is also called the Hamsa Gita and is the song of the mendicant (avadhuta) identified as Datta, son of Atri and Anasuya, visualized with a cow and four dogs."},{"loc":"3592-3593","authors":["Devdutt Pattanaik"],"date":"2020-05-10T18:12:37.000Z","content":"Balkha tirth near the Somnath temple, Gujarat, is said to be the place where Krishna was shot by Jara."},{"loc":"3610-3612","authors":["Devdutt Pattanaik"],"date":"2020-05-10T18:15:05.000Z","content":"As Arjuna and Jara prepare to cremate the body, they realize that all the trees have disappeared as they do not want to serve as fuel for the fire that will destroy Krishna’s lifeless body. Eventually the body is cremated, but Krishna’s pinda (residue) remains unburnt and is cast in the sea. It floats back in the form of a log of wood using which Indradyumna carves the famous statues of Jagannatha, enshrined in Puri."},{"loc":"3613-3615","authors":["Devdutt Pattanaik"],"date":"2020-05-10T18:16:04.000Z","content":"In the Rig Veda there is a line which is interpreted as: ‘There exists on the seashore in a far-off place the image of a deity of the name Purushottama which is made of wood, floating as it were, on the sea. By worshipping the indestructible wood, attain the supreme place.’ People believe this refers to Jagannatha Puri."},{"loc":"3631-3633","authors":["Devdutt Pattanaik"],"date":"2020-05-10T18:17:49.000Z","content":"Among Shri Vaishnavas, God is transcendent (para); he also has cosmic forms (vyuha) and earthly descents (avatar). He dwells within us (antaryami) and in images (archa) consecrated in temples as in Tirupati in Andhra Pradesh, and Srirangam in Tamil Nadu."},{"loc":"3698-3700","authors":["Devdutt Pattanaik"],"date":"2020-05-10T18:24:41.000Z","content":"Undersea archaeology near modern-day Dwaraka revealed the existence of ancient ruins dating back to the Harappan period, thus suggesting to many that Krishna’s city did indeed exist. Historians are not sure. For the faithful, it does not matter."},{"loc":"3707-3711","authors":["Devdutt Pattanaik"],"date":"2020-05-10T18:25:38.000Z","content":"‘Krishna, Vaikuntha Natha, Shrinivasa, Padmanabha, Lakshmipriya, Vishnu, Narayana, Hari, Yashoda-nandan, Nanda-kishore, Vasudeva, Sauri, Devaki-nandan, Yaduvamsa-chudamani, Gopala, Govinda, Murari, Jagannatha, Radha Ramana, Gopika Vallabha, Banke Bihari, Madhusudana, Manmohan, Dwarakadhish, Mathuresh, Murlidhara, Chakradhara, Purushottama, Keshava, Hrishikesha, Madhava, Chaturbhuja, Chakrin, Rukmani Priya, Parthasarathy, Janardana, Yagna, Viratarupa, Adideva, Sakha!’"},{"loc":"3774-3777","authors":["Devdutt Pattanaik"],"date":"2020-05-10T18:33:26.000Z","content":"Krishna is purna-avatar because, despite knowing he is God, complete and autonomous, he enjoys all human emotions from parental affection (vatsalya), to friendly delight (madhurya) to erotic yearnings (shringara) that is born from incompleteness and inadequacy. He does not walk away from the yagna; even though he wants nothing, still he gives to receive, and is not attached to anything that is received. This is Vedic wisdom: not escape, but awareness leading to indulgence of the unaware."},{"loc":"3796-3800","authors":["Devdutt Pattanaik"],"date":"2020-05-10T18:36:52.000Z","content":"Guruvayurappan in Kerala, the child who appeared as the four-armed Vishnu before his parents; Krishna of Udupi in Karnataka, the one with the churning staff who turned around to face his devotees; Banke Bihari of Vrindavana who holds the flute and bends like a dancer; Srinathji of Nathdvara in Udaipur who holds aloft the Govardhan mountain; the four-armed Ranchhodrai of Dakor in Gujarat, who fled from the battlefield; moustachioed Parthasarathy of Chennai in Tamil Nadu with his conch-shell trumpet; Sakshi Gopal of Odisha who bears witness to his devotees; Vitthala of Pandharpur in Maharashtra, who waits arms akimbo for his followers."},{"loc":"3833-3834","authors":["Devdutt Pattanaik"],"date":"2020-05-10T18:47:03.000Z","content":"…hunger for food and the fear of becoming food differentiates the living organism (sajiva) from the non-living object (ajiva)."},{"loc":"3844-3846","authors":["Devdutt Pattanaik"],"date":"2020-05-10T18:48:41.000Z","content":"While Hindus believe there is continuity between Vedic Hinduism where communication was through rituals and, later, philosophy, and Puranic Hinduism where communication is through stories, Western scholars perceive discontinuity and reject the Hindu idea of unfragmented timeless communication—sanatan dharma."},{"loc":"3884-3887","authors":["Devdutt Pattanaik"],"date":"2020-05-10T18:54:05.000Z","content":"It is important to note that texts that tell us the story of Krishna’s life do not emerge chronologically. The 2000-year-old Mahabharata tells the story of Krishna’s adult life and death; his childhood stories are found in the 1700-year-old Harivamsa; his circular dance is first mentioned in portions of the 1000-year-old Bhagavata Purana; his love for Radha is clearly articulated only in the 800-year-old Gita Govinda; and the two become a celestial pair, creators of the cosmos, only in the 500-year-old Brahmavaivarta Purana."},{"loc":"3890-3891","authors":["Devdutt Pattanaik"],"date":"2020-05-10T18:54:29.000Z","content":"Cave drawings in Mirzapur, Uttar Pradesh, dated 800 BCE, depict a man holding a wheel, or disc, on a chariot drawn by two horses, that some have interpreted to mean Krishna."},{"loc":"3905-3913","authors":["Devdutt Pattanaik"],"date":"2020-05-10T18:57:30.000Z","content":"There is much disagreement about the dating of the Bhagavata Purana, the most revered text of Krishna worshippers in which Krishna is the supreme form of the divine, greater even than Vishnu. It clearly came into being after the Harivamsa (1700 years old) and the Vishnu Purana (1500 years old). Conservative scholars believe it is less than 1400 years old, on grounds that it does not refer to famous kings such as Harsha who lived 1300 years ago. However, there are many references to the Advaita Purana of Shankara who lived in the eighth century CE and to the immersive worship of Vishnu-Krishna of Alvar poet-saints dated from the sixth to the ninth centuries ce. Shankara was born in Kerala and moved northwards, while Alvars were residents of Tamilakam. This has led to speculation that the Bhagavata Purana, with its ornate language and rich devotion, reached its final form 1000 years ago and is the work of brahmins from south India. Curiously, the great teacher Ramanuja, who lived in the twelfth century ce, and established the much-revered Srirangam temple complex, does not refer to this most revered Purana. Madhva-acharya refers to this scripture in the thirteenth century."},{"loc":"3914-3915","authors":["Devdutt Pattanaik"],"date":"2020-05-10T18:57:34.000Z","content":"Krishna is called Vasudeva, with stress on the first vowel, to indicate that he is the son of Vasudev. He is also called Sauri, the grandson of Surasena."},{"loc":"3953-3956","authors":["Devdutt Pattanaik"],"date":"2020-05-10T19:01:17.000Z","content":"There is a tendency, driven by political agenda, to homogenize Hinduism over time and space, making it a grove of similar trees rather than recognize it as a dynamic landscape of multiple ecosystems. This has often resulted in an understanding of Hinduism that is centred on north India and Sanskrit, which disregards contributions of the rest of India and its many languages. This prevents us from recognizing that ideas about Krishna emerged not at once everywhere but gradually, in different places, and spread in different times."},{"loc":"3969-3971","authors":["Devdutt Pattanaik"],"date":"2020-05-10T19:02:46.000Z","content":"The British, however, saw Krishna lore as vulgar. How could a god dance and sing and play with women? In 1862, Sir Mathew Sausse, a British judge of the Bombay High Court, actually pronounced Krishna ‘guilty’ of lewd sensuality. Embarrassed by their colonial masters, many Indians began sanitizing Hinduism, Bhagavata lore in particular."},{"loc":"3982-3986","authors":["Devdutt Pattanaik"],"date":"2020-05-10T19:05:20.000Z","content":"As urbanization takes us away from nature, Krishna is no longer imagined as a dark-complexioned god, but as blue- and even white-skinned. Once considered inauspicious, white marble, rather than granite and sandstone, is being used to make icons of Krishna that are bathed with fluorescent lights. The experience is very different from seeing a black icon of igneous rock, decked with flowers, in the light of oil lamps. On cartoon channels, Krishna is presented as a ‘cute’ hero who beats up bad guys. Violence has been stripped of wisdom, sex cloaked with shame."}]