[{"loc":"32-34","authors":["Hermann Hesse"],"date":"2020-04-26T21:27:12.000Z","content":"He already knew how to speak the Om silently, the word of words, to speak it silently into himself while inhaling, to speak it silently out of himself while exhaling, with all the concentration of his soul, the forehead surrounded by the glow of the clear-thinking spirit."},{"loc":"61-67","authors":["Hermann Hesse"],"date":"2020-04-26T21:32:16.000Z","content":"Was it really Prajapati who had created the world? Was it not the Atman, He, the only one, the singular one? Were the gods not creations, created like me and you, subject to time, mortal? Was it therefore good, was it right, was it meaningful and the highest occupation to make offerings to the gods? For whom else were offerings to be made, who else was to be worshipped but Him, the only one, the Atman? And where was Atman to be found, where did He reside, where did his eternal heart beat, where else but in one’s own self, in its innermost part, in its indestructible part, which everyone had in himself? But where, where was this self, this innermost part, this ultimate part? It was not flesh and bone, it was neither thought nor consciousness, thus the wisest ones taught. So, where, where was it? To reach this place, the self, myself, the Atman, there was another way, which was worthwhile looking for?"},{"loc":"85-87","authors":["Hermann Hesse"],"date":"2020-04-26T21:36:09.000Z","content":"Often he spoke to himself from a Chandogya-Upanishad the words: “Truly, the name of the Brahman is satyam—verily, he who knows such a thing, will enter the heavenly world every day.”"},{"loc":"93-94","authors":["Hermann Hesse"],"date":"2020-04-26T21:37:05.000Z","content":"Om is the bow, the arrow is soul, The Brahman is the arrow’s target, That one should incessantly hit."},{"loc":"167-171","authors":["Hermann Hesse"],"date":"2020-04-26T21:44:55.000Z","content":"A goal stood before Siddhartha, a single goal: to become empty, empty of thirst, empty of wishing, empty of dreams, empty of joy and sorrow. Dead to himself, not to be a self any more, to find tranquility with an emptied heard, to be open to miracles in unselfish thoughts, that was his goal. Once all of my self was overcome and had died, once every desire and every urge was silent in the heart, then the ultimate part of me had to awake, the innermost of my being, which is no longer my self, the great secret."},{"loc":"206-211","authors":["Hermann Hesse"],"date":"2020-04-26T21:51:32.000Z","content":"“What is meditation? What is leaving one’s body? What is fasting? What is holding one’s breath? It is fleeing from the self, it is a short escape of the agony of being a self, it is a short numbing of the senses against the pain and the pointlessness of life. The same escape, the same short numbing is what the driver of an ox-cart finds in the inn, drinking a few bowls of rice-wine or fermented coconut-milk. Then he won’t feel his self any more, then he won’t feel the pains of life any more, then he finds a short numbing of the senses. When he falls asleep over his bowl of rice-wine, he’ll find the same what Siddhartha and Govinda find when they escape their bodies through long exercises, staying in the non-self. This is how it is, oh Govinda.”"},{"loc":"243-245","authors":["Hermann Hesse"],"date":"2020-04-26T21:55:31.000Z","content":"And Govinda mumbled a verse to himself, a verse from an Upanishad: He who ponderingly, of a purified spirit, loses himself in the meditation of Atman, unexpressable by words is his blissfulness of his heart."},{"loc":"410-413","authors":["Hermann Hesse"],"date":"2020-04-28T21:23:56.000Z","content":"…be warned, oh seeker of knowledge, of the thicket of opinions and of arguing about words. There is nothing to opinions, they may be beautiful or ugly, smart or foolish, everyone can support them or discard them. But the teachings, you’ve heard from me, are no opinion, and their goal is not to explain the world to those who seek knowledge. They have a different goal; their goal is salvation from suffering. This is what Gotama teaches, nothing else.”"},{"loc":"419-423","authors":["Hermann Hesse"],"date":"2020-04-28T21:25:56.000Z","content":"…one,—nobody will obtain salvation by means of teachings! You will not be able to convey and say to anybody, oh venerable one, in words and through teachings what has happened to you in the hour of enlightenment! The teachings of the enlightened Buddha contain much, it teaches many to live righteously, to avoid evil. But there is one thing which these so clear, these so venerable teachings do not contain: they do not contain the mystery of what the exalted one has experienced for himself, he alone among hundreds of thousands."},{"loc":"438-438","authors":["Hermann Hesse"],"date":"2020-04-28T21:27:35.000Z","content":"“You know how to talk wisely, my friend. Be aware of too much wisdom!”"},{"loc":"467-470","authors":["Hermann Hesse"],"date":"2020-04-28T21:35:00.000Z","content":"…know nothing about myself, that Siddhartha has remained thus alien and unknown to me, stems from one cause, a single cause: I was afraid of myself, I was fleeing from myself! I searched Atman, I searched Brahman, I was willing to to dissect my self and peel off all of its layers, to find the core of all peels in its unknown interior, the Atman, life, the divine part, the ultimate part. But I have lost myself in the process.”"},{"loc":"467-469","authors":["Hermann Hesse"],"date":"2020-04-28T21:35:05.000Z","content":"“That I know nothing about myself, that Siddhartha has remained thus alien and unknown to me, stems from one cause, a single cause: I was afraid of myself, I was fleeing from myself! I searched Atman, I searched Brahman, I was willing to to dissect my self and peel off all of its layers, to find the core of all peels in its unknown interior, the Atman, life, the divine part, the ultimate part."},{"loc":"473-476","authors":["Hermann Hesse"],"date":"2020-04-28T21:35:59.000Z","content":"No longer, I want to begin my thoughts and my life with Atman and with the suffering of the world. I do not want to kill and dissect myself any longer, to find a secret behind the ruins. Neither Yoga-Veda shall teach me any more, nor Atharva-Veda, nor the ascetics, nor any kind of teachings. I want to learn from myself, want to be my student, want to get to know myself, the secret of Siddhartha.”"},{"loc":"485-489","authors":["Hermann Hesse"],"date":"2020-04-28T21:38:49.000Z","content":"“When someone reads a text, wants to discover its meaning, he will not scorn the symbols and letters and call them deceptions, coincidence, and worthless hull, but he will read them, he will study and love them, letter by letter. But I, who wanted to read the book of the world and the book of my own being, I have, for the sake of a meaning I had anticipated before I read, scorned the symbols and letters, I called the visible world a deception, called my eyes and my tongue coincidental and worthless forms without substance. No, this is over, I have awakened, I have indeed awakened and have not been born before this very day.”"},{"loc":"544-545","authors":["Hermann Hesse"],"date":"2020-04-28T21:51:06.000Z","content":"…nothing could be achieved by killing the random self of the senses, if the random self of thoughts and learned knowledge was fattened on the other hand."},{"loc":"650-651","authors":["Hermann Hesse"],"date":"2020-04-28T22:02:40.000Z","content":"…love can be obtained by begging, buying, receiving it as a gift, finding it in the street, but it cannot be stolen."},{"loc":"717-723","authors":["Hermann Hesse"],"date":"2020-04-28T22:09:00.000Z","content":"When you throw a rock into the water, it will speed on the fastest course to the bottom of the water. This is how it is when Siddhartha has a goal, a resolution. Siddhartha does nothing, he waits, he thinks, he fasts, but he passes through the things of the world like a rock through water, without doing anything, without stirring; he is drawn, he lets himself fall. His goal attracts him, because he doesn’t let anything enter his soul which might oppose the goal. This is what Siddhartha has learned among the Samanas. This is what fools call magic and of which they think it would be effected by means of the daemons. Nothing is effected by daemons, there are no daemons. Everyone can perform magic, everyone can reach his goals, if he is able to think, if he is able to wait, if he is able to fast.”"},{"loc":"765-765","authors":["Hermann Hesse"],"date":"2020-05-03T15:32:26.000Z","content":"“Writing is good, thinking is better. Being smart is good, being patient is better.”"},{"loc":"1154-1156","authors":["Hermann Hesse"],"date":"2020-05-03T16:20:30.000Z","content":"Too much knowledge had held him back, too many holy verses, too many sacrificial rules, to much self-castigation, so much doing and striving for that goal! Full of arrogance, he had been, always the smartest, always working the most, always one step ahead of all others, always the knowing and spiritual one, always the priest or wise one."},{"loc":"1526-1530","authors":["Hermann Hesse"],"date":"2020-05-03T17:00:29.000Z","content":"Slowly blossomed, slowly ripened in Siddhartha the realisation, the knowledge, what wisdom actually was, what the goal of his long search was. It was nothing but a readiness of the soul, an ability, a secret art, to think every moment, while living his life, the thought of oneness, to be able to feel and inhale the oneness. Slowly this blossomed in him, was shining back at him from Vasudeva’s old, childlike face: harmony, knowledge of the eternal perfection of the world, smiling, oneness. But"},{"loc":"1654-1655","authors":["Hermann Hesse"],"date":"2020-05-03T17:16:22.000Z","content":"Look, my dear Govinda, this is one of my thoughts, which I have found: wisdom cannot be passed on. Wisdom which a wise man tries to pass on to someone always sounds like foolishness.”"},{"loc":"1657-1658","authors":["Hermann Hesse"],"date":"2020-05-03T17:16:46.000Z","content":"Knowledge can be conveyed, but not wisdom. It can be found, it can be lived, it is possible to be carried by it, miracles can be performed with it, but it cannot be expressed in words and taught. This"},{"loc":"1660-1662","authors":["Hermann Hesse"],"date":"2020-05-03T17:17:31.000Z","content":"The opposite of every truth is just as true! That’s like this: any truth can only be expressed and put into words when it is one-sided. Everything is one-sided which can be thought with thoughts and said with words, it’s all one-sided, all just one half, all lacks completeness, roundness, oneness."},{"loc":"1664-1665","authors":["Hermann Hesse"],"date":"2020-05-03T17:19:01.000Z","content":"A person or an act is never entirely Sansara or entirely Nirvana, a person is never entirely holy or entirely sinful."},{"loc":"1665-1667","authors":["Hermann Hesse"],"date":"2020-05-03T17:19:07.000Z","content":"Time is not real, Govinda, I have experienced this often and often again. And if time is not real, then the gap which seems to be between the world and the eternity, between suffering and blissfulness, between evil and good, is also a deception.”"},{"loc":"1672-1679","authors":["Hermann Hesse"],"date":"2020-05-03T17:20:12.000Z","content":"The world, my friend Govinda, is not imperfect, or on a slow path towards perfection: no, it is perfect in every moment, all sin already carries the divine forgiveness in itself, all small children already have the old person in themselves, all infants already have death, all dying people the eternal life. It is not possible for any person to see how far another one has already progressed on his path; in the robber and dice-gambler, the Buddha is waiting; in the Brahman, the robber is waiting. In deep meditation, there is the possibility to put time out of existence, to see all life which was, is, and will be as if it was simultaneous, and there everything is good, everything is perfect, everything is Brahman. Therefore, I see whatever exists as good, death is to me like life, sin like holiness, wisdom like foolishness, everything has to be as it is, everything only requires my consent, only my willingness, my loving agreement, to be good for me, to do nothing but work for my benefit, to be unable to ever harm me."},{"loc":"1695-1696","authors":["Hermann Hesse"],"date":"2020-05-03T17:25:40.000Z","content":"…one man’s treasure and wisdom always sounds like foolishness to another person.”"},{"loc":"1702-1703","authors":["Hermann Hesse"],"date":"2020-05-03T17:26:34.000Z","content":"…salvation and virtue as well, Sansara and Nirvana as well, are mere words, Govinda. There is no thing which would be Nirvana; there is just the word Nirvana."}]