[{"loc":"71-72","authors":["Mark Manson"],"date":"2019-02-17T20:43:49.000Z","content":"Self-improvement and success often occur together. But that doesn’t necessarily mean they’re the same thing."},{"loc":"82-84","authors":["Mark Manson"],"date":"2019-02-17T20:46:21.000Z","content":"Ironically, this fixation on the positive—on what’s better, what’s superior—only serves to remind us over and over again of what we are not, of what we lack, of what we should have been but failed to be. After all, no truly happy person feels the need to stand in front of a mirror and recite that she’s happy. She just is."},{"loc":"86-87","authors":["Mark Manson"],"date":"2019-02-17T20:46:54.000Z","content":"…if you’re dreaming of something all the time, then you’re reinforcing the same unconscious reality over and over: that you are not that."},{"loc":"95-96","authors":["Mark Manson"],"date":"2019-02-17T20:48:10.000Z","content":"The key to a good life is not giving a fuck about more; it’s giving a fuck about less, giving a fuck about only what is true and immediate and important."},{"loc":"139-140","authors":["Mark Manson"],"date":"2019-02-17T20:55:44.000Z","content":"The desire for more positive experience is itself a negative experience. And, paradoxically, the acceptance of one’s negative experience is itself a positive experience."},{"loc":"142-144","authors":["Mark Manson"],"date":"2019-02-17T20:56:55.000Z","content":"Alan Watts used to refer to as “the backwards law”—the idea that the more you pursue feeling better all the time, the less satisfied you become, as pursuing something only reinforces the fact that you lack it in the first place."},{"loc":"147-148","authors":["Mark Manson"],"date":"2019-02-17T20:57:29.000Z","content":"The more you want to be spiritually enlightened, the more self-centered and shallow you become in trying to get there."},{"loc":"150-152","authors":["Mark Manson"],"date":"2019-02-17T20:59:42.000Z","content":"“You will never be happy if you continue to search for what happiness consists of. You will never live if you are looking for the meaning of life.” Or put more simply: Don’t try."},{"loc":"162-163","authors":["Mark Manson"],"date":"2019-02-17T21:01:08.000Z","content":"Being open with your insecurities paradoxically makes you more confident and charismatic around others."},{"loc":"163-164","authors":["Mark Manson"],"date":"2019-02-17T21:01:25.000Z","content":"Suffering through your fears and anxieties is what allows you to build courage and perseverance."},{"loc":"165-167","authors":["Mark Manson"],"date":"2019-02-17T21:01:48.000Z","content":"Everything worthwhile in life is won through surmounting the associated negative experience. Any attempt to escape the negative, to avoid it or quash it or silence it, only backfires. The avoidance of suffering is a form of suffering. The avoidance of struggle is a struggle. The denial of failure is a failure. Hiding what is shameful is itself a form of shame."},{"loc":"178-179","authors":["Mark Manson"],"date":"2019-02-17T21:05:12.000Z","content":"To not give a fuck is to stare down life’s most terrifying and difficult challenges and still take action."},{"loc":"203-204","authors":["Mark Manson"],"date":"2019-02-17T21:09:53.000Z","content":"Subtlety #1: Not giving a fuck does not mean being indifferent; it means being comfortable with being different."},{"loc":"234-235","authors":["Mark Manson"],"date":"2019-02-17T21:16:38.000Z","content":"Subtlety #2: To not give a fuck about adversity, you must first give a fuck about something more important than adversity."},{"loc":"233-234","authors":["Mark Manson"],"date":"2019-02-17T21:16:47.000Z","content":"The point isn’t to get away from the shit. The point is to find the shit you enjoy dealing with."},{"loc":"246-248","authors":["Mark Manson"],"date":"2019-02-17T21:19:07.000Z","content":"If you find yourself consistently giving too many fucks about trivial shit that bothers you — your ex-boyfriend’s new Facebook picture, how quickly the batteries die in the TV remote, missing out on yet another two-for-one sale on hand sanitizer — chances are you don’t have much going on in your life to give a legitimate fuck about."},{"loc":"253-254","authors":["Mark Manson"],"date":"2019-02-17T21:19:47.000Z","content":"Subtlety #3: Whether you realize it or not, you are always choosing what to give a fuck about."},{"loc":"263-264","authors":["Mark Manson"],"date":"2019-02-17T21:21:28.000Z","content":"Maturity is what happens when one learns to only give a fuck about what’s truly fuckworthy."},{"loc":"279-280","authors":["Mark Manson"],"date":"2019-02-17T21:23:49.000Z","content":"This belief that it’s not okay to be inadequate sometimes is the source of the growing Feedback Loop from Hell that is coming to dominate our culture."},{"loc":"280-282","authors":["Mark Manson"],"date":"2019-02-17T21:24:05.000Z","content":"The idea of not giving a fuck is a simple way of reorienting our expectations for life and choosing what is important and what is not. Developing this ability leads to something I like to think of as a kind of “practical enlightenment.”"},{"loc":"284-286","authors":["Mark Manson"],"date":"2019-02-17T21:25:29.000Z","content":"…no matter what you do, life is comprised of failures, loss, regrets, and even death. Because once you become comfortable with all the shit that life throws at you (and it will throw a lot of shit, trust me), you become invincible in a sort of low-level spiritual way. After all, the only way to overcome pain is to first learn how to bear it."},{"loc":"326-328","authors":["Mark Manson"],"date":"2019-02-17T21:30:59.000Z","content":"…life itself is a form of suffering. The rich suffer because of their riches. The poor suffer because of their poverty. People without a family suffer because they have no family. People with a family suffer because of their family. People who pursue worldly pleasures suffer because of their worldly pleasures. People who abstain from worldly pleasures suffer because of their abstention."},{"loc":"335-337","authors":["Mark Manson"],"date":"2019-02-17T21:37:21.000Z","content":"Happiness is not a solvable equation. Dissatisfaction and unease are inherent parts of human nature and, as we’ll see, necessary components to creating consistent happiness."},{"loc":"392-395","authors":["Mark Manson"],"date":"2019-02-17T21:45:15.000Z","content":"Happiness comes from solving problems. The keyword here is “solving.” If you’re avoiding your problems or feel like you don’t have any problems, then you’re going to make yourself miserable. If you feel like you have problems that you can’t solve, you will likewise make yourself miserable. The secret sauce is in the solving of the problems, not in not having problems in the first place."},{"loc":"427-430","authors":["Mark Manson"],"date":"2019-02-18T21:27:23.000Z","content":"…negative emotions are a call to action. When you feel them, it’s because you’re supposed to do something. Positive emotions, on the other hand, are rewards for taking the proper action. When you feel them, life seems simple and there is nothing else to do but enjoy it. Then, like everything else, the positive emotions go away, because more problems inevitably emerge."},{"loc":"439-440","authors":["Mark Manson"],"date":"2019-02-18T21:30:12.000Z","content":"Decision-making based on emotional intuition, without the aid of reason to keep it in line, pretty much always sucks."},{"loc":"445-446","authors":["Mark Manson"],"date":"2019-02-18T21:31:22.000Z","content":"“Hedonic Treadmill”: the idea that we’re always working hard to change our life situation, but we actually never feel very different."},{"loc":"448-449","authors":["Mark Manson"],"date":"2019-02-18T21:33:50.000Z","content":"Everything comes with an inherent sacrifice—whatever makes us feel good will also inevitably make us feel bad. What we gain is also what we lose. What creates our positive experiences will define our negative experiences."},{"loc":"490-492","authors":["Mark Manson"],"date":"2019-02-18T21:59:54.000Z","content":"I was in love with the result — the image of me on stage, people cheering, me rocking out, pouring my heart into what I was playing — but I wasn’t in love with the process. And because of that, I failed at it."},{"loc":"499-501","authors":["Mark Manson"],"date":"2019-02-18T22:13:04.000Z","content":"I wanted the reward and not the struggle. I wanted the result and not the process. I was in love with not the fight but only the victory. And life doesn’t work that way. Who you are is defined by what you’re willing to struggle for."},{"loc":"505-508","authors":["Mark Manson"],"date":"2019-02-18T22:16:06.000Z","content":"This is the most simple and basic component of life: our struggles determine our successes. Our problems birth our happiness, along with slightly better, slightly upgraded problems. See: it’s a never-ending upward spiral. And if you think at any point you’re allowed to stop climbing, I’m afraid you’re missing the point. Because the joy is in the climb itself."},{"loc":"540-541","authors":["Mark Manson"],"date":"2019-02-18T22:20:51.000Z","content":"…merely feeling good about yourself doesn’t really mean anything unless you have a good reason to feel good about yourself."},{"loc":"541-542","authors":["Mark Manson"],"date":"2019-02-18T22:21:36.000Z","content":"…adversity and failure are actually useful and even necessary for developing strong-minded and successful adults."},{"loc":"548-550","authors":["Mark Manson"],"date":"2019-02-18T22:22:33.000Z","content":"The problem with the self-esteem movement is that it measured self-esteem by how positively people felt about themselves. But a true and accurate measurement of one’s self-worth is how people feel about the negative aspects of themselves."},{"loc":"569-572","authors":["Mark Manson"],"date":"2019-02-18T22:27:14.000Z","content":"People who feel entitled view every occurrence in their life as either an affirmation of, or a threat to, their own greatness. If something good happens to them, it’s because of some amazing feat they accomplished. If something bad happens to them, it’s because somebody is jealous and trying to bring them down a notch. Entitlement is impervious. People who are entitled delude themselves into whatever feeds their sense of superiority. They keep their mental facade standing at all costs, even if it sometimes requires being physically or emotionally abusive to those around them."},{"loc":"574-575","authors":["Mark Manson"],"date":"2019-02-18T22:27:49.000Z","content":"The true measurement of self-worth is not how a person feels about her positive experiences, but rather how she feels about her negative experiences."},{"loc":"577-579","authors":["Mark Manson"],"date":"2019-02-18T22:28:23.000Z","content":"A person who actually has a high self-worth is able to look at the negative parts of his character frankly—“Yes, sometimes I’m irresponsible with money,” “Yes, sometimes I exaggerate my own successes,” “Yes, I rely too much on others to support me and should be more self-reliant”—and then acts to improve upon them."},{"loc":"675-681","authors":["Mark Manson"],"date":"2019-02-18T22:41:13.000Z","content":"The deeper the pain, the more helpless we feel against our problems, and the more entitlement we adopt to compensate for those problems. This entitlement plays out in one of two ways:"},{"loc":"689-690","authors":["Mark Manson"],"date":"2019-02-18T22:44:19.000Z","content":"Often, it’s this realization — that you and your problems are actually not privileged in their severity or pain — that is the first and most important step toward solving them."},{"loc":"698-700","authors":["Mark Manson"],"date":"2019-02-18T22:46:45.000Z","content":"The more freedom we’re given to express ourselves, the more we want to be free of having to deal with anyone who may disagree with us or upset us. The more exposed we are to opposing viewpoints, the more we seem to get upset that those other viewpoints exist. The easier and more problem-free our lives become, the more we seem to feel entitled for them to get even better."},{"loc":"730-731","authors":["Mark Manson"],"date":"2019-02-18T22:52:37.000Z","content":"The inundation of the exceptional makes people feel worse about themselves, makes them feel that they need to be more extreme, more radical, and more self-assured to get noticed or even matter."},{"loc":"746-748","authors":["Mark Manson"],"date":"2019-02-18T22:54:49.000Z","content":"When a culture’s standard of success is to “be extraordinary,” it then becomes better to be at the extreme low end of the bell curve than to be in the middle, because at least there you’re still special and deserve attention. Many people choose this strategy: to prove to everyone that they are the most miserable, or the most oppressed, or the most victimized."},{"loc":"748-752","authors":["Mark Manson"],"date":"2019-02-18T22:55:55.000Z","content":"A lot of people are afraid to accept mediocrity because they believe that if they accept it, they’ll never achieve anything, never improve, and that their life won’t matter. This sort of thinking is dangerous. Once you accept the premise that a life is worthwhile only if it is truly notable and great, then you basically accept the fact that most of the human population (including yourself) sucks and is worthless. And this mindset can quickly turn dangerous, to both yourself and others."},{"loc":"755-756","authors":["Mark Manson"],"date":"2019-02-18T22:56:29.000Z","content":"People who become great at something become great because they understand that they’re not already great—they are mediocre, they are average—and that they could be so much better."},{"loc":"863-865","authors":["Mark Manson"],"date":"2019-02-19T21:46:16.000Z","content":"We all have emotional blind spots. Often they have to do with the emotions that we were taught were inappropriate growing up. It takes years of practice and effort to get good at identifying blind spots in ourselves and then expressing the affected emotions appropriately. But this task is hugely important, and worth the effort."},{"loc":"892-894","authors":["Mark Manson"],"date":"2019-02-20T21:02:49.000Z","content":"Honest self-questioning is difficult. It requires asking yourself simple questions that are uncomfortable to answer. In fact, in my experience, the more uncomfortable the answer, the more likely it is to be true."},{"loc":"923-924","authors":["Mark Manson"],"date":"2019-02-20T21:10:17.000Z","content":"Problems may be inevitable, but the meaning of each problem is not. We get to control what our problems mean based on how we choose to think about them, the standard by which we choose to measure them."},{"loc":"945-948","authors":["Mark Manson"],"date":"2019-02-20T21:15:13.000Z","content":"We’re apes. We think we’re all sophisticated with our toaster ovens and designer footwear, but we’re just a bunch of finely ornamented apes. And because we are apes, we instinctually measure ourselves against others and vie for status. The question is not whether we evaluate ourselves against others; rather, the question is by what standard do we measure ourselves?"},{"loc":"959-959","authors":["Mark Manson"],"date":"2019-02-20T21:16:44.000Z","content":"Our values determine the metrics by which we measure ourselves and everyone else."},{"loc":"962-963","authors":["Mark Manson"],"date":"2019-02-20T21:17:16.000Z","content":"If you want to change how you see your problems, you have to change what you value and/or how you measure failure/success."},{"loc":"994-995","authors":["Mark Manson"],"date":"2019-02-20T21:22:10.000Z","content":"Pleasure is great, but it’s a horrible value to prioritize your life around."},{"loc":"1001-1003","authors":["Mark Manson"],"date":"2019-02-20T21:23:36.000Z","content":"Pleasure is not the cause of happiness; rather, it is the effect. If you get the other stuff right (the other values and metrics), then pleasure will naturally occur as a by-product."},{"loc":"1005-1006","authors":["Mark Manson"],"date":"2019-02-20T21:24:38.000Z","content":"Research shows that once one is able to provide for basic physical needs (food, shelter, and so on), the correlation between happiness and worldly success quickly approaches zero."},{"loc":"1009-1012","authors":["Mark Manson"],"date":"2019-02-20T21:25:16.000Z","content":"The other issue with overvaluing material success is the danger of prioritizing it over other values, such as honesty, nonviolence, and compassion. When people measure themselves not by their behavior, but by the status symbols they’re able to collect, then not only are they shallow, but they’re probably assholes as well."},{"loc":"1015-1019","authors":["Mark Manson"],"date":"2019-02-20T21:28:07.000Z","content":"The fact is, people who base their self-worth on being right about everything prevent themselves from learning from their mistakes. They lack the ability to take on new perspectives and empathize with others. They close themselves off to new and important information. It’s far more helpful to assume that you’re ignorant and don’t know a whole lot. This keeps you unattached to superstitious or poorly informed beliefs and promotes a constant state of learning and growth."},{"loc":"1024-1026","authors":["Mark Manson"],"date":"2019-02-20T21:30:33.000Z","content":"Denying negative emotions leads to experiencing deeper and more prolonged negative emotions and to emotional dysfunction. Constant positivity is a form of avoidance, not a valid solution to life’s problems—problems which, by the way, if you’re choosing the right values and metrics, should be invigorating you and motivating you."},{"loc":"1035-1037","authors":["Mark Manson"],"date":"2019-02-20T21:33:59.000Z","content":"When we force ourselves to stay positive at all times, we deny the existence of our life’s problems. And when we deny our problems, we rob ourselves of the chance to solve them and generate happiness. Problems add a sense of meaning and importance to our life. Thus to duck our problems is to lead a meaningless (even if supposedly pleasant) existence."},{"loc":"1042-1043","authors":["Mark Manson"],"date":"2019-02-20T21:36:04.000Z","content":"“One day, in retrospect, the years of struggle will strike you as the most beautiful.”"},{"loc":"1043-1045","authors":["Mark Manson"],"date":"2019-02-20T21:36:30.000Z","content":"This is why these values—pleasure, material success, always being right, staying positive—are poor ideals for a person’s life. Some of the greatest moments of one’s life are not pleasant, not successful, not known, and not positive."},{"loc":"1045-1046","authors":["Mark Manson"],"date":"2019-02-20T21:37:08.000Z","content":"The point is to nail down some good values and metrics, and pleasure and success will naturally emerge as a result. These things are side effects of good values. By themselves, they are empty highs."},{"loc":"1048-1049","authors":["Mark Manson"],"date":"2019-02-20T21:37:25.000Z","content":"Good values are 1) reality-based, 2) socially constructive, and 3) immediate and controllable. Bad values are 1) superstitious, 2) socially destructive, and 3) not immediate or controllable."},{"loc":"1054-1055","authors":["Mark Manson"],"date":"2019-02-20T21:38:08.000Z","content":"As a rule, people who are terrified of what others think about them are actually terrified of all the shitty things they think about themselves being reflected back at them.)"},{"loc":"1055-1059","authors":["Mark Manson"],"date":"2019-02-20T21:39:01.000Z","content":"Some examples of good, healthy values: honesty, innovation, vulnerability, standing up for oneself, standing up for others, self-respect, curiosity, charity, humility, creativity. Some examples of bad, unhealthy values: dominance through manipulation or violence, indiscriminate fucking, feeling good all the time, always being the center of attention, not being alone, being liked by everybody, being rich for the sake of being rich, sacrificing small animals to the pagan gods."},{"loc":"1064-1066","authors":["Mark Manson"],"date":"2019-02-20T21:40:31.000Z","content":"Values are about prioritization. Everybody would love a good cannoli or a house in the Bahamas. The question is your priorities. What are the values that you prioritize above everything else, and that therefore influence your decision-making more than anything else?"},{"loc":"1078-1081","authors":["Mark Manson"],"date":"2019-02-20T21:42:56.000Z","content":"When we have poor values—that is, poor standards we set for ourselves and others—we are essentially giving fucks about the things that don’t matter, things that in fact make our life worse. But when we choose better values, we are able to divert our fucks to something better—toward things that matter, things that improve the state of our well-being and that generate happiness, pleasure, and success as side effects."},{"loc":"1081-1083","authors":["Mark Manson"],"date":"2019-02-20T21:44:03.000Z","content":"This, in a nutshell, is what “self-improvement” is really about: prioritizing better values, choosing better things to give a fuck about. Because when you give better fucks, you get better problems. And when you get better problems, you get a better life."},{"loc":"1100-1101","authors":["Mark Manson"],"date":"2019-02-21T21:48:34.000Z","content":"Often the only difference between a problem being painful or being powerful is a sense that we chose it, and that we are responsible for it."},{"loc":"1104-1105","authors":["Mark Manson"],"date":"2019-02-21T21:50:06.000Z","content":"When we feel that we’re choosing our problems, we feel empowered. When we feel that our problems are being forced upon us against our will, we feel victimized and miserable."},{"loc":"1142-1143","authors":["Mark Manson"],"date":"2019-02-21T21:54:14.000Z","content":"There is a simple realization from which all personal improvement and growth emerges. This is the realization that we, individually, are responsible for everything in our lives, no matter the external circumstances."},{"loc":"1145-1147","authors":["Mark Manson"],"date":"2019-02-21T21:55:32.000Z","content":"Whether we consciously recognize it or not, we are always responsible for our experiences. It’s impossible not to be. Choosing to not consciously interpret events in our lives is still an interpretation of the events of our lives. Choosing to not respond to the events in our lives is still a response to the events in our lives."},{"loc":"1184-1185","authors":["Mark Manson"],"date":"2019-02-21T22:02:11.000Z","content":"A lot of people hesitate to take responsibility for their problems because they believe that to be responsible for your problems is to also be at fault for your problems."},{"loc":"1359-1363","authors":["Mark Manson"],"date":"2019-02-21T22:26:26.000Z","content":"We should pick our battles carefully, while simultaneously attempting to empathize a bit with the so-called enemy. We should approach the news and media with a healthy dose of skepticism and avoid painting those who disagree with us with a broad brush. We should prioritize values of being honest, fostering transparency, and welcoming doubt over the values of being right, feeling good, and getting revenge. These “democratic” values are harder to maintain amidst the constant noise of a networked world. But we must accept the responsibility and nurture them regardless. The future stability of our political systems may depend on it."},{"loc":"1410-1411","authors":["Mark Manson"],"date":"2019-02-22T21:35:57.000Z","content":"We shouldn’t seek to find the ultimate “right” answer for ourselves, but rather, we should seek to chip away at the ways that we’re wrong today so that we can be a little less wrong tomorrow."},{"loc":"1419-1420","authors":["Mark Manson"],"date":"2019-02-22T21:40:13.000Z","content":"Many people become so obsessed with being “right” about their life that they never end up actually living it."},{"loc":"1431-1433","authors":["Mark Manson"],"date":"2019-02-22T21:45:08.000Z","content":"Certainty is the enemy of growth. Nothing is for certain until it has already happened—and even then, it’s still debatable. That’s why accepting the inevitable imperfections of our values is necessary for any growth to take place."},{"loc":"1433-1436","authors":["Mark Manson"],"date":"2019-02-22T21:45:31.000Z","content":"Instead of striving for certainty, we should be in constant search of doubt: doubt about our own beliefs, doubt about our own feelings, doubt about what the future may hold for us unless we get out there and create it for ourselves. Instead of looking to be right all the time, we should be looking for how we’re wrong all the time. Because we are."},{"loc":"1636-1637","authors":["Mark Manson"],"date":"2019-02-22T22:15:09.000Z","content":"Parkinson’s law: “Work expands so as to fill up the time available for its completion.”"},{"loc":"1638-1638","authors":["Mark Manson"],"date":"2019-02-22T22:15:18.000Z","content":"Murphy’s law: “Whatever can go wrong will go wrong.”"},{"loc":"1639-1640","authors":["Mark Manson"],"date":"2019-02-22T22:15:37.000Z","content":"Manson’s law of avoidance on them: The more something threatens your identity, the more you will avoid it."},{"loc":"1642-1644","authors":["Mark Manson"],"date":"2019-02-22T22:17:09.000Z","content":"There’s a certain comfort that comes with knowing how you fit in the world. Anything that shakes up that comfort—even if it could potentially make your life better—is inherently scary."},{"loc":"1666-1668","authors":["Mark Manson"],"date":"2019-02-22T22:20:23.000Z","content":"If I believe I’m a nice guy, I’ll avoid situations that could potentially contradict that belief. If I believe I’m an awesome cook, I’ll seek out opportunities to prove that to myself over and over again. The belief always takes precedence. Until we change how we view ourselves, what we believe we are and are not, we cannot overcome our avoidance and anxiety. We cannot change."},{"loc":"1669-1670","authors":["Mark Manson"],"date":"2019-02-22T22:20:40.000Z","content":"In this way, “knowing yourself” or “finding yourself” can be dangerous. It can cement you into a strict role and saddle you with unnecessary expectations. It can close you off to inner potential and outer opportunities."},{"loc":"1684-1687","authors":["Mark Manson"],"date":"2019-02-22T22:23:40.000Z","content":"There’s a kind of self-absorption that comes with fear based on an irrational certainty. When you assume that your plane is the one that’s going to crash, or that your project idea is the stupid one everyone is going to laugh at, or that you’re the one everyone is going to choose to mock or ignore, you’re implicitly telling yourself, “I’m the exception; I’m unlike everybody else; I’m different and special.”"},{"loc":"1690-1692","authors":["Mark Manson"],"date":"2019-02-22T22:25:05.000Z","content":"…don’t be special; don’t be unique. Redefine your metrics in mundane and broad ways. Choose to measure yourself not as a rising star or an undiscovered genius. Choose to measure yourself not as some horrible victim or dismal failure. Instead, measure yourself by more mundane identities: a student, a partner, a friend, a creator."},{"loc":"1692-1693","authors":["Mark Manson"],"date":"2019-02-22T22:29:09.000Z","content":"The narrower and rarer the identity you choose for yourself, the more everything will seem to threaten you. For that reason, define yourself in the simplest and most ordinary ways possible."},{"loc":"1718-1720","authors":["Mark Manson"],"date":"2019-02-22T22:32:11.000Z","content":"It’s worth remembering that for any change to happen in your life, you must be wrong about something. If you’re sitting there, miserable day after day, then that means you’re already wrong about something major in your life, and until you’re able to question yourself to find it, nothing will change."},{"loc":"1724-1726","authors":["Mark Manson"],"date":"2019-02-22T22:33:12.000Z","content":"Aristotle wrote, “It is the mark of an educated mind to be able to entertain a thought without accepting it.” Being able to look at and evaluate different values without necessarily adopting them is perhaps the central skill required in changing one’s own life in a meaningful way."},{"loc":"1701-1701","authors":["Mark Manson"],"date":"2019-02-22T22:34:11.000Z","content":"Question #1: What if I’m wrong?"},{"loc":"1720-1721","authors":["Mark Manson"],"date":"2019-02-22T22:34:17.000Z","content":"Question #2: What would it mean if I were wrong?"},{"loc":"1734-1735","authors":["Mark Manson"],"date":"2019-02-22T22:34:27.000Z","content":"Question #3: Would being wrong create a better or a worse problem than my current problem, for both myself and others?"},{"loc":"1757-1758","authors":["Mark Manson"],"date":"2019-02-22T22:37:30.000Z","content":"That’s simply reality: if it feels like it’s you versus the world, chances are it’s really just you versus yourself."},{"loc":"1795-1797","authors":["Mark Manson"],"date":"2019-02-23T13:20:04.000Z","content":"Improvement at anything is based on thousands of tiny failures, and the magnitude of your success is based on how many times you’ve failed at something. If someone is better than you at something, then it’s likely because she has failed at it more than you have. If someone is worse than you, it’s likely because he hasn’t been through all of the painful learning experiences you have."},{"loc":"1847-1849","authors":["Mark Manson"],"date":"2019-02-23T13:32:16.000Z","content":"Our most radical changes in perspective often happen at the tail end of our worst moments. It’s only when we feel intense pain that we’re willing to look at our values and question why they seem to be failing us. We need some sort of existential crisis to take an objective look at how we’ve been deriving meaning in our life, and then consider changing course."},{"loc":"1910-1911","authors":["Mark Manson"],"date":"2019-02-23T13:40:29.000Z","content":"“If you’re stuck on a problem, don’t sit there and think about it; just start working on it. Even if you don’t know what you’re doing, the simple act of working on it will eventually cause the right ideas to show up in your head.”"},{"loc":"1918-1918","authors":["Mark Manson"],"date":"2019-02-23T13:41:47.000Z","content":"Action isn’t just the effect of motivation; it’s also the cause of it."},{"loc":"1928-1929","authors":["Mark Manson"],"date":"2019-02-23T13:44:07.000Z","content":"If you lack the motivation to make an important change in your life, do something—anything, really—and then harness the reaction to that action as a way to begin motivating yourself."},{"loc":"1940-1942","authors":["Mark Manson"],"date":"2019-02-23T13:46:12.000Z","content":"If we follow the “do something” principle, failure feels unimportant. When the standard of success becomes merely acting—when any result is regarded as progress and important, when inspiration is seen as a reward rather than a prerequisite—we propel ourselves ahead. We feel free to fail, and that failure moves us forward."},{"loc":"1978-1980","authors":["Mark Manson"],"date":"2019-02-24T21:24:03.000Z","content":"Freedom grants the opportunity for greater meaning, but by itself there is nothing necessarily meaningful about it. Ultimately, the only way to achieve meaning and a sense of importance in one’s life is through a rejection of alternatives, a narrowing of freedom, a choice of commitment to one place, one belief, or (gulp) one person."},{"loc":"2040-2041","authors":["Mark Manson"],"date":"2019-02-24T21:33:11.000Z","content":"The desire to avoid rejection at all costs, to avoid confrontation and conflict, the desire to attempt to accept everything equally and to make everything cohere and harmonize, is a deep and subtle form of entitlement."},{"loc":"2041-2044","authors":["Mark Manson"],"date":"2019-02-24T21:33:47.000Z","content":"Entitled people, because they feel as though they deserve to feel great all the time, avoid rejecting anything because doing so might make them or someone else feel bad. And because they refuse to reject anything, they live a valueless, pleasure-driven, and self-absorbed life. All they give a fuck about is sustaining the high a little bit longer, to avoid the inevitable failures of their life, to pretend the suffering away."},{"loc":"2245-2247","authors":["Mark Manson"],"date":"2019-02-24T22:04:29.000Z","content":"Commitment gives you freedom because you’re no longer distracted by the unimportant and frivolous. Commitment gives you freedom because it hones your attention and focus, directing them toward what is most efficient at making you healthy and happy."},{"loc":"2424-2425","authors":["Mark Manson"],"date":"2019-02-24T22:32:35.000Z","content":"“The fear of death follows from the fear of life. A man who lives fully is prepared to die at any time.”"}]